{
    "64. Greeting sb you’ve just met for the first time ": [
        "(See Sl. no. 82 Introducing people and responding to introductions.)"
    ],
    "65. Sending greetings through sb to sb else ": [
        "Please give my regards to your father, will you?",
        "Don’t forget to remember me to Ashok.",
        "Say hello to Rekha.",
        "Give my best wishes to your mother.",
        "Give my love to the children.",
        "Give my regards to Julia.",
        "Please remember me to Sumitra."
    ],
    "66. Offering help ": [
        "Can I help you?",
        "Can I give you any help?",
        "Do you need any help?",
        "Is there anything I can do to help?",
        "Why don’t you let me help you with the cooking?",
        "I’ll do it, shall I?",
        "Maybe, I could help you do it.",
        "I’m going to the post office. Would you like me to get anything for you?",
        "Can I help?",
        "Everything all right?",
        "I’ll help you.",
        "I’ll ring for the office boy.",
        "Want me to try?",
        "Please let me help you.",
        "Can I help you with it?",
        "Do you want me to help with the washing-up?",
        "Can I be of any help?",
        "Do you need some kind of help?",
        "Allow me to do it for you.",
        "It’s cold in here. Would you like me to shut the windows?",
        "I’ll do it for you.",
        "Is there anything else?",
        "Perhaps I could be of some help?",
        "Would you like me to try?",
        "I’ll be glad to help, if you need it.",
        "Do you want me to have a look?",
        "If you like, I’ll phone him up.",
        "Let me carry your bag.",
        "I suppose you want something else, do you?",
        "Shall I see if I can help you?",
        "I can help, if you like.",
        "If you like, I’ll help you with your work.",
        "Let’s have a look.",
        "Could I give you a hand to complete it?",
        "Here, I’ll show you how to do it.",
        "Permit me to help you.",
        "Can I help you with anything?",
        "Well, if you have any more trouble, just let me know.",
        "It looks heavy. Could I give you a hand with it?",
        "You seem to be having some problem.",
        "What’s wrong?",
        "I haven’t got much, but you can borrow what money I have.",
        "Perhaps I could help you do it.",
        "Let me help you.",
        "I’ll help you, if you like."
    ],
    "67. Accepting help ": [
        "Oh, that’s very kind/thoughtful of you.",
        "Could you?",
        "You’re most kind.",
        "Yes, please. I’d appreciate it.",
        "Oh, could you do that? That’d be very helpful.",
        "That’d be lovely/great.",
        "I’d be delighted if you could.",
        "Would you?",
        "That’s extremely good of you.",
        "I’d appreciate it if you could.",
        "If you’re sure it’s no trouble for you...",
        "I’d be glad if you could.",
        "Thanks. That’d be a great help.",
        "Thanks very much.",
        "I’d be glad if you would."
    ],
    "68. Declining help ": [
        "No, thank you.",
        "Don’t bother.",
        "No, please don’t bother — I can manage.",
        "Don’t worry.",
        "That’s very kind of you.",
        "Thank you, but I can manage.",
        "I’d rather do it myself, thank you.",
        "No, thanks. I’m fine.",
        "That’s OK, thanks.",
        "I’d better do it myself, thank you.",
        "I’m all right, thank you."
    ],
    "69. Asking for help ": [
        "(See Sl. no. 148 Requesting others to help you or to do sth or to give you sth)."
    ],
    "70. Expressing hope ": [
        "I just hope she’ll be able to come.",
        "I was hoping for something different this time.",
        "We hope to go there next month.",
        "I hope so.",
        "I think you’ll like our food.",
        "I very much hope they’d realize its importance.",
        "I hope we can make them feel welcome.",
        "I only hope he’ll be able to help them out.",
        "Hopefully, he’ll bring it with him.",
        "I hope to see her soon.",
        "I hope you haven’t paid for it.",
        "I hope he’ll do it.",
        "Let’s hope he’ll get better soon.",
        "I’m rather hoping the weather’ll be good."
    ],
    "71. Identifying sb or sth ": [
        "It could be Anitha.",
        "That’s her, isn’t it?",
        "This is the bag he had with him.",
        "Maybe, it’s that contractor.",
        "It’s me.",
        "It’s us.",
        "It’s them.",
        "That’s her.",
        "It’s him.",
        "She’s here.",
        "It could be a Honda.",
        "Yes, it is.",
        "There’s a big mole on his right cheek.",
        "That girl on his left is his younger sister.",
        "I think that’s her husband.",
        "It’s Ashok Malhotra from next door.",
        "I suppose that must be him.",
        "It’s a very good book.",
        "She’s got a wart on her nose.",
        "I know the man she’s standing beside.",
        "That’s him, your friend.",
        "Ah, there’s the man I told you about.",
        "I think he’s an electrician or something.",
        "I think it’s a Rolls Royce .",
        "Yes, she is.",
        "It’s your father on the phone.",
        "He has a slight limp.",
        "These are his clothes.",
        "I think that’s the one.",
        "I am a client of his.",
        "Yes, it’s her all right.",
        "This is the book you wanted, isn’t it?",
        "He has a scar on his forehead.",
        "Perhaps it’s a Honda.",
        "Well, there he is.",
        "He’s a mechanic."
    ],
    "72. Asking about identity ": [
        "Who are you?",
        "May I know who you are?",
        "Are you Mr. Iyengar?",
        "Who’s that man over there?",
        "What make of TV is it?",
        "Is that you, Asha?",
        "Who did you see at the bank?",
        "What the hell is that?",
        "Which Sharma do you mean — his brother-in-law or his neighbour?",
        "See that man? Who’s he?",
        "What sort of book is it ?",
        "Do you know who she is?",
        "Who’re those people?",
        "What in the world is it?",
        "Are you policemen?",
        "Who are you phoning?",
        "Excuse me. Are you the teacher of VIII A?",
        "What colour is it?",
        "Who on earth told you that?",
        "What’s the name of that girl?",
        "That man standing over there. Do you know him?",
        "See that thing there? What is it?",
        "Isn’t that your father?",
        "Do you recognize that man in a blue shirt?",
        "Do you know what that thing is?",
        "Who are you going to meet?",
        "What on earth is that thing in your bag?",
        "Do you have some identification with you?",
        "Do you know what that woman is?",
        "Isn’t that your bag?",
        "What kind of typewriter is it? An electronic one?",
        "That’s your uncle, isn’t it?",
        "Who is that packet for?",
        "Which of these bags is yours?",
        "What make is your car?",
        "Who’s he talking to?",
        "What type of oil do you use?"
    ],
    "73. Not identifying ": [
        "I don’t recognize him.",
        "I’m afraid I’ve no idea.",
        "I don’t know who it was.",
        "I know his face, but I can’t place him.",
        "I’ve no idea what it is.",
        "There’s some man at the door.",
        "Sorry. I don’t know.",
        "I only saw his back.",
        "I’m not certain.",
        "There’s something on the floor.",
        "He just reminds me of someone.",
        "But I can’t put a name to his face.",
        "I haven’t the faintest idea.",
        "I have no idea who that is.",
        "I have no idea what his name is.",
        "No. I don’t think so.",
        "I haven’t a clue.",
        "This isn’t mine. It must be somebody else’s.",
        "God knows.",
        "I’m not sure."
    ],
    "74. Imagining a situation ": [
        "(See Sl. no. 154 Speculating about things)."
    ],
    "75. Expressing indecision ": [
        "(See also Sl. no. 34 Expressing uncertainty and Sl. no. 56 Expressing doubt)",
        "Look, I don’t know what to do.",
        "I can’t decide whether to invite him or not.",
        "Oh, I don’t know.",
        "Maybe I shouldn’t do it.",
        "Perhaps I should write to his deputy first.",
        "I’m in two minds whether or not to do it.",
        "I don’t know what to tell them.",
        "Yes, I suppose so.",
        "I’ll possibly be able to do it.",
        "Maybe I’ll buy it, maybe I won’t.",
        "I’m a bit uncertain about this.",
        "Well, of course.",
        "It’s up to you.",
        "I’m not sure.",
        "He’s possibly one of our best workers.",
        "Well, maybe.",
        "I’m not sure what to do next.",
        "I don’t know whether to accept it or not."
    ],
    "76. Expressing indifference ": [
        "It makes no difference to me.",
        "It makes no difference.",
        "Do what you like. I don’t care.",
        "I suppose so.",
        "How should I know?",
        "It’s all the same to me.",
        "I shouldn’t worry if I were you.",
        "I don’t care!",
        "I don’t mind what you do?",
        "It’s your decision.",
        "I don’t mind.",
        "Look, why don’t you relax?",
        "It doesn’t matter.",
        "Go ahead, do it.",
        "If you like.",
        "I wouldn’t mind. Why should I?",
        "I know he’ll be angry, but I don’t care.",
        "Who cares!",
        "Who knows!",
        "It makes no difference either way.",
        "I’m easy (= I don’t mind, I have no preference).",
        "As you like.",
        "I couldn’t care less.",
        "So what?",
        "You can say whatever you like.",
        "Do as you like."
    ],
    "77. Asking for information ": [
        "Excuse me. Do you know the way to the Railway Station?",
        "Could you tell me which bus goes to Colaba?",
        "I’m looking for a place to eat. Is there a good restaurant around here?",
        "Could you tell me why today’s GT express was cancelled?",
        "What time is the Bangalore Express due in, please?",
        "Do you think you could tell me how to get to this address?",
        "I want to catch the Dadar bus. Could you tell me where the bus-stop is, please?",
        "Could you help me?",
        "How much is the fare to Madurai?",
        "How much are you asking for the rent?",
        "What time is it?",
        "What are your rates?",
        "What time is the news on?",
        "You wouldn’t know if there’s any other way, would you?",
        "How much does a ticket to Delhi cost, please?",
        "Who can I ask for some information?",
        "What’s the date today?",
        "What sort of time did you want to go?",
        "I’m sorry to trouble you, but do you happen to know where the canteen is?",
        "Could you tell me when the bus for London leaves, please?",
        "Any idea how long he’ll be here?",
        "Do you know how far it’s to the next petrol station?",
        "When’s the next bus to Adayar due, please?",
        "Excuse me. I’m trying to find my way to my hotel.",
        "Could you tell me how to get to the bus station?",
        "I’m trying to find my way to the Stock Exchange. Can you direct me?",
        "I wonder if you could help me. I’d like to know what time the next bus leaves for Mysore.",
        "Excuse me. where’s the number 107 bus-stop, please?",
        "Where does the 107 go from?",
        "You haven’t got a clue, have you?",
        "What’s the telephone number there?",
        "I wonder if you could tell me something. How often are there trains from here to Bombay?",
        "Are you on the phone?",
        "How much does the house rent for?",
        "Where can I find the toilet, please?",
        "Is he hurt badly?",
        "Is this the right road to Hyderabad?",
        "I understand you have computers for rent...?",
        "Could you tell me where the busstop for Ulsoor is?",
        "Could you tell me if the Kerala Express is late, please?",
        "Can you help me?",
        "I’m looking for some information.",
        "Could you tell me the times of trains to London please?",
        "What different colours does the car come in?",
        "Any idea when he’s likely to be back?",
        "I’m looking for the post office. Could you tell me where it is, please?",
        "Does this bus stop at Lajpat Nagar?",
        "When is the G.T. Express due?",
        "When does the Guwahati Express leave?",
        "Excuse me. I need some information.",
        "I understand you have a flat for rent...?",
        "Is this the right road for Colaba?",
        "What are the fees?",
        "When does the Library open?",
        "Do you by any chance know where the nearest public call office is?",
        "What time does this train get to Dadar, please?",
        "I’m sorry to trouble you further. There’s one other thing I’d like to know."
    ],
    "78. Insisting on sth or on doing sth ": [
        "You must go and meet her.",
        "You simply must do it.",
        "I’m afraid you’ll have to do it.",
        "I want to know when you’ll do it.",
        "I’m not leaving until I know.",
        "Do stay for dinner.",
        "You really must help him.",
        "You’ll have to finish it by this evening.",
        "You must stay for lunch, I insist.",
        "I’m sorry. I can’t accept that.",
        "I insist you do it.",
        "You must stay for tea.",
        "I don’t mind waiting. It’s very important.",
        "You will come before four — I insist.",
        "It’s essential that you meet him.",
        "I won’t go until you give me a full refund.",
        "I insist on a written report from him.",
        "If you can’t help me, I’d like to see the manager."
    ],
    "79. Instructing or directing sb what to do and what not to do ": [
        "You should always carry some money with you.",
        "Buy the best you can afford.",
        "Save me a place in the queue.",
        "Go to that counter over there.",
        "Make out a cheque for Rs.1,500."
    ],
    "100. ": [
        "Bye! Have a good time.",
        "It was nice to have seen you!",
        "Don’t forget to look us up next time you’re here.",
        "Bye! Have a good journey!"
    ],
    "80. Expressing intention ": [
        "(See also Sl. no. 116 Answering questions about plans).",
        "I’m going to cut it into four equal pieces.",
        "I’ll wait until they come.",
        "I certainly don’t intend to wait here all day.",
        "I have no intention of leaving.",
        "Here’s what I intend to do. I intend to marry her.",
        "I’m visiting my parents this weekend.",
        "I’m considering leaving this place.",
        "I think I should visit them more often.",
        "I’m not going to listen to this rubbish any longer.",
        "I’m going to stay in and watch TV.",
        "I don’t intend to argue about it.",
        "I plan to invite them all.",
        "I’ve got something fixed up for tomorrow.",
        "I’m thinking of taking up another job.",
        "I’ll help you, and I mean it.",
        "My idea is to go to the exhibition tomorrow.",
        "I’m planning to go to Bombay this weekend.",
        "I intend showing it to him.",
        "I’ve arranged to meet her after work.",
        "I’ve decided to go alone.",
        "I’m hoping to be able to complete it by tomorrow.",
        "I’ll ring you up as soon as I can.",
        "I’m hoping to visit Nagpur before returning to Delhi.",
        "I don’t intend resigning.",
        "I’ve decided not to invite them.",
        "I’ve made up my mind to remain here for a few weeks.",
        "Maybe, I should lock the house up for the holidays."
    ],
    "81. Asking about intention ": [
        "(See also Sl. no. 115 Asking about plans).",
        "Do you intend to do anything about it?",
        "Are you going to do the washing today?",
        "What do you plan to do about it?",
        "Will you deny the charge?",
        "What do you intend to do about it?",
        "Aren’t you going to do anything about it?",
        "What are you thinking of doing about it?",
        "What are you going to do?",
        "I’d like to know what you intend to do about it?",
        "Are you thinking of going out today?",
        "What are you going to do about it?"
    ],
    "82. Introducing people and responding to introductions ": [
        "(See also Sl. no. 62 Greeting people you already know). You’ll get a clear idea about both these functions from the following exchanges: 1) You: Dileep, I’d like you to meet Mr. Arora. He’s our electrical contractor. Dileep: (To Arora) How do you do? Arora: (To Dileep) How do you do? ( Formal) 2) You: Dileep, this is Arun. He’s the person I was telling you about yesterday. Arun, Dileep is one of my best friends. Dileep: (To Arun) Hi! Arun: (To Dileep) Hi! (Informal) 3) You: Dileep, I don’t think you’ve met Arun. Arun, this is Dileep. Dileep: (To Arun) Hello! Arun: (To Dileep) Hello! (Neutral) 4) You: Dileep, do you know Arun? He’s my cousin. Dileep: No, we haven’t met. (To Arun) Hello! Arun: (To Dileep) Nice to meet you, Dileep. 5) You: Dileep, meet Arun. He works with me. Dileep: (To Arun) Hello, Arun! Arun: Hi, there! 6) You: Dileep, have you met Arun? Arun is my business partner. He knows you. Dileep: (To Arun) Pleased to meet you. Arun: (To Dileep) The pleasure is mine. 7) You: Dileep, Mr. Chatterji — Sushma’s father. Dileep: (To Chatterji) Mr. Chatterji. How nice! Chatterji: (To Dileep) Glad to meet you. 8) Anil: (To Ramesh) Hello, how do you do? My name is Sharma — Anil Sharma. Ramesh: (To Anil) Pleased to meet you, Mr. Sharma. I’m Saxena — Ramesh Saxena. 9) Anil: (To Madhu) Hello, I’m Anil — Anil Sharma. Madhu: (To Anil) hello, I’m Madhu — Madhu Mukherji. 10) Anil: You’re Madhu, aren’t you? My name is Anil. I’m your next-door neighbour. Madhu: Hello, Anil. Nice to meet you. 11) Anil: My name is Anil. What’s yours? Madhu: Madhu — Madhu Mukherji. Anil: Nice to meet you, Madhu! Madhu: Nice to meet you. X: How do you do? ~ Y: How do you do? The addressee may also respond to “How do you do?” with one of these expressions: “Pleased to meet you”, “Glad to meet you” or “Nice to meet you.” So if the stranger you’re introduced to greets you with a “How do you do?”, never acknowledge the greeting with a reply like “Fine, thanks”, “Pretty well, thanks, and you?”, etc. You must always keep this point in mind. Now let me clear up a doubt that some of you may perhaps have: What I’ve said just now doesn’t mean that you cannot use “How are you?” to greet a stranger. No. In fact, you can use both “How are you?” and “How do you do?” to greet a stranger when somebody introduces him to you, especially if the situation is not formal. Yes, you can use “How are you?”, to greet a stranger as well as a person you already know. But you can use “How do you do?” only to greet a stranger, and not to greet a person you already know. Understand this difference in convention."
    ],
    "83. Introducing a conversational topic ": [
        "(See also Sl. no. 36 Changing the topic, and Sl. no. 103 Opening a conversation with a stranger).",
        "Have you heard? (Sushil has got a promotion).",
        "Haven’t you heard? (Ahmed and Priya are getting married!).",
        "Have you heard about last night’s party?",
        "Do you want to know something? (They’ve vowed never to discuss the subject again).",
        "Guess what? (They divided the money fifty-fifty).",
        "You know something? (Murthy offered her a lift, and she refused it).",
        "Look, have you seen the news?",
        "Have you heard the news?",
        "I’ve got something I must tell you.",
        "Do you know? (I think there’ll be a token woman on the committee).",
        "I’ll tell you what. (Let’s go to the cinema tonight).",
        "You know, a strange thing happened to me yesterday.",
        "Have you heard what happened?",
        "Do you know? It’s incredible (Jose says he saw the boss with Laila in Bangalore).",
        "Sad about Choudhari, isn’t it?",
        "You know what? (We’re out of touch with what’s going on).",
        "Did you hear about Sunil’s PA?",
        "Look, I’ve got a great idea. Why don’t we go for a picnic tomorrow?",
        "There’s something I want to tell you.",
        "Did you watch television last night?",
        "A very strange thing happened to me on my way home yesterday.",
        "Look, Sita, I’ll tell you what we’ll do. We’ll...",
        "You know Gopal, (I think you’ll like Linda — she’s quite a personality).",
        "I know what. (We’ll go for a walk).",
        "Isn’t it funny? (He hasn’t sent us a letter so far).",
        "Have you ever heard of such a thing?",
        "Raju, I’m afraid I’ve got something to tell you.",
        "Vinod, what about this for an idea? (Let’s go and watch the match first, and then...).",
        "Let me tell you what happened to me one day.",
        "Well, do you know, they say the country is in a recession.",
        "Isn’t it strange? (His father never talks at meals).",
        "I don’t quite know how to put this. (You see, she doesn’t want to get married right now. It’s not that she doesn’t want to get married to you. No, that isn’t the thing)."
    ],
    "84. Making an invitation ": [
        "Are you busy? How about a cup of tea?",
        "Will you join us for a cup of tea?",
        "Come on in.",
        "I’m giving a party tomorrow. Would you like to come?",
        "Do you feel like going for a walk?",
        "Can you stay for lunch?",
        "What about a cup of coffee?",
        "Help yourself to some food, Sushil.",
        "Perhaps you’d like to have a cup of tea?",
        "We’re thinking of going on a picnic this Sunday.",
        "Why don’t you join us?",
        "Help yourself to snacks.",
        "How would you like to join us for lunch?",
        "Why don’t you stay the night here?",
        "Come in and sit down.",
        "Look, I was thinking of going to a movie. Would you like to come?",
        "Ah Reddy, come and join us.",
        "Would you like to go for a walk?",
        "How about joining me for a cup of tea?",
        "Would you like to go to the movies today evening?",
        "We’re having a party next Sunday night. I thought you might like to come. And bring your wife along.",
        "Do you fancy having a bite to eat before we leave?",
        "Come and have some more coffee.",
        "Wouldn’t you like to stay for dinner?",
        "I thought I might have a party on Sunday. Would you like to come?",
        "How would you like to come and spend some time with us?",
        "Why don’t you lunch with me today?",
        "I’d like you to have lunch with us tomorrow.",
        "I’m going out for a walk. Do you feel like coming?",
        "I’m thinking of going for a cup of coffee. Coming?",
        "Come in and make yourself at home.",
        "Shall we go and see a film?",
        "I’m giving a party. Do come to my house this evening.",
        "Can I give you a lift?",
        "What about having lunch with us tomorrow?",
        "Look, Asha, there’s a good film on at the Rex, I thought we could go together.",
        "Do you feel like a cup of tea?",
        "Do you like a walk?"
    ],
    "85. Accepting an invitation ": [
        "Thank you very much. What sort of time do you want me to come?",
        "Many thanks.",
        "Fine, I’d love to.",
        "I’ll be happy to.",
        "That’s very kind of you.",
        "With pleasure!",
        "Sunday? Good idea! Yes.",
        "Thanks a lot.",
        "That’d be lovely, thank you.",
        "If you really insist...",
        "I’m most grateful.",
        "That’d be nice. What time would you like me to come?",
        "That’d be fine. Who else is going with us?",
        "It’s very kind of you.",
        "Well, if you insist.",
        "I’d like that very much.",
        "I’d be glad to. Where do we meet, then?",
        "Yes. Great!",
        "Delighted!",
        "I’d love to.",
        "All right. where shall we meet, then?",
        "What a good idea!",
        "Thanks very much.",
        "Thank you so much.",
        "It’s very good of you."
    ],
    "86. Refusing an invitation ": [
        "I’m afraid I won’t be able to come this time. You see, I’ve already arranged to do something on Sunday. How about another day?",
        "I’d love to, but I am afraid I have something else on Tuesday.",
        "That’d be very nice, but I’m afraid I can’t . You see, my daughter is ill, and I must stay home to look after her. Thanks all the same.",
        "That’s very kind of you, but you see, I won’t be free this evening.",
        "I’d rather not. I’ve got a headache, and I’d like to lie down for some time.",
        "I’m afraid I’m busy on Saturday. How about Sunday?",
        "I’m terribly sorry. I don’t think I’ll be able to come. I’ll certainly try.",
        "I’m afraid I’ve already promised to attend another meeting on that day.",
        "Oh, Ajit, I have too much work to do, and I won’t be able to leave the office before seven.",
        "I’m afraid I can’t, Anand. You see, I have some guests coming this evening. Thanks anyway.",
        "I wish I could, but I’m afraid I’m already booked up for that day.",
        "Sorry Suresh, I have something else fixed up for that day. Perhaps we could get together some other day?",
        "(When someone offers to give you a lift). No, I’d like to walk. Thanks anyway.",
        "What a pity! You see, I’m leaving for Bangalore today evening.",
        "Thank you very much for asking me, but I don’t think I can.",
        "I’m afraid I can’t. I’ll be away on that day. Thanks all the same."
    ],
    "87. Expressing irritation ": [
        "(See Sl. no. 15 Expressing anger and Sl. no.138 Rebuking sb)."
    ],
    "88. Taking leave of sb ": [
        "Bye!",
        "Bye-bye!",
        "Goodbye!",
        "I must hurry, otherwise I’m going to be late.",
        "Well, bye then, Iqbal!",
        "See you!",
        "Goodbye for now!",
        "I am terribly sorry, but I have to go now!",
        "Well, I must be off!",
        "It’s getting late. We have to leave now.",
        "I must hurry. I’m really pressed for time.",
        "I’ll see you next week!",
        "I’m sorry, but I’ve really got to go!",
        "So long!",
        "I’m afraid I must be going. It’s getting dark.",
        "I must fly! I have an engagement now.",
        "Cheers!",
        "I’m glad to have seen you, Gupta!",
        "See you again soon!",
        "Well, it’s been a real pleasure to talk to you.",
        "See you then, Suresh!",
        "Please excuse me, won’t you? I’ve got to be going now.",
        "Until next week, then! Bye!",
        "See you in the evening!",
        "Bye, everybody!",
        "I think I have to go now. I’m in quite a hurry.",
        "So long! Take care!",
        "Well, I had better be going!",
        "Well, I must be off, then!",
        "Oh, Raju, is that the time? I really must be going!",
        "See you again sometime. Bye now!",
        "Good night!",
        "I’m afraid I must think about going now.",
        "Take care. Bye!",
        "Take care of yourself!",
        "Bye bye, all!",
        "I must dash!",
        "Well, it was really nice talking to you!",
        "I’m glad we were able to have this little chat together.",
        "Goodbye, everyone! Here are two points you must remember:",
        "It’s been nice knowing you.",
        "It’s been nice meeting you.",
        "I’m glad to have met you.",
        "Nice to have met you."
    ],
    "89. Responding to sb who’s taking leave of you ": [
        "I’m sorry you have to go now.",
        "Goodbye, uncle! I hope you have a good week-end!",
        "So long, then!",
        "Thanks for coming.",
        "Look after yourself.",
        "Thank you very much for coming to see us.",
        "Must you go so soon?",
        "But you’ve only just come!",
        "Bye! Have a good trip!",
        "I hope you’ve enjoyed your stay.",
        "It was pleasant to talk to each other again.",
        "It’s only 9.00. Why don’t you stay for some more time?",
        "Goodbye, then! See you next time!",
        "I hope we can get together again.",
        "I’ll be looking forward to seeing you again.",
        "Don’t forget to write.",
        "Come on, you don’t have to go already, do you?",
        "See you later.",
        "But there’s still plenty of time.",
        "Have a good week-end!",
        "I’ve got to leave in a few minutes, too.",
        "Come back soon.",
        "At least, stay till 10."
    ],
    "90. Expressing likes ": [
        "(See Sl. no.117 Expressing pleasure and Sl. no.128 Expressing preference)."
    ],
    "91. Expressing dislikes ": [
        "(See Sl. no.118 Expressing displeasure, and Sl. no.128 Expressing preference)."
    ],
    "92. Asking about likes and dislikes ": [
        "(See Sl. no.119 Asking about pleasure and displeasure, likes and dislikes)."
    ],
    "93. Expressing likelihood ": [
        "(See Sl. no.131 Expressing probability. See also Sl. no.33 Expressing certainty and Sl. no.121 Expressing possibility)."
    ],
    "94. Stating logical conclusions ": [
        "You saw her with Pedro? So Anand was right.",
        "Did he say that? That means he doesn’t know anything about it.",
        "If he is not there, he must be with Jack.",
        "Don’t you have it with you? Then it must be with the Head Clerk.",
        "Everybody must have left for the evening — because nobody is answering the phone.",
        "This means that he has been telling the truth.",
        "That can’t be Latha — she’s in Madras.",
        "If he waved to you, then it’s clear he saw you.",
        "A girl with a fair complexion isn’t necessarily a beautiful girl.",
        "That can’t be true, because he was with me all day yesterday.",
        "Therefore, he’s not responsible for any of these things.",
        "She said that? Then, she should have been listening to what we were saying.",
        "Only Rs.2,500? Obviously, it’s a bargain at that price.",
        "That must be Ajith.",
        "The new cars have more powerful engines, and are therefore faster.",
        "He can’t have removed it himself, because it’s too heavy.",
        "Big men are not necessarily strong men.",
        "Was she there? Then she must have seen him.",
        "It can’t be his wife, because she is here with my sister.",
        "There’s a lot of noise from next door. They must be having a party or something.",
        "So he must be with them now.",
        "These things necessarily take some time."
    ],
    "95. Stating that you have (don’t have) an obligation to do sth ": [
        "It is my duty to report this to the police.",
        "I must do everything I can to help them.",
        "I have to be at the office by nine.",
        "I must hand in my report tomorrow.",
        "I’ll have to be back here before Sunday.",
        "I’m supposed to do what he tells me.",
        "We must go at once.",
        "I’m expected to be there by seven.",
        "We needn’t hurry.",
        "I can’t get out of doing it.",
        "We have to show him our ticket.",
        "I must be there by tomorrow.",
        "I have no choice.",
        "I had to earn my living in those days.",
        "I’m going to have to reject it.",
        "We don’t have to take them there.",
        "I don’t have to attend today’s meeting.",
        "That’s something I have to do myself.",
        "I can’t refuse to do it.",
        "He wants me to go now."
    ],
    "96. Stating that others have (or don’t have) an obligation to do sth ": [
        "You have to go with her.",
        "You must finish it by tomorrow.",
        "You’ll have to pick him up from there.",
        "Nobody can force you to do it.",
        "You needn’t do it.",
        "They’ll make you do it.",
        "You’re under no obligation.",
        "You don’t need to hurry.",
        "You’re not required to do it by law.",
        "No, you don’t have to be there before eleven.",
        "You’re expected to get his permission before you do it.",
        "It’s not necessary to explain everything to them.",
        "It’s up to you.",
        "You don’t have to remain there, if you don’t want to.",
        "You must be here by the weekend.",
        "There’s no need to rush."
    ],
    "97. Asking whether you have an obligation to do sth or not ": [
        "Do I have to bring anything with me?",
        "Is it necessary to tell them our address?",
        "Must I give a definite reply?",
        "I don’t have to, do I?",
        "Am I required to hand over these papers to him?",
        "Do I need to leave a note for him?",
        "Is it necessary for me to remain here until they get back?",
        "Must I accept the invitation?",
        "Have I got to give them some more money?",
        "Am I expected to introduce myself to them?"
    ],
    "98. Asking whether others have an obligation to do sth or not ": [
        "Has he got to sign there?",
        "Must you work so hard?",
        "Have you got to mention this matter to him?",
        "Are you expected to follow these instructions?",
        "Do you have to buy it from there?",
        "Are you required to take a photograph of it?",
        "Do you need to get to the office so early?",
        "Is it necessary for you to collect it this evening itself?",
        "Isn’t it necessary to point out this mistake to them?"
    ],
    "99. Offering food and drink ": [
        "Would you like a drink?",
        "Will you have another cup of coffee?",
        "Can I get you a soft drink?",
        "Would you like another helping of pudding?",
        "Come on, have another one.",
        "Can I get you anything to drink?",
        "How about some more rice?",
        "Another cup of coffee?",
        "What would you say to a cup of tea?",
        "Can I get you something to eat?",
        "Try a piece of this cake, it’s home-made.",
        "A piece of chicken?",
        "Would you like to try these? They’re not hot.",
        "Some ice-cream?",
        "How about a drink, then?",
        "Can I get you some more of this curry?",
        "Help yourself to the salad.",
        "Here, have a samosa.",
        "Have another piece of cake. There’s lots left.",
        "What will you have?",
        "An orange?",
        "You’ll have some tea, won’t you?",
        "Have some more of this. Here you are.",
        "Would you like some buttermilk?",
        "Another cutlet?",
        "Would you care for a ham sandwich?",
        "Do you want anything else?",
        "Do you need any ketchup?",
        "What can I get you?",
        "Fancy a piece of cake? 1"
    ],
    "100. Accepting an offer of food or drink ": [
        "Yes, thanks.",
        "Thanks very much.",
        "Thanks. I’d love some.",
        "Good idea. I’ll have a coffee.",
        "Yes, please.",
        "Thanks. I’d like one.",
        "I wouldn’t mind a cup of coffee.",
        "Well, if it’s not too much trouble, I’ll have a coffee.",
        "Thanks, I’ll have a lemon juice, please.",
        "Thanks. I’d like some.",
        "Yes, just a drop. Thank you.",
        "Lovely! A piece, please.",
        "Yes, thank you. I’ll have some more.",
        "Thank you. That’d be nice.",
        "OK. Thank you.",
        "I won’t mind a cup of tea.",
        "Thank you very much.",
        "Thank you, I would.",
        "Just a little, please. 1"
    ],
    "101. Showing reluctance to accept an offer ": [
        "Oh no, no...",
        "I’m afraid not.",
        "Look, I can’t possibly let you...",
        "Oh no... I couldn’t eat any more...",
        "Well, if I have to.",
        "No, no... please.",
        "I don’t think I can accept this, you know...",
        "Well, if you insist.",
        "Well, if you really want me to.",
        "Look, there’s no need...",
        "No, no... I’ve only just had lunch...",
        "If it’s all the same to you, I won’t.",
        "Well, if you really think so.",
        "Some other time, perhaps...",
        "No, it’s far too much, really.",
        "I’d rather not.",
        "I’m not sure I can accept this, thank you. 1"
    ],
    "102. Declining an offer of food or drink ": [
        "No, thank you. It’s really superb, but I really couldn’t.",
        "No, not for me. Thanks.",
        "Not for the moment. Thank you.",
        "Not this time, thanks.",
        "I really can’t eat another thing. Thanks.",
        "I’m afraid I don’t eat fish.",
        "Not just at the moment. Thank you.",
        "No, please don’t bother.",
        "No, I’m not very fond of it. Thanks all the same.",
        "The cutlets are delicious. But I’m afraid I couldn’t. Thank you.",
        "I’ve had enough. Thank you.",
        "No, thank you. I’m just leaving.",
        "I’m afraid I don’t drink coffee.",
        "I’d love to, but I’m afraid I can’t.",
        "I’ve had plenty. Thanks.",
        "It looks delicious, but I’m afraid I couldn’t.",
        "No, thank you. I can’t manage any more. 1"
    ],
    "103. Opening a conversation with a stranger ": [
        "(See also Sl. no.83 Introducing a conversational topic).",
        "You played very well. Do you play often?",
        "Say, you spoke very well. I agree with you — more and more people must be encouraged to become self-employed.",
        "(At a bus-stop): Are you waiting for the 107? It’s a bit late today, isn’t it?",
        "I like your shoes. Where did you buy them?",
        "Very cold, isn’t it?",
        "She sings very well, don’t you think so?",
        "These queues are awful, aren’t they?",
        "Nice party, isn’t it?",
        "We haven’t met, have we? I’m Tilak — Tilak Iyer.",
        "Over here on business, are you?",
        "That’s a Perry Mason novel, isn’t it? How do you like it?",
        "There seems to be some delay. They haven’t announced the flight, have they?",
        "Very cold in here, isn’t it?",
        "What miserable weather!",
        "Very cold again.",
        "Forgive me for asking, but where did you get that dress?",
        "The traffic seems to get worse every day, doesn’t it?",
        "You’re Nisha’s cousin, aren’t you?",
        "Terrible rain again.",
        "The music is pretty good, isn’t it?",
        "Lovely day, isn’t it? You’re related to Ashok, aren’t you?",
        "Is this seat taken?",
        "The views from here are lovely, aren’t they? Especially, the view of those mountains.",
        "Are you going far?",
        "How far are you going? 1"
    ],
    "104. Giving an opinion ": [
        "He’s angry with her, I think.",
        "He’s quite popular among them, I feel.",
        "It didn’t work, did it?",
        "I always think cricket is much more exciting than football.",
        "As I see it, he has no alternative but to resign.",
        "I think you’re making a mistake.",
        "I’m sorry, but I do believe this is an unfair decision.",
        "He’s a good sort.",
        "Wonderful film, wasn’t it?",
        "I believe he was worried about something.",
        "I don’t think so.",
        "He thinks he can dictate to everybody.",
        "If I were the judge, I’d hang them.",
        "I thought it was very boring.",
        "Surely, it can’t be that bad?",
        "Well, if you ask me, he’s a lousy player.",
        "Well, I don’t know about you, but I think it’s an excellent plan.",
        "In my opinion, they treated him badly.",
        "Personally, I think it’s no good talking to him.",
        "He played very badly, didn’t he?",
        "Well, I don’t want to be difficult, but I do feel we shouldn’t have done it.",
        "She was a bit careless, wasn’t she?",
        "I find he’s quite competent in his work, whatever they say.",
        "I think so.",
        "In my opinion, the scheme is unsound.",
        "It seems to me, he wanted to say something to her.",
        "I do think that we should have said ‘no’ to them.",
        "If he pays you back, you may consider yourself lucky.",
        "It tastes funny, doesn’t it?",
        "It’s silly to buy something you don’t like.",
        "I feel we have no right to do it.",
        "I don’t think you need worry.",
        "As far as I can see, this is a gang war.",
        "I don’t feel he has understood it.",
        "Well, I may be wrong, but I feel you shouldn’t have said that. 1"
    ],
    "105. Not giving an opinion ": [
        "I don’t know enough to form an opinion about these things.",
        "I don’t really know.",
        "I have no strong opinion on matters like these.",
        "I’m afraid I’ve no idea. I’ve never been interested in politics, you know.",
        "I don’t feel strongly either way, actually.",
        "I’m not much good at these things.",
        "Oh, who cares!",
        "I don’t know much about sports, you know.",
        "I’m not aware of all the facts, you know.",
        "I don’t know enough about it, I’m afraid.",
        "I’m afraid I don’t know. That’s really outside my domain.",
        "No comment.",
        "Politics has never been of great interest to me, you know.",
        "I can see both points of view. 1"
    ],
    "106. Asking someone’s opinion ": [
        "Do you like her?",
        "Do you think it’s going to rain?",
        "What do you think about her dress?",
        "Does it look very bad?",
        "Do you feel that I should have accepted it?",
        "How do you like this, then?",
        "Was the lecture interesting?",
        "Do you have any views on the suggestion they’ve made?",
        "Don’t you think that this colour suits me?",
        "How will it look if you mend it?",
        "How about this, then?",
        "Could I ask what your opinion is?",
        "How do you feel about the way she behaved?",
        "What did you think of the book?",
        "What do you think of this?",
        "What’s your opinion of your new boss?",
        "Is this all right?",
        "Do you think he was right?",
        "Do you think I ought to ring him up?",
        "Wouldn’t you say that he had a strange look on his face?",
        "Do you think this is all right?",
        "How do you think I’d look in that dress?",
        "Do you have any views about this proposal?",
        "What’s your opinion about the stand he has taken? 1"
    ],
    "107. Agreeing with an opinion ": [
        "Uh huh.",
        "Sure.",
        "Yes.",
        "I know.",
        "Yes, I’m afraid it was.",
        "I agree with you.",
        "That’s right.",
        "Yes, I agree.",
        "Yeah, sure.",
        "Yes, I suppose so.",
        "Absolutely.",
        "I agree with that.",
        "Of course.",
        "How true.",
        "Right.",
        "Yes, I’m in favour of it, too.",
        "Yes, I’m against it, too.",
        "Yes, you have a point there.",
        "Yes, it was superb.",
        "I think so, too.",
        "Of course not.",
        "You’re right.",
        "I believe so.",
        "I quite agree.",
        "It’d seem so.",
        "You’re quite right there.",
        "Quite right.",
        "True enough.",
        "Exactly.",
        "Definitely.",
        "Certainly.",
        "I can’t help thinking the same.",
        "Yes, it is.",
        "I fully agree with you there.",
        "I couldn’t agree more.",
        "Yes, you’re absolutely right. 1"
    ],
    "108. Disagreeing with an opinion ": [
        "I don’t think so.",
        "No, it isn’t.",
        "I’m afraid I don’t agree.",
        "No, that’s not correct.",
        "Nonsense! I don’t think it’s true.",
        "What nonsense!",
        "I can’t really agree with you there.",
        "Oh, surely not!",
        "But it can’t be.",
        "Oh, come on! You can’t be serious.",
        "No, no, no. I don’t agree.",
        "I’m sorry. I just can’t agree with you.",
        "That’s not true.",
        "You can’t mean that.",
        "Oh no, I don’t agree with you.",
        "Oh, come off it! You’ve got it all wrong!",
        "It certainly isn’t.",
        "I think you may be wrong there, you know.",
        "I’m afraid I can’t agree with that.",
        "Rubbish!",
        "I’m not sure that I agree.",
        "I’m not so sure about that.",
        "No, I can’t accept that.",
        "I’m not sure I’d go along with you there.",
        "Oh no, not again!",
        "I don’t think I can agree with you on that.",
        "Why not?",
        "I did not.",
        "You’re joking, aren’t you? 1"
    ],
    "109. Giving permission ": [
        "Yes, you can.",
        "By all means.",
        "You can have as many as you want.",
        "Yes, certainly.",
        "OK.",
        "You can, if you want.",
        "I suppose so. But just this once.",
        "Sure, go ahead.",
        "No, I don’t mind.",
        "Not at all. (I don’t mind it all).",
        "Yes, if you want.",
        "You may, if you like.",
        "Yes, all right.",
        "Go right ahead.",
        "Well, go ahead, if you must.",
        "Yes, if you must.",
        "I can see no objection.",
        "Yes, of course.",
        "Yes, that’s fine.",
        "You have my permission. 1"
    ],
    "10. Asking someone’s permission ": [
        "Can I come in?",
        "May I have a word with you, sir?",
        "If you don’t mind, I’d like to have a smoke.",
        "I’d like to stay behind for some time, if you have no objection.",
        "Would you mind if I smoked?",
        "Could I see you for a moment?",
        "It’s very hot in here. Can I open the window?",
        "Do you mind if I use your phone?",
        "Could I possibly take the car?",
        "Would you let me take it home for a day?",
        "Can I go too?",
        "Would you object if I took my dog inside?",
        "You don’t mind if I’m a bit late tomorrow, do you?",
        "Would it be all right if I brought him in now?",
        "Can I go with you?",
        "Have you any objection to my leaving it here?",
        "I don’t suppose anybody’d mind if I opened the window?",
        "Is it all right to stay up till midnight?",
        "I wonder if I could borrow this book for a few days?",
        "I may be a little late tomorrow — I suppose you don’t mind that.",
        "Is it all right if I join the train at Pune? 1"
    ],
    "11. Refusing permission ": [
        "(See Sl. no.135 Expressing prohibition).",
        "I’m sorry.",
        "Sorry, you can’t.",
        "I’m sorry you can’t do it.",
        "You’re not allowed to do it.",
        "I’m afraid it’s out of the question.",
        "No, you mustn’t do it.",
        "Smoking is not allowed, I’m afraid.",
        "Look, the answer is ‘No’. It’s out of the question, I’m afraid.",
        "No, don’t go there today.",
        "It’s OK with me, but you must ask Arjun.",
        "You’re not supposed to do it.",
        "I’m sorry I can’t let you do it.",
        "No, I won’t let you do it.",
        "I can’t allow you to do it.",
        "There’s no way I’m going to let you do it.",
        "No, you mustn’t open it now.",
        "You’d better ask her.",
        "You must be joking! 1"
    ],
    "12. Asking whether others have permission to do sth ": [
        "Can you use the office telephone to make private calls?",
        "Did anyone give you permission to use the office car?",
        "Has he said you may do it?",
        "Do they let you enter that area?",
        "Are you allowed to meet visitors during office hours?",
        "Has anyone said you can go in?",
        "Are you supposed to take these books out?",
        "Do you have permission to leave?",
        "Is it possible for you to do it whenever you like? 1"
    ],
    "13. Trying to persuade sb ": [
        "(See also Sl. no. 47 Trying to convince sb of sth).",
        "You really should invite him, you know.",
        "Do you realize that they can be of great help to us?",
        "Are you sure you ought to send that complaint?",
        "That’s quite a good idea, you know.",
        "It may seem difficult, but I really think you should try.",
        "I could do with your support, you know.",
        "He’s an excellent worker, actually.",
        "Have you thought of finding out what he really thinks about it?",
        "Don’t forget that he’s your boss.",
        "But is it worth the risk?",
        "Oh, come on, won’t you let it pass this time?",
        "What about your partners?",
        "They might have made some other arrangements.",
        "Don’t you think you should do something for them?",
        "I can assure you of my full support.",
        "Don’t be silly Amit, it’s not that expensive.",
        "What about the money you’ve already invested, then?",
        "Yes, of course.",
        "It can be very helpful to us, you know.",
        "Can’t I persuade you to change your mind?",
        "That’s really no problem.",
        "I still think you should write to them.",
        "You don’t seem to realize how important this is to you.",
        "Has it occurred to you to meet him in person and ask him about it?",
        "Supposing the price goes up after the Budget?",
        "If you can put in a good word for me, I’d be grateful.",
        "You wouldn’t like that to happen, would you?",
        "Oh, come on, won’t you think about it again?",
        "But supposing they come without warning, you won’t have time to finish this work.",
        "I’d grab this chance, if I were you.",
        "I don’t see why we shouldn’t do it.",
        "Oh surely, you don’t have to tell him?",
        "It’s just that I don’t see why we shouldn’t do it.",
        "Has it never occurred to you that this might cause you a lot of trouble?",
        "There’s no doubt about that.",
        "We could do with your help, you know.",
        "I don’t think that’s very likely.",
        "I was wondering if you’d thought of the consequences.",
        "Now be reasonable, Madhu.",
        "Can’t I persuade you to reverse your decision?",
        "Do you think you could sort out these problems?",
        "Do you realize we can’t have everything we want?",
        "If you don’t act now, anything could happen. 1"
    ],
    "14. Mentioning your plans ": [
        "(See Sl. no.80 Expressing intention). 1"
    ],
    "15. Asking about plans ": [
        "Have you got anything on for tonight?",
        "Are you busy tonight?",
        "What are you going to do today evening?",
        "Are you doing anything tomorrow evening?",
        "Have you made any plans for the school holidays?",
        "Are you planning to do anything this Saturday?",
        "What are your plans for the weekend?",
        "Have you got anything fixed up for today evening?",
        "What are you doing tomorrow evening?",
        "Have you got any plans for the weekend?",
        "Have you got anything planned for this Sunday?",
        "Do you fancy doing something tonight?",
        "Are you free this evening?",
        "What do you plan to do once you get there?",
        "Are you planning a career in medicine?",
        "Are you going to Lakshmi’s party? 1"
    ],
    "16. Answering questions about plans ": [
        "(See also Sl. no.80 Expressing intention).",
        "I’m going to the cinema with my cousin.",
        "I haven’t got anything on this weekend.",
        "I’ve got no plans.",
        "I’m thinking of visiting a friend.",
        "I’m leaving it to chance.",
        "I was planning to take a month’s annual leave, but everything has fallen through.",
        "I don’t have any plans.",
        "I’m planning to arrive by the G.T. Express.",
        "I can’t manage Friday. I have meetings all day. How about Thursday?",
        "I haven’t got any plans.",
        "I’m planning on having a holiday in December.",
        "I’m leaving it open.",
        "You go, and I’ll follow on. 1"
    ],
    "17. Expressing pleasure ": [
        "(See also Sl. no.128 Expressing preference).",
        "I’m very glad to hear that, really.",
        "Oh, that’s good news!",
        "That’s very nice.",
        "I’m very pleased for you.",
        "It was such an interesting film!",
        "How nice of you to come!",
        "Mmm!",
        "I like music.",
        "I like listening to music.",
        "I love cricket.",
        "I couldn’t have been more pleased!",
        "I like football very much.",
        "Oh, I’m pleased!",
        "I’m really excited about getting this job.",
        "Oh, what an interesting play it was!",
        "We had pleasant weather in November.",
        "I’m fond of cooking.",
        "How wonderful!",
        "I’ve very much enjoyed this trip.",
        "It’s the most enjoyable film I’ve ever seen.",
        "I like playing badminton.",
        "That’s very nice to know.",
        "That’s good to hear.",
        "I do enjoy listening to Rafi.",
        "Oh, it really is most interesting!",
        "Congratulations!",
        "It was such an enjoyable party!",
        "How lovely!",
        "I just can’t wait to tell her the good news.",
        "This cake’s delicious!",
        "I like playing cricket.",
        "I’m quite keen on sport.",
        "What enthusiasm they showed!",
        "That was a very good film.",
        "I like watching football matches a lot!",
        "I’m very happy for you.",
        "I really enjoyed my stay there.",
        "That’s very nice to hear.",
        "It’s really the most relaxing holiday I’ve ever had.",
        "Oh, that’s good!",
        "I’m glad to hear it.",
        "I quite like fish.",
        "I like my shirt a little loose.",
        "I like Ajith very much.",
        "I like reading.",
        "It was such a pleasant journey.",
        "Great!",
        "I’m really looking forward to meeting them.",
        "Fine!",
        "What wonderful news!",
        "I enjoy my job.",
        "This flower has a very pleasant smell.",
        "Wonderful!",
        "I’m glad you’re doing so well, Seth.",
        "Fantastic!",
        "I’m really looking forward to the weekend.",
        "Excellent!",
        "What an interesting sight!",
        "I’m delighted to hear this.",
        "Well done! 1"
    ],
    "18. Expressing displeasure ": [
        "I didn’t like it.",
        "I hate it.",
        "I don’t like him at all.",
        "It was absolutely lousy.",
        "I don’t like chicken very much.",
        "Rotten!",
        "I don’t like waiting for him like this.",
        "It was shocking, really.",
        "I hate doing it.",
        "I dislike washing-up.",
        "I don’t drink alcohol.",
        "I thought it was very poor.",
        "I don’t like watching television.",
        "No good at all.",
        "I don’t like the style.",
        "I hate to do it.",
        "I can’t stand cricket, but she likes it.",
        "It was absolutely terrible.",
        "I can’t bear sentimental films like this.",
        "A waste of time, I must say.",
        "Ugh! (pronounced in the same way as the vowel sound between ‘h’ and ‘d’ in “heard” and that between ‘l’ and ‘n’ in “learn”).",
        "I dislike the very idea of it!",
        "It was disgraceful.",
        "I don’t like silk.",
        "I’m not keen on swimming.",
        "I didn’t think much of it.",
        "I don’t enjoy going to the cinema.",
        "It was awful.",
        "I love shopping for clothes.",
        "I don’t like being photographed.",
        "I didn’t enjoy it.",
        "I don’t like asking for help.",
        "I don’t like high heels.",
        "It was no good, really.",
        "I hate to mix business with pleasure.",
        "I’m not fond of football.",
        "Very poor.",
        "I didn’t like what she said.",
        "It was absolutely dreadful, actually.",
        "I dislike working late.",
        "I can’t stand this loud noise — it gives me a headache. 1"
    ],
    "19. Asking about pleasure, displeasure, likes and dislikes ": [
        "Is there anything he particularly likes?",
        "Do you like it?",
        "Would you like to go for a film?",
        "How do you like it here?",
        "Don’t you enjoy flying?",
        "Do you think they’d like it if I do it?",
        "Do you like the idea of spending all the time on the beach?",
        "Is there anything she particularly dislikes?",
        "I like the idea of it.",
        "Don’t you like her brother?",
        "What fruit do you like best?",
        "What do you think he’d like doing?",
        "Did you enjoy yourself at the party?",
        "What about porridge? Does he like it?",
        "Do you like playing tennis?",
        "Is there anything he especially likes doing?",
        "Would you like an apple?",
        "What drinks do you like?",
        "Do you think he’d mind if I do it?",
        "Would you like to have lunch now?",
        "How do you like this shirt?",
        "What’s your favourite hobby?",
        "What do you think he’d enjoy doing?",
        "Don’t you like to see it again?",
        "What kind of music do you like?",
        "Is there anything he especially hates doing?",
        "Do you like to sit in the middle?",
        "Does he like swimming? 1"
    ],
    "20. Pointing things out ": [
        "(See also Sl. no.27 Attracting attention).",
        "Have you seen this?",
        "Look between those two tall buildings.",
        "Look at that.",
        "Here’s the book you were looking for.",
        "May I show you something?",
        "There it is!",
        "Look at that blue dress on display in the window.",
        "Have you seen that?",
        "What about this, then?",
        "Here comes the bus.",
        "Look at this.",
        "Let me show you our album.",
        "Look right where I am pointing.",
        "Look at this picture.",
        "What about that?",
        "Look, here it is.",
        "Is this the book she asked for? 1"
    ],
    "21. Expressing possibility ": [
        "(See also Sl. no.131 Expressing probability).",
        "We may have made a mistake.",
        "It’s possible.",
        "He could be right.",
        "I may possibly be able to help them.",
        "It’s possible he came after I left.",
        "It might be possible.",
        "She could be telling lies.",
        "He can do it.",
        "In those days, all these things could be done easily.",
        "There’s no reason why you shouldn’t be able to do it.",
        "It may be that he doesn’t want her to know about it.",
        "With any luck, you’ll be able to get it.",
        "Possibly, I may be able to persuade them to do it.",
        "This can be improved.",
        "They should be home by now.",
        "It’s possible that she’ll be here tomorrow.",
        "Maybe he likes it, maybe he doesn’t.",
        "You should be able to do it.",
        "There’s a fair chance of such a thing happening.",
        "I may be able to get in touch with him today.",
        "Perhaps she’ll come, perhaps she won’t.",
        "I might have said so, but I don’t remember it.",
        "It’s just possible that they might do it. 1"
    ],
    "22. Expressing impossibility ": [
        "It’s impossible.",
        "You can’t be sure.",
        "Impossible!",
        "No chance.",
        "It’s not possible that such a thing could’ve happened.",
        "It’s simply not possible.",
        "That’s not possible.",
        "It can’t be done, I’m afraid.",
        "There’s no way we can persuade him to change his mind.",
        "Not a chance. He can’t be working at this time.",
        "I just don’t think it’s true.",
        "I doubt if it can be managed.",
        "You don’t stand a chance.",
        "It’s impossible that he’ll go out of his way to help anyone.",
        "I don’t think it can be done. 1"
    ],
    "23. Asking about possibility or impossibility ": [
        "Is it possible?",
        "We’ll be able to get there in time, won’t we?",
        "Can he be there now?",
        "Do you think we could persuade him to come?",
        "Is it possible that he’s working?",
        "Can you come a bit early tomorrow?",
        "Is there any chance of their team winning?",
        "Will you be able to buy it on your way back?",
        "Could you have left it at the bank?",
        "Any chance?",
        "Is it possible to locate the street on this map?",
        "Do you think he’d mind if I came a bit late tomorrow? 1"
    ],
    "24. Praising sb ": [
        "(See Sl. no. 5 Expressing admiration, Sl. no.21 Expressing appreciation, Sl. no.22 Expressing approval, Sl. no.41 Complimenting sb). 1"
    ],
    "25. Predicting sth ": [
        "You’ll meet with some difficulties, but you’ll be able to overcome them easily.",
        "He’s sure to win a fine victory in the election.",
        "You can expect some visitors.",
        "I think it’ll rain today.",
        "Your father will have arrived by now.",
        "Salim is going to be the next captain.",
        "I’d put my money on her. She’s sure to win this game.",
        "She’s going to get married in a few month’s time.",
        "I’m sure he’s going to get this job.",
        "I bet he will become a doctor.",
        "If you call him, he’ll come.",
        "He’s certain to agree.",
        "He stands a good chance of getting selected.",
        "She might find him there.",
        "She’ll make a good teacher.",
        "They’ll be able to get out of these difficulties soon, I expect.",
        "It’s going to be a rainy day tomorrow, I think.",
        "If you don’t get it in a week’s time, I’ll eat my hat.",
        "It’s got to be Ahuja.",
        "Things are going to turn out well for you, I think.",
        "She must have reached there by now.",
        "These people will make things hard for you.",
        "He’s going to get into politics.",
        "I don’t think it’ll happen. 1"
    ],
    "26. Not predicting anything ": [
        "I have no idea.",
        "I wish I knew!",
        "Heaven only knows.",
        "It’s anybody’s guess.",
        "I don’t know who’ll win this time.",
        "Nothing is certain at the moment.",
        "God only knows!",
        "I don’t know what’ll happen.",
        "Anything could happen.",
        "I don’t know much about all this.",
        "Heaven knows!",
        "God knows!",
        "I don’t know.",
        "Anybody could be our next president. 1"
    ],
    "27. Asking for predictions ": [
        "Do you think Anil or Suresh is going to get selected?",
        "Will he pass the exam this time?",
        "What do you think is going to happen?",
        "Will she marry him?",
        "When do you think is this going to happen?",
        "What’ll happen to their business if their Chairman dies?",
        "Who do you think will get the contract?",
        "Can such a thing happen?",
        "Is it possible?",
        "Who would you put your money on to finish this work first?",
        "What would happen if her parents found out?",
        "Who’s most likely to win this time? 1"
    ],
    "28. Expressing preference ": [
        "(See also Sl. no.117 Expressing pleasure and Sl. no.118 Expressing displeasure).",
        "I prefer lemon juice, I think.",
        "I prefer my sleeves long.",
        "I prefer to go out for a walk rather than to stay in.",
        "I prefer swimming to cycling.",
        "I have a preference for classical music.",
        "Perhaps, it’d be better if I spoke to him myself.",
        "I like a quiet place.",
        "I think I’d prefer something a bit cheaper.",
        "I prefer that one to this, actually.",
        "If you don’t mind, I’d like to have a smaller one.",
        "I really prefer cotton if you have something I might like.",
        "I prefer reading, actually.",
        "I’d much rather have it removed from there.",
        "I’d prefer to have coffee.",
        "Perhaps you have something like this in a lighter colour?",
        "On the whole, I’d prefer to go to Ooty this year.",
        "I like dogs more than cats.",
        "The best thing to do would be to reject it.",
        "They like it better there.",
        "I think I’d like to have a red one.",
        "Winter is my favourite season.",
        "The best thing would be to say nothing about it.",
        "I’d rather go for a film than sit here and watch the TV.",
        "If it’s all the same to you, I’ll have my coffee black.",
        "I’ve always wanted to go to America.",
        "I’d rather not go by bus.",
        "I like my coffee without sugar.",
        "I’d prefer to go on a holiday.",
        "I like black coffee best, I must say.",
        "Something cold, please.",
        "I like fish better than meat.",
        "Drink? No, thanks. I’d rather not.",
        "The best thing for us to do would be to tell him everything.",
        "I’d rather like to remain in the house and read something.",
        "I’d rather have you come here. 1"
    ],
    "29. Asking about preference ": [
        "Which do you prefer? This one or that one?",
        "Would you prefer something a bit bigger?",
        "What do you prefer to read? Mysteries or other types of novels?",
        "Would you rather have another colour?",
        "Do you have any particular style or colour in mind?",
        "Which of these books do you like best?",
        "Would you rather have it here or in the dining hall?",
        "Would you rather play tennis than go for a walk.",
        "Which do you like best — the Honda or the Toyota?",
        "Do you want to stay here or go?",
        "How do you want your hair cut?",
        "Would you prefer coffee or tea?",
        "Would you like something in cotton, then?",
        "Perhaps you’ll rather have a lighter shade of red?",
        "Would Monday morning or Monday afternoon be more convenient?",
        "Do you have any preference for yellow?",
        "Which of these would you rather have?",
        "We can either take a bus or walk, whichever you like.",
        "What kind of style would you prefer? 1"
    ],
    "30. Having no preference ": [
        "(See also Sl. no.76 Expressing indifference).",
        "I don’t mind how we go — we can go by bus or by train.",
        "We’ll sit anywhere you like.",
        "Either one will be all right.",
        "It really doesn’t matter to me.",
        "I’m not particular.",
        "You choose.",
        "You decide.",
        "It’s all the same to me.",
        "Give me any of them.",
        "I don’t mind — I’ll have either.",
        "Whatever you like.",
        "Either of them will do.",
        "I’m easy.",
        "Give me a book — any book will do.",
        "Whichever you like.",
        "Either will do — I have no preference.",
        "I don’t care where we go.",
        "It’s up to you. 1"
    ],
    "31. Expressing probability ": [
        "(See also Sl. no.121 Expressing possibility). Note: If something can happen or can be done, it’s “possible”, but if you expect it to happen or to be true, it’s “probable” (=likely).",
        "It’s 6 o’clock. He should be in Bombay by now.",
        "He’s not likely to agree.",
        "He should be alone there.",
        "They should have arrived by now.",
        "She sang very well. She ought to win first prize.",
        "She must be tired after the journey.",
        "He ought to pass the exam this time.",
        "He must be finding it very difficult to learn that poem by heart.",
        "I don’t think it’s likely to rain.",
        "You will slip if you aren’t careful. They’ve washed that floor.",
        "It should be much warmer next month.",
        "She ought to be there by now.",
        "It looks like rain.",
        "He’ll come next week — probably on Friday.",
        "Oh, yes. By then, you should have saved enough money.",
        "It’s quite probable that they haven’t taken a decision yet. 1"
    ],
    "32. Expressing improbability ": [
        "There shouldn’t be any difficulties.",
        "There shouldn’t be any trouble finding this place.",
        "It shouldn’t be hot in March.",
        "There oughtn’t to be any problem finding a buyer.",
        "It’s improbable that there should be any trouble.",
        "He might pass the test, but it’s very unlikely.",
        "The flight shouldn’t have arrived by now.",
        "It’s possible that they might agree, but it doesn’t seem very probable. 1"
    ],
    "33. Asking about progress ": [
        "How is that work progressing?",
        "Are you making good progress with that work?",
        "How’s the new job going?",
        "Any progress?",
        "How are you getting on with this work?",
        "How’s your son doing at school?",
        "How far has that work progressed?",
        "Is she making good progress with her studies?",
        "How’s your work getting on?",
        "Is that work progressing very well?",
        "I’m dying to see how the work is getting along.",
        "How’s he progressing in his studies?",
        "How far have you got with the work?",
        "Is she making good progress with her mathematics?",
        "Haven’t you finished yet? You’ve taken ages.",
        "How has she been doing?",
        "How are you feeling today?",
        "Doctor, how is that patient progressing?",
        "Is your work going well?",
        "How’s he getting on at school?",
        "Has your headache gone yet?",
        "I couldn’t go to the hospital. Is she making good progress?",
        "How are you getting on with your new job?",
        "Is there any progress in the reconciliation talks? 1"
    ],
    "34. Reporting progress ": [
        "My work is going well.",
        "It’s going well.",
        "It’s finished.",
        "It’s almost finished.",
        "We’ve only started now.",
        "The report is only half finished.",
        "It won’t take long to finish the job.",
        "We’re making steady progress.",
        "The work is going quite smoothly.",
        "A lot of things still remain to be done.",
        "I haven’t completed it, but I’m working on it.",
        "I’m just adding the finishing touches.",
        "There’s still a lot of typing to be done.",
        "I’ve reached the end of the book.",
        "The hardest part of the work is over.",
        "Our business has come a long way since we set it up.",
        "We’ve done a lot in a short time.",
        "We’re beginning to make a profit.",
        "So far, we haven’t been able to do much.",
        "We have to go a long way with this yet.",
        "I’ve only to add a few of the details.",
        "Only a few more pages remain.",
        "Up to now, things have been easy.",
        "We’ve hit some problems.",
        "The talks have made very little progress.",
        "They haven’t agreed yet, but I’m working on them.",
        "At this stage, it’s too early to say when we can finish it.",
        "No problems. Things are going very well.",
        "Up till now, they haven’t been able to solve the problem.",
        "I haven’t reached the end of the book yet.",
        "I’ve got halfway through the work.",
        "Things were going really well until we hit this problem.",
        "He isn’t ready for the test — he hasn’t had enough lessons, you know.",
        "I feel a bit better today.",
        "I’m feeling so much better today.",
        "She’s completely better.",
        "The doctors say he’s quite better.",
        "She’s getting worse. I asked the doctor.",
        "Her eyesight is worse.",
        "He got worse in the night. 1"
    ],
    "35. Expressing prohibition ": [
        "(See also Sl. no.111 Refusing permission).",
        "Sorry. You can’t smoke here.",
        "You can’t play here.",
        "I’m afraid you can’t go in there.",
        "You can’t bring food and drink here.",
        "You mustn’t take photographs in here.",
        "You mustn’t tell anyone.",
        "You aren’t allowed to walk on the grass.",
        "Children aren’t allowed in the pool without an adult.",
        "Hey, you’re not supposed to park here!",
        "Don’t park in front of the entrance.",
        "Don’t spit.",
        "I’m sorry, but you’ll have to put out your cigarette.",
        "Dogs are not permitted in this building. 1"
    ],
    "36. Making promises ": [
        "I will do it.",
        "I promise I’ll do it.",
        "I’ll buy you a necklace for our wedding anniversary.",
        "I won’t repeat it, I promise.",
        "I guarantee you’ll like it.",
        "I give you my word.",
        "I don’t know where he has gone, honestly.",
        "I’ll let you know in the evening.",
        "I’ll never be late again, I promise.",
        "I’ll drop in again when I have more time.",
        "If I can’t come tomorrow, I’ll let you know.",
        "I’ll give you a buzz when we’ve finished.",
        "I give you my word I’ll do it.",
        "I promise you I’ll be punctual from now on.",
        "I’ll have him get in touch with you as soon as he comes back.",
        "You can leave it to me.",
        "You can count on me.",
        "I undertake to do it, honestly.",
        "I won’t be late again, I promise I won’t.",
        "I promise you.",
        "I will, I promise. 1"
    ],
    "37. Reassuring sb ": [
        "Don’t worry. We’ll soon sort it out.",
        "Stop worrying. You’ll be all right.",
        "You have no need to worry.",
        "There’s no need to worry about anything.",
        "This medicine will make you feel better.",
        "It was nobody’s fault.",
        "Don’t look so worried — everything will be all right.",
        "I’m sure it wasn’t your fault.",
        "Nothing like that ever happens.",
        "This medicine should help your stomach.",
        "Don’t worry about anything — everything’ll be OK.",
        "It’s probably just a cold. A lot of people have colds at the moment.",
        "There was nothing you could’ve done.",
        "Look, there’s nothing to get nervous about.",
        "You’ve done very well.",
        "I’m very optimistic about our chances.",
        "It’s the right size.",
        "You couldn’t help it, I know.",
        "Thousands of people do this everyday and nothing happens to them.",
        "There’s no need to worry about him.",
        "Don’t worry. Everything turned out fine.",
        "There, there, don’t cry.",
        "You couldn’t have done anything about it.",
        "You mustn’t upset yourself.",
        "I don’t think there’ll be any problem in that.",
        "This tablet will relieve your pain.",
        "It won’t take more than a minute.",
        "Never mind, Ashish, never mind.",
        "I’m fine. Don’t worry about me.",
        "Just don’t worry, it’ll be all right.",
        "You should be able to do it without any trouble.",
        "Everything’ll be OK when you take this medicine.",
        "Nothing serious is going to happen to you.",
        "You’ve come out very well in the photo. Let me reassure you about it.",
        "He’ll come. I’m very hopeful about it.",
        "You look very nice in that dress.",
        "Relax! Everything’ll be all right.",
        "Forget it. Anyone can make a mistake.",
        "There’ll be no problem about it.",
        "You couldn’t have known.",
        "I’m sure it’s not your fault.",
        "It doesn’t matter, really it doesn’t. Everybody makes mistakes sometimes.",
        "After all, you were very busy, and they know it.",
        "Take this tablet, and the pain will wear off.",
        "Don’t worry — he’s a careful driver. 1"
    ],
    "38. Rebuking sb ": [
        "(See also Sl. no.15 Expressing anger).",
        "You always worry too much!",
        "You always forget something.",
        "I’ll not tolerate this sort of behaviour.",
        "I won’t listen to such nonsense.",
        "Oh, Rita! Stop being stupid.",
        "This is ridiculous!",
        "Don’t shout. You’ll wake the whole house up.",
        "You stand there and tell me you forgot it. It won’t do, you know.",
        "Oh, don’t be silly!",
        "I don’t think that’s at all funny.",
        "That was your responsibility.",
        "You made absolutely no effort to help me.",
        "You don’t seem to realize how important this is to me.",
        "Stop making that terrible noise.",
        "Have you gone off your head?",
        "You were fool enough to believe it.",
        "I’m sick to death of your grumbling.",
        "That was a bit careless, wasn’t it?",
        "Why ever didn’t you tell me?",
        "You needn’t have told him all these things.",
        "You could at least say you were sorry.",
        "Why on earth didn’t you say so?",
        "Be more careful in future before you do anything like this.",
        "I don’t seem to be getting through to you.",
        "I won’t have you speak to your mother like that.",
        "Keep the noise down. You’ll disturb the neighbours.",
        "Oh, don’t be so coarse!",
        "Stop telling me what to do, and mind your own business.",
        "If that’s your idea of a joke, I don’t think you’re funny.",
        "You really don’t understand what I’m getting at, do you?",
        "You’re talking nonsense.",
        "You’re wasting your time.",
        "You didn’t work hard and wasted your time at university.",
        "Were you out of your mind to do such a thing?",
        "Oh, you can be very annoying at times.",
        "It’s so typical of you.",
        "Stop mucking around and come and help me!",
        "But how could you be so careless!",
        "You’re such a bore!",
        "Oh, please! Come off it. You’re like a couple of little boys. Stop quarrelling.",
        "What you’re saying is nonsense.",
        "I felt so ashamed.",
        "Do be careful!",
        "What time do you call this?",
        "Stop joking, and give me a sensible answer. 1"
    ],
    "39. Recommending sb or sth to sb ": [
        "Try this soap. It’s new.",
        "Cotton is all the style now.",
        "Try this curry. It’s delicious.",
        "I suppose you had better lock the door.",
        "He’s a good plumber.",
        "This book is well worth reading.",
        "Why don’t you try a different approach?",
        "Hadn’t you better buy a bigger one?",
        "What you need is a couple of month’s rest.",
        "I’d recommend the Amazon Hotel.",
        "These are particularly good-looking shirts.",
        "You’d better carry some woollen clothes with you.",
        "You should try the restaurant near the Town Hall.",
        "I’d recommend Dr. Menon.",
        "You really ought to take up this work.",
        "I’d stay at the Akbar Plaza, if I were you.",
        "They’re supposed to be pretty good.",
        "Teakwood is very good for this sort of work.",
        "What you need is a long rest.",
        "I like chicken myself.",
        "The best place for holiday is Goa. No doubt about it.",
        "These are all pure cotton.",
        "Let’s try opening it.",
        "I really think you’d better not do it.",
        "This book is very good.",
        "Take him on — he’s a very good cook.",
        "These bags are made of some special kind of leather.",
        "I think I’d try this restaurant.",
        "That blue one looks better. This dress is only five hundred rupees.",
        "I usually have my car repaired at that garage.",
        "He’s a much better worker than all the others. No one can touch him. 1"
    ],
    "40. Asking for a recommendation ": [
        "Is this book any good, do you know?",
        "Who’s a good dentist near here?",
        "Can you recommend a good hotel there?",
        "Would you recommend someone for this work?",
        "What’s a good restaurant near here?",
        "Can you recommend a good electrician to me?",
        "Do you know anyone who is good at this kind of work?",
        "Do you know of a good plumber in this area? 1"
    ],
    "41. Expressing regret ": [
        "That’s a pity.",
        "I’m sorry I couldn’t come.",
        "If only I hadn’t failed the test!",
        "If only I had listened to them!",
        "I’m so sorry if I’ve hurt you.",
        "It’s quite unfortunate.",
        "Really, we should have invited them.",
        "It’s a pity you couldn’t come.",
        "Why did I ever say that?",
        "I think it was mean of us not to help them out.",
        "I regret missing the chance.",
        "Isn’t it a pity we missed that film!",
        "I feel I shouldn’t have been so rude to them.",
        "That’s a great pity.",
        "Oh, I’m sad to hear that.",
        "Nobody regrets this more than I do.",
        "I wish I hadn’t missed the bus.",
        "I’m so sorry that this has happened.",
        "Why didn’t I agree to do it?",
        "What a pity we couldn’t do it earlier.",
        "What a shame you have to leave so soon.",
        "Unfortunately, he wasn’t there then.",
        "We should have given them some more. I feel rather mean. 1"
    ],
    "42. Rejecting sth ": [
        "(See Sl. no.19 Rejecting an apology, Sl. no.68 Declining help, Sl. no. 86 Refusing an invitation, Sl. no.102 Declining an offer of food or drink, and Sl. no.150 Refusing a request. See also Sl. no.11 Expressing disagreement). 1"
    ],
    "43. Expressing reluctance ": [
        "(See Sl. no.12 Agreeing reluctantly and Sl. no. 101 Showing reluctance to accept an offer). 1"
    ],
    "44. Stating that you remember or don’t remember (have forgotten) sth or sb ": [
        "Yes, I remember him very well.",
        "I’ve forgotten to bring my pen.",
        "I’m sorry, the meeting completely slipped my mind.",
        "Ah! Now I remember.",
        "I can’t remember.",
        "I remember I had put it there.",
        "Oh dear! I completely forgot about it.",
        "Erm... yes, I’ve got it now.",
        "It’d completely slipped my mind.",
        "I don’t remember seeing you there.",
        "I remember locking the door.",
        "Yes, the whole episode is coming back to me now.",
        "I’m sorry I don’t remember.",
        "I don’t remember him.",
        "My mind has gone completely blank. I’ll always remember what you said the other day.",
        "When they spoke to me in Tamil for some time, my Tamil started to come back. 1"
    ],
    "45. Asking whether sb remembers or has forgotten sth or sb ": [
        "Do you remember telling him about it?",
        "Have you forgotten? Today’s her birthday.",
        "You remember Sandra, don’t you?",
        "Did you remember to meet him?",
        "You haven’t forgotten to post it, have you?",
        "You do remember Asha, don’t you?",
        "Do you remember his name?",
        "Surely, you haven’t forgotten him?",
        "You gave him the packet, didn’t you?",
        "Surely, you remember today’s the last day?",
        "I hope you didn’t forget to bring my book again. 1"
    ],
    "46. Reminding sb of sth ": [
        "Don’t forget to lock the door.",
        "Remember to count the change.",
        "You haven’t forgotten to invite Ratan, have you?",
        "Have you set the alarm clock? I want to get up at 5.",
        "I think you’ve forgotten your handkerchief.",
        "Let me remind you.",
        "Don’t forget what he told us yesterday.",
        "Don’t forget the book, will you?",
        "Have you remembered to send a copy to him?",
        "Is this your bag?",
        "Can I remind you of something?",
        "Be sure to switch off the lights.",
        "You won’t forget to post the letter, will you?",
        "You’ll telephone her tonight, won’t you?",
        "Let me remind you of something.",
        "Make sure you remove the books from there. 1"
    ],
    "47. Asking sb to repeat what they’ve said ": [
        "Pardon?",
        "How’s that?",
        "I beg your pardon. Could you repeat that, please?",
        "What did you say the measurements were?",
        "Sorry, I didn’t get that. Can you say it again, please?",
        "Excuse me, but what’s your name again?",
        "What did you say?",
        "I’m sorry, I didn’t hear that.",
        "What was that?",
        "I didn’t get it.",
        "I’m sorry. What did you say?",
        "I’m afraid I didn’t quite get that.",
        "Sorry. What was that?",
        "Could you say that again, please? — I didn’t quite understand.",
        "I didn’t quite catch what you said.",
        "I’m afraid I didn’t understand. Could you explain it again, please? 1"
    ],
    "48. Requesting others to help you or to do sth or to give you sth ": [
        "Can you turn the radio down? It’s a bit loud.",
        "Would you open the window, please?",
        "Could you tidy up my room, please?",
        "Can you possibly help me?",
        "Will you help me with my bags, please?",
        "Can I have a glass of hot water, do you think?",
        "Can you hold this a second?",
        "Do you think you could possibly do it for me?",
        "I’ve got a bit of a problem. Could you possibly do me a favour?",
        "Give me a hand, Kumar, will you?",
        "Excuse me, have you got a match?",
        "Could you hang out the washing?",
        "Please help me.",
        "Could I see the menu, please?",
        "Can you turn the sound up a bit, please?",
        "Do you have change for a 100- rupee note?",
        "If you’re going out, would you mind getting me a packet of milk?",
        "Could you pass the salt, please?",
        "Have you got a light, please?",
        "If you don’t mind, I would like you to do something for me. Can you ask Mridula to give me a ring tomorrow?",
        "Can you help me a minute, please?",
        "Can you iron these clothes?",
        "Are you going past the post office? Can you drop this letter in the mail box, please?",
        "The phone’s ringing. Can you get it?",
        "Could I borrow your pen?",
        "Could you dust the furniture?",
        "How about making me a cup of coffee?",
        "Could you possibly lend me some money?",
        "Can you give Faizal a message, please?",
        "Could you move forward a bit?",
        "Would you please ask him to come?",
        "Have you finished with the salt?",
        "I’d like to look at some shirts, please.",
        "Could you do me a favour?",
        "Could you possibly change this 100-rupee note for me, please?",
        "Do you think you could put in a word for me, please?",
        "Could you move your head a little? I can’t see.",
        "Could I have a glass of water, please?",
        "Are you going to the post office? Could you get me a few envelopes, please?",
        "I need some help.",
        "Sorry to bother you, but can I have a sheet of paper?",
        "I was wondering if you could lend me that book for a few days.",
        "Can you write that down for me, please?",
        "Can I ask you to do me a favour?",
        "Turn the radio down, will you?",
        "Turn the volume down, will you?",
        "Turn the volume up, will you?",
        "You couldn’t give me a lift into town, could you?",
        "I was wondering if you could lend me some money.",
        "You don’t mind waiting for a minute, do you?",
        "Could you drop me on the corner there, please?",
        "Look, I’ve got a problem. 1"
    ],
    "49. Agreeing to/Accepting a request ": [
        "Yes, with pleasure!",
        "No problem.",
        "All right.",
        "Yes, certainly.",
        "Yes, what can I do for you?",
        "I’ll see what I can do.",
        "Yes, OK.",
        "Yes, of course.",
        "OK then, sure.",
        "Yes, sure.",
        "By all means.",
        "Sure, what is it? 1"
    ],
    "50. Refusing a request ": [
        "It’s impossible, I’m afraid.",
        "Well, actually, it’s a bit difficult.",
        "I’m not sure that I can do that.",
        "I’m afraid I can’t help you.",
        "I’m afraid I haven’t much time today.",
        "That wouldn’t be very convenient just at the moment.",
        "I’m terribly sorry, but I prefer not to.",
        "I’m afraid I won’t be able to do it.",
        "Any other time, perhaps, but not now.",
        "I prefer not to get involved, if you don’t mind.",
        "I can’t see myself doing it, really.",
        "That’s out of the question.",
        "I’m awfully sorry, but I can’t actually.",
        "Look, I’m rather reluctant to do it, really.",
        "I’m not sure that I want to do that.",
        "Well, it’s a bit difficult, I’m sorry.",
        "I’d like to help you, but I can’t.",
        "I’m sorry, but I need it myself.",
        "I’d rather not do that, if you don’t mind.",
        "I absolutely refuse to do it. 1"
    ],
    "51. Expressing sarcasm ": [
        "A lot of sympathy you showed!",
        "(A wife): I can stay up all night washing dishes. That’s what a man’s got a wife for, isn’t it?",
        "Oh no, you didn’t take long to come back. Only two hours.",
        "I beg your pardon! You’re very considerate!",
        "You flatter me!",
        "It’s a wonder you have time to come home at all!",
        "Oh, that’s just marvellous!",
        "You know, I’m learning a lot from you.",
        "You’re sorry? I like that!",
        "You were going to do wonders — you were!",
        "A lot of help you turned out to be.",
        "Don’t worry. You’re only a few hours late.",
        "I should hope so. After what you’ve done!",
        "Quite a hero, aren’t you?",
        "You’re joking, aren’t you?",
        "No, no. They welcomed me with open arms.",
        "You’re only two hours late, and that isn’t very much.",
        "Fantastic indeed! Note: When you express sarcasm, what you say is the opposite of what you mean. In general, sarcastic expressions are expressions of approval said with a ‘sarcastic’ tone: A low tone, and rather flat intonation. You use sarcastic expressions to criticize others or to make them look silly. 1"
    ],
    "52. Expressing satisfaction ": [
        "(See also Sl. no.22 Expressing approval).",
        "This is just what I need.",
        "This seems to be all right.",
        "This is very good.",
        "I think it’s just right.",
        "It was okay, I suppose.",
        "This is just what I meant.",
        "This is exactly what I was looking for!",
        "It’s OK now. Well, isn’t that lovely!",
        "That looks perfect.",
        "This is just what I wanted.",
        "I am happy about the way he did it.",
        "Things seem to be going well.",
        "This is very nice.",
        "I’m very happy with his work.",
        "This seems to look all right.",
        "Aha, this is just what I had in mind!",
        "Ah!",
        "Ah, yes!",
        "No problems. It’s going beautifully.",
        "It couldn’t be better.",
        "That’s absolutely right. 1"
    ],
    "53. Expressing dissatisfaction ": [
        "This is not what I need.",
        "I’m not satisfied with what I have done for them.",
        "This dress is not quite right in style.",
        "I don’t like it.",
        "I had in mind something very simple.",
        "That won’t do. That’s no good.",
        "His work isn’t up to the mark.",
        "These shoes seem a little short for me.",
        "I don’t like it like this.",
        "This dress is a little tight in the waist.",
        "I can’t say I like it.",
        "The sleeves are just a little too long.",
        "That’s not what I wanted.",
        "I’m not sure it’s really suitable.",
        "For heaven’s sake! I can’t wear this!",
        "That’s awful!",
        "That’s a bit faded, isn’t it?",
        "I’m not satisfied with it.",
        "I wanted something slightly smaller, actually.",
        "What other styles do you have?",
        "That’s not right yet.",
        "It seems a bit large for me.",
        "There’s something not quite right about it.",
        "Just look at the sleeves. They’re too long.",
        "That’s a rotten film.",
        "Things aren’t going well. We’ve hit some problems.",
        "I don’t feel happy about it.",
        "Couldn’t we look at something else?",
        "This isn’t as big as I thought.",
        "It’s a lousy novel.",
        "I’d like to have the sleeves a half-inch shorter.",
        "None of these shoes are quite right in size.",
        "This is not what I had in mind.",
        "What other colours do you have?",
        "Isn’t it a little too tight for me?",
        "These shirts are not quite right in colour.",
        "I’m not happy about the salary they’ve offered. 1"
    ],
    "54. Speculating about things ": [
        "Can you imagine what’d happen if something should go wrong?",
        "Supposing he asked you to marry him, what’d you do then?",
        "She would be very happy if you went to see her.",
        "I suppose I’d be in the wrong if I did that.",
        "If I get this job, I’d buy a scooter.",
        "Surely it wasn’t her mistake, was it?",
        "What if we run out of petrol on the way?",
        "Maybe, I’d get another promotion by then.",
        "Could it be Kumar’s car?",
        "I wonder what it’d be like to live in a palace like that.",
        "Supposing the plan goes wrong, what’ll you do then?",
        "Think of him as your boss. Imagine working under him for some time.",
        "It could have been her mother.",
        "Imagine what it’d be like if they joined together to do it.",
        "I think it’d be better if you told him the news.",
        "What if the car breaks down on the way?",
        "What’d happen if he shaved his head?",
        "Couldn’t it have been someone else?",
        "What do you think it’d be like to live in poverty?",
        "He must have been seriously ill or something.",
        "I wonder what it’d be like if he became our boss.",
        "Suppose he refuses to see you. What’d you do?",
        "I bet it was his idea.",
        "What’d you do if it rained now?",
        "What if they come back?",
        "I might get hurt.",
        "He’ll be back soon, I expect.",
        "Just suppose he comes in all of a sudden and sees all this.",
        "It must have been something important.",
        "How would you feel if she spoke to you like that?",
        "Could it be a misunderstanding? 1"
    ],
    "55. Making a suggestion ": [
        "Shall we leave now?",
        "How about buying a new one?",
        "Why don’t you let out that house to someone?",
        "Couldn’t we ask someone?",
        "Let’s leave the washing up till tomorrow.",
        "You can look at them one by one, if you like.",
        "Let’s go by train.",
        "How about a cup of coffee?",
        "Let’s go on the same train as Priya.",
        "Why don’t we look in the yellow pages?",
        "You can always get an electrician to check it, if you prefer.",
        "Why not go in our car?",
        "Get a mechanic to come and fix it.",
        "What about going by car?",
        "What about having a quick lunch before we leave?",
        "I think it’d be sensible to leave early, in case there’s a lot of traffic.",
        "Don’t you think it might be a good idea if we can join them there.",
        "How about a nice cotton shirt to wear with these jeans?",
        "I guess you’d better go right now.",
        "I think it’d be a good idea to ask him to come with us.",
        "Let’s take a break for a while.",
        "Shall we go out for a meal this evening?",
        "Let’s not fix the date now.",
        "Don’t let’s go by the early morning bus.",
        "Why not go and have a lie down? You’ll feel better then.",
        "We might try explaining it to him.",
        "Have you tried drinking a little warm milk before going to bed?",
        "You might have a look at this book.",
        "How about a shirt to go with these trousers?",
        "What about another day, then?",
        "We could stop now, if you like.",
        "I think you should go right away.",
        "Let’s go and have a look.",
        "I suggest we take up the matter with his superiors.",
        "We could try and explain it to them, if you like. 1"
    ],
    "56. Agreeing with (or accepting) a suggestion ": [
        "That seems a splendid idea.",
        "Yes, of course.",
        "Yes, all right. OK.",
        "Yeah, great!",
        "OK, that sounds fine.",
        "Why not?",
        "Sure!",
        "I’d go along with you there.",
        "I quite agree — you’re quite right.",
        "That’s a good idea!",
        "That’s just what I wanted to say.",
        "Yes, that’d be very nice.",
        "I suppose you’re right.",
        "A good suggestion.",
        "I think we’ll give it a try.",
        "That’d be fine.",
        "What a good idea!",
        "It’s really no problem.",
        "I’d like that very much.",
        "All right, let’s do that. 1"
    ],
    "57. Disagreeing with (or refusing to accept) a suggestion ": [
        "I’m not so sure.",
        "That’s easier said than done.",
        "I’m not very keen on that, really.",
        "I’m not sure that’d be wise.",
        "Your idea sounds good, but I don’t think it’ll really work.",
        "I’m not sure I’d go along with that.",
        "I don’t think I’d go about it that way.",
        "I don’t think that’s such a good idea, you know.",
        "No, let’s try that one instead.",
        "That’s very well for you to say.",
        "No, don’t let’s put it off any longer.",
        "We can’t do any such thing, and that’s that.",
        "I’m not sure about that, actually.",
        "I doubt if that’d work.",
        "Your suggestion sounds fine in theory, but I don’t think it’d work in practice. 1"
    ],
    "58. Asking for a suggestion ": [
        "Have you got any suggestions?",
        "Which of these do you think shall I buy?",
        "Can you suggest a way out?",
        "What shall I do?",
        "How can I remove this ink-stain?",
        "Can anybody suggest what we might do?",
        "Where should we keep it?",
        "Who must I speak to about this — Antony or his deputy?",
        "What on earth should I do, then?",
        "How shall I pack your things?",
        "When shall we go to see them? When should I start, do you think? 1"
    ],
    "59. Expressing surprise ": [
        "What!",
        "Really?",
        "Oh, no!",
        "Wow!",
        "Impossible!",
        "You don’t say!",
        "Well, I never!",
        "It’s very surprising to hear this.",
        "Fancy seeing you here!",
        "How strange!",
        "Surely not!",
        "How on earth did you do it?",
        "That’s very surprising!",
        "Oh, what a beautiful present!",
        "Well, how about that!",
        "Fancy that!",
        "Where on earth have you been?",
        "This is a surprise!",
        "She didn’t!",
        "How surprising!",
        "Good heavens! How on earth could this have happened?",
        "Goodness!",
        "You must be joking!",
        "Did he, really!",
        "You’re not serious, are you?",
        "You don’t say! It’s rather surprising he said that.",
        "What a surprise!",
        "Believe it or not, she’s past fifty.",
        "I can’t believe it!",
        "I never knew that!",
        "Good God!",
        "Who’d have thought of such a thing!",
        "How nice to see you!",
        "What on earth is it?",
        "Why on earth did he do that? 1"
    ],
    "60. Saying that you’re not surprised ": [
        "I’m not surprised.",
        "I’m not surprised by the way he behaved.",
        "I’m not surprised at the news.",
        "What’s new in that?",
        "What’s so unusual in that?",
        "That’s no surprise to me!",
        "He’s very clever, but so is his father.",
        "Well, it was only to be expected, wasn’t it?",
        "That doesn’t surprise me in the least.",
        "Yes, I knew that.",
        "That’s no news to me.",
        "That’s not very surprising, is it?",
        "You haven’t told me anything that I don’t already know.",
        "It’s quite normal to feel angry in a situation like that.",
        "I’m not in the least bit surprised.",
        "Is there anything strange in that?",
        "Well, I rather expected it. 1"
    ],
    "61. Expressing sympathy ": [
        "(See also Sl. no.44 Expressing condolences).",
        "I’m terribly sorry.",
        "Oh, that’s terrible.",
        "Oh, that’s rotten.",
        "I’m sorry. What bad luck!",
        "I’m sorry to hear that.",
        "I’m extremely sorry to hear about it.",
        "Oh, tough luck. I’m terribly sorry.",
        "Oh, how upsetting!",
        "Oh, how annoying!",
        "That’s a pity!",
        "Oh no! I’m ever so sorry.",
        "Bad luck, Gita. You can always try again.",
        "Oh, it’s such a shame!",
        "That’s a crying shame — it really is!",
        "I’m so sorry to see you in this state.",
        "You’ll get well soon.",
        "I know it must have been a great shock to you.",
        "I know how it feels.",
        "What bad luck!",
        "What an awful situation for you!",
        "I’m so sorry to hear about that.",
        "Oh, that’s tough (= unfortunate)! I’m sorry.",
        "How terrible for you!",
        "I can’t tell you how sorry I am.",
        "When did he die? Was it very sudden?",
        "Did he suffer very much?",
        "You must be very upset about it.",
        "Hard luck, Vinod! I know you had worked so hard for the test. 1"
    ],
    "62. Expressing thanks ": [
        "(See Sl. no.61 Expressing gratitude). 1"
    ],
    "63. Responding to thanks ": [
        "Not at all.",
        "That’s O.K.",
        "It’s a pleasure. Any time.",
        "Don’t mention it.",
        "That’s all right.",
        "It was a pleasure.",
        "Not at all, it’s been a pleasure.",
        "Welcome.",
        "You’re welcome.",
        "I hope you like it. (Said when someone thanks you for something you’ve given them). 1"
    ],
    "64. Threatening to do sth ": [
        "(See also Sl. no.168 Warning sb to be careful or to keep from doing sth).",
        "You dare touch me!",
        "If you dare say that again, I’ll hit you.",
        "Stop shouting or I’ll go away.",
        "You’d better watch what you say.",
        "If you don’t stop teasing me, I’ll have to leave.",
        "If you come near me, I’ll scream.",
        "You had better watch it from now on!",
        "I’ll report you if you don’t do it.",
        "Look here, don’t try any nonsense with me.",
        "You’d better not come here again, if you know what’s good for you.",
        "Do it now, or else.",
        "If you don’t refund my money, I’ll have to take the matter further.",
        "If you say that again, I’ll break your neck.",
        "You’d better be ready for the journey.",
        "Do that, and I’ll show you.",
        "You’d better not make another mistake.",
        "I’ll be writing a stiff letter of complaint to your chairman.",
        "Don’t talk to me like that, or else.",
        "I won’t let you take any of your things away from here, unless you pay back my money.",
        "If you do that, you’ll be sorry.",
        "Don’t you dare tell lies to me.",
        "Remember your manners.",
        "Look here, I’ve come to the end of my patience.",
        "If you don’t pay the rent in a week’s time, I’ll have to ask you to vacate the house.",
        "You’d better behave yourself — otherwise I’ll have to ask you to leave.",
        "If we don’t get your cheque by the 30th, we’ll take proceedings.",
        "If you hurt him, you’ll have me to reckon with.",
        "Don’t you dare tell her father about this. 1"
    ],
    "65. Saying that you understand sth ": [
        "I understand.",
        "I understand how you feel.",
        "Yes, I get the point.",
        "A five-storey building, yes.",
        "Okay. I get the picture now.",
        "I think I’ve got that.",
        "I can imagine what you felt like.",
        "I must press this button, right? I think I’ve got the hang of it.",
        "Fine. So I’ll have to take the second turning on the left.",
        "Yes, I can picture the scene.",
        "Right. I think I’ve got the idea now.",
        "I can understand Tamil, but I can’t speak it.",
        "Yes. I get the hang of your argument now.",
        "I see your point, but I don’t agree. 1"
    ],
    "66. Saying that you don’t understand sb or sth ": [
        "(See also serial no.147 Asking sb to repeat what they’ve said).",
        "What does it mean?",
        "I’m sorry, I don’t follow.",
        "I can’t understand Telugu.",
        "I don’t quite get the hang of your argument.",
        "You’re speaking rather too quickly for me to understand.",
        "I just can’t make out why they quarrelled.",
        "I can’t quite make them out.",
        "I didn’t quite follow what you said.",
        "What she said doesn’t make sense to me.",
        "Can you speak a bit more slowly? I can’t understand you.",
        "I don’t understand what you’re driving at.",
        "I can’t make any sense out of it. 1"
    ],
    "67. Asking sb to wait ": [
        "Hang on a minute. (Let me get my breath back).",
        "Wait here. (I’ll be back in a few minutes). Would you wait there a minute, please?",
        "One moment. (I’ve just about finished).",
        "Wait until the rain stops.",
        "Just wait here, please.",
        "Hold on. (I’ll be with you in a minute).",
        "Hang on. (I haven’t finished yet).",
        "Wait a while. (I’ll be ready in a second or two).",
        "Just a minute (I’m nearly ready).",
        "Could you wait a minute, please? (I’ll see if he’s in).",
        "Wait a second, please.",
        "Hang on a minute. (He’s on another line right now).",
        "Can you wait a minute?",
        "Just a moment, please. I won’t be long.",
        "Wait a second. (I’m just coming).",
        "Kindly wait here, please. (I’ll see if he’s free).",
        "Would you mind waiting for a moment?",
        "Wait a bit. (I’ll soon be ready). 1"
    ],
    "68. Warning sb to be careful or to keep from doing sth ": [
        "(See also Sl. no.7 Admonishing sb and Sl. no.164 Threatening to do sth).",
        "Mind the step! Don’t fall over it!",
        "Be careful of that knife — it’s very sharp.",
        "Look out! It might fall on you.",
        "Watch out! Someone is coming.",
        "Watch out for that car ahead.",
        "I can smell gas. Perhaps there’s a leak.",
        "Be careful! It might bite.",
        "Be careful you don’t say anything to him.",
        "Be careful with your clothes, it’d be risky to do that.",
        "Look what you’re doing.",
        "Be careful with that man. He’s a crook.",
        "Watch where you’re going.",
        "Be careful to keep it in a cool place. Or it’ll turn sour.",
        "Be careful not to leave the door open.",
        "If you eat too much, you’ll be ill.",
        "Take care not to tilt it too far to a side.",
        "Be careful you don’t burn your fingers.",
        "Don’t do that! Watch out!",
        "There’s a car coming.",
        "Mind your head! The ceiling is very low in there.",
        "Don’t make any noise or you’ll scare the birds away.",
        "Careful! The floor is wet and slippery.",
        "Watch out for the cars!",
        "You’ll lose your figure if you eat too much chocolate.",
        "Watch out! There’s a pit there.",
        "You’ll get dirty if you do that.",
        "Mind you! There is a child there.",
        "Don’t say a word.",
        "Don’t use it — it can do severe damage to the skin.",
        "Mind you don’t drop it.",
        "Take your umbrella in case it rains.",
        "Watch it! You might hit him.",
        "Mind you don’t forget your umbrellas.",
        "Be careful not to turn it over.",
        "Don’t repeat what you’ve heard here.",
        "I should be careful, if I were you.",
        "It’s very hot. You might burn yourself.",
        "Be careful with that.",
        "Be careful with that knife, or you might cut yourself.",
        "It’s going to be foggy.",
        "I’m sure it’s going to rain.",
        "I can smell something burning.",
        "I wouldn’t do that, if I were you.",
        "Hurry. or you’ll be late.",
        "Take care that you don’t spill your coffee.",
        "You’ll get fat and lazy if you don’t exercise enough.",
        "Keep quiet about it until I’ve told them. 1"
    ],
    "69. Expressing good wishes ": [
        "Have a good journey!",
        "All the best, Asha!",
        "Have a nice time at the party!",
        "Have a good trip!",
        "I do wish you all the happiness in the world.",
        "Best of luck with the exams!",
        "Best of luck!",
        "Have a nice journey!",
        "Have a nice day!",
        "Have a good time at the party!",
        "Lots of luck, Prakash, in your new career!",
        "Have a good time!",
        "Good luck!",
        "Good luck in your exams!",
        "I hope you enjoy it.",
        "Have a good weekend. 1"
    ],
    "70. Expressing wishes, wants or desires ": [
        "I want a clean kerchief.",
        "I wish the sun would come out.",
        "I want somebody to do the housework here.",
        "Wouldn’t it be nice to win first prize?",
        "I want long sleeves.",
        "I want a full refund, please.",
        "I wish I could buy a house in this area.",
        "I’m looking for a new job.",
        "I want to change these wet clothes.",
        "How about making me a cup of coffee?",
        "Can I have something to drink?",
        "That’s not what I want.",
        "It’d be so nice to work for a company like that.",
        "I’ll take that, then.",
        "That’s just what I wanted.",
        "If only I could have a few days off.",
        "A packet of cigarettes, please.",
        "If only I could drive!",
        "I’d like to take a drive in this car.",
        "I’d like a dozen eggs, please.",
        "I’ll take the small one, then.",
        "I wish she’d give the kitchen floor a thorough scrubbing.",
        "Wouldn’t it be nice if they could come with us!",
        "I wish you’d listen to me!",
        "Have you got any money on you?",
        "Let’s have a cup of coffee, shall we?",
        "I do wish I could remember her name.",
        "I’d like to become a writer.",
        "I need to ask some advice.",
        "I need somewhere to keep my bike.",
        "I’d like some more cake, please.",
        "Have you got any milk? I want a cup of tea. 1"
    ],
    "71. Expressing wishes that were not, or will not be fulfilled ": [
        "I wish tomorrow was Monday.",
        "I wish I was tall.",
        "I wish I had never met him!",
        "I wish I was rich!",
        "I wish I knew what was going to happen.",
        "It would be nice to have a trouble-free car.",
        "If only you had asked me!",
        "If I’d enough money, I’d have bought a car long ago.",
        "If only I could swim!",
        "You could have said you were going to be late.",
        "I wish it was this time yesterday.",
        "If only you had reached the station a few minutes earlier!",
        "If only I hadn’t listened to them!",
        "I wish I knew what was happening.",
        "I only wish time didn’t go so slowly.",
        "If I had enough money, I could buy a car today.",
        "If only I had gone to see him a month ago. Note: Instead of saying ‘I wish I was rich’, you can also say ‘I wish I were rich’ — by using were instead of was. You know, ‘I wish I was rich’",
        "(with was) is informal in style and more frequent. 1"
    ],
    "72. Asking about wishes, wants or desires ": [
        "What do you want?",
        "Is there anything you want?",
        "Could you tell me what you want?",
        "What is it?",
        "What is it you want?",
        "Where do you want to go?",
        "Where shall we go for the holiday?",
        "Are you having anything to drink?",
        "Shall we go home to your flat?",
        "Do you want an apple?",
        "Anyone for badminton?",
        "Do you want me to wait for instructions?",
        "Is there anything I can do for you?",
        "Do you feel like going out for a meal tonight?",
        "Would you like me to go with them?",
        "What do you fancy doing then?",
        "Do you want anything else?",
        "Would you like to look round the place?",
        "Wouldn’t you like some more cake?",
        "Do you want me to help you?",
        "Were you looking for something?",
        "What do you want to do, then?",
        "What do you want for dinner?",
        "Were you looking for someone?",
        "Can I help you, Tony?",
        "Would you like some coffee?",
        "Do you want to know where it is?",
        "Can I do anything for you? 1"
    ],
    "73. Expressing worry or fear ": [
        "I’m worried.",
        "It worries me.",
        "Whatever could have happened to him?",
        "It makes me feel uneasy.",
        "I’m very worried about it.",
        "It’s terrible.",
        "They’re strangers.",
        "There’s something not quite right about it.",
        "I suppose it’ll be perfectly safe there?",
        "I don’t like the look of it.",
        "What happened to him?",
        "It scares me.",
        "This is all new to me.",
        "I’m worried sick.",
        "Good grief, what was that?",
        "Doctor, will it be all right?",
        "I’m frightened.",
        "It’s awful.",
        "I’m worried that he’ll get ill again.",
        "He hasn’t come back yet — this is worrying me.",
        "I find his behaviour very disturbing.",
        "What’s that terrible noise?",
        "Did he mean me to wait for him?",
        "I’m not at all happy about it.",
        "We’re going to miss our train.",
        "My next door neighbour is really a worry to me.",
        "They do things differently. That’s what worries me.",
        "I’ve got a nasty feeling that they’ve had an accident.",
        "Must you drive so fast?",
        "I’m very concerned about his health.",
        "His behaviour is very worrying.",
        "I’m scared.",
        "I’m a bit scared.",
        "Are you scared of the dark?",
        "Whatever’s the matter?",
        "I can’t help worrying about all this.",
        "Suppose the building catches fire?",
        "It frightens me.",
        "I feel very embarrassed.",
        "He should have been here an hour ago.",
        "If we don’t hurry, we’ll miss the train.",
        "I don’t like this at all.",
        "Are you sure you saw him?",
        "I don’t know what to expect.",
        "Oh, you gave me a fright.",
        "I’m a bit concerned about her exams.",
        "It’s nothing serious?",
        "I’m a bit concerned for his future.",
        "I’m afraid.",
        "I feel afraid.",
        "He’s got a very high temperature.",
        "Where’s everybody?",
        "Are you sure it’ll be all right? 1"
    ],
    "74. Asking what’s wrong with sb ": [
        "Anything wrong?",
        "You’re very quiet today.",
        "Is something wrong?",
        "Are you worried?",
        "You look rather pale, Sandra. What’s wrong?",
        "What’s on your mind?",
        "Is everything all right?",
        "What seems to be the problem?",
        "What’s worrying you?",
        "You sound worried. What’s the matter?",
        "You look terrible. What’s wrong?",
        "You’re afraid, aren’t you?",
        "You look upset. What’s wrong?",
        "Something wrong, is there?",
        "What seems to be the trouble?",
        "Are you frightened?",
        "You don’t look cheerful, Priya. Anything the matter?",
        "What is it? You look really fed up.",
        "Is anything the matter?",
        "Is anything wrong?",
        "You look all in, Nisha.",
        "You don’t look well today. Is anything wrong?",
        "What’s the matter?",
        "Are you all right?",
        "What’s wrong with you?",
        "Is there something wrong?",
        "What’s the matter?",
        "What’s the matter with you? 1"
    ],
    "75. Saying what’s wrong or what’s the matter ": [
        "My eyesight is going.",
        "My car won’t start.",
        "That noise is driving me mad.",
        "This shirt won’t go with these trousers.",
        "I don’t know what I did with the keys.",
        "I can’t find them now.",
        "I can’t find my glasses. I don’t know where I could have left them.",
        "I feel tired.",
        "I’m feeling rather tired.",
        "I’ve got a pain in the chest.",
        "My wallet has gone.",
        "I’ve got a terrible pain in my back.",
        "I feel sick. I think it was that meat I ate.",
        "I’ve got a bad cold.",
        "She’s broken a leg or something.",
        "This dress isn’t any good.",
        "She’s very ill.",
        "I’ve got a sprained muscle.",
        "My daughter has got flu.",
        "He’s ill with measles.",
        "My son is ill with flu.",
        "Her hearing is going.",
        "I’ve got a sprained elbow.",
        "I can’t support a family on the salary I earn.",
        "I don’t feel well.",
        "The doctors say he’s getting worse.",
        "I feel cold.",
        "I’ve got an upset stomach.",
        "I can’t close this suitcase.",
        "My watch doesn’t go.",
        "Mona’s mother died last night.",
        "She’s got a headache.",
        "He’s quite upset at losing his purse.",
        "There’s a lot of flu about.",
        "We have only two days to go, and the draft of the speech isn’t ready yet.",
        "I’ve got a pain in the arm.",
        "The journey has made her feel sick.",
        "He’s got a sore throat.",
        "My radio isn’t working.",
        "There’s something or other wrong with this TV.",
        "I’ve got no money on me.",
        "These clothes won’t all go in one suitcase.",
        "His mother has been taken ill suddenly."
    ]
}