{
    "1. Expressing ability ": [
        "He can drive.",
        "I can drive a car, but not a lorry.",
        "The door was stuck, but he was able to open it.",
        "When I was your age, I could run a mile in 5 minutes.",
        "He’s better able to do it than her.",
        "He’s quite an expert at this sort of work.",
        "She knows how to swim.",
        "He finished the work on his own without help from anyone else.",
        "He has ability, but he is lazy.",
        "She’s capable of passing the exam if she tries harder.",
        "He’s a good painter.",
        "He’s a good carpenter.",
        "Will you be able to come to the meeting tomorrow?",
        "She’s good at guessing things.",
        "I wouldn’t put it past him to do a thing like that.",
        "You can do much better, I’m sure.",
        "He has the ability to make decisions.",
        "She can speak Spanish fluently.",
        "You’re capable of doing better, you know. 2. Expressing inability",
        "He cannot do it without help.",
        "She can’t speak Telugu very well.",
        "He couldn’t understand a thing she said.",
        "I’m sorry, I won’t be able to come.",
        "I couldn’t answer her questions.",
        "He won’t be able to type so fast.",
        "She’s incapable of behaving rudely to anyone.",
        "I wasn’t able to pass the driving test the first time.",
        "He’s incapable of hard work.",
        "He’s incapable of telling a lie.",
        "He’s unable to help her.",
        "I can’t swim as far as you.",
        "I tried to move it, but I couldn’t.",
        "I want to come, but I’m unable to.",
        "I’ve never been any good at repairing things. 3. Asking about ability or inability",
        "Can you swim across the river?",
        "Can you drive a car?",
        "Can you ride a bike?",
        "Can you type?",
        "Is she able to understand the instructions?",
        "Were you able to solve the problem?",
        "Can’t you explain it more simply?",
        "Isn’t he able to read or write?",
        "Is he unable to walk without crutches? 4. Accepting sth (= something) [See Function (Fn). no.18 Accepting an apology, Fn.no.67 Accepting help, Fn.no.85 Accepting an invitation, Fn.no.100 Accepting an offer of food or drink, and Fn.no.149 Agreeing to/Accepting a request. See also Fn.no.10 Expressing agreement]. 5. Expressing admiration",
        "(See also Fn.no.21 Expressing appreciation, Fn.no.22 Expressing approval, and Fn.no.41 Complimenting sb).",
        "That’s the most magnificent performance I’ve ever seen!",
        "You don’t say! You mean you made it?",
        "Look at the building. Isn’t it beautiful?",
        "I just adore this colour.",
        "I’ve never seen anything like it!",
        "You’re the prettiest girl I’ve ever seen!",
        "Oh, that’s marvellous!",
        "Ah, really wonderful!",
        "It’s really wonderful!",
        "It’s really something!",
        "Isn’t that fantastic!",
        "It’s quite extraordinary, really!",
        "Oh, that’s lovely!",
        "What a grand view!",
        "Well, I never! That’s incredible!",
        "Really fantastic!",
        "It’s absolutely splendid!",
        "That’s quite fantastic!",
        "This dress looks really stunning on you.",
        "Terrific!",
        "What glorious roses!",
        "Ah, super!",
        "Oh, smashing!",
        "Oh, lovely!",
        "My!",
        "Oh, it’s the most impressive speech I’ve ever heard!",
        "I’ve never met anyone so attractive. 6. Admitting sth",
        "Yes, it’s possible.",
        "I’m sorry. It was a mistake on my part.",
        "Well, perhaps I should have handled it with some more care.",
        "I’ve been wrong about that.",
        "It was my mistake entirely.",
        "I think it was wrong of us not to invite them.",
        "Well, perhaps I may have been a little careless about it.",
        "I guess I didn’t have the nerve.",
        "Well, it could be true.",
        "No one is to blame but myself.",
        "Yes, OK, it looks as though I’ve slipped up.",
        "Look, I’m not able to do this — I find it too difficult.",
        "I’ve made a mistake in inviting them.",
        "I don’t know much Tamil.",
        "Yes, all right.",
        "I admit that I was absent-minded.",
        "He may be able to do it. Yes.",
        "So what if I broke the vase? It wasn’t intentional, you know.",
        "I’m sorry. You’re quite right about it.",
        "It was my fault entirely.",
        "This was all my own fault, really.",
        "What I said was quite wrong. I know.",
        "Well, perhaps we ought to have been a bit more careful.",
        "I’m entirely to blame for it.",
        "Oh dear, I seem to have made a mistake.",
        "There’s something in what he says.",
        "I made the mistake of trusting him with money.",
        "I had a part in that decision, too. I admit that. 7. Admonishing sb (= somebody)",
        "(See also Fn.no.168 Warning sb).",
        "Don’t repeat the same mistake again.",
        "Don’t try to harass me — I’m warning you.",
        "You’ll be more careful in future, won’t you?",
        "Don’t give me any more cause for complaint.",
        "There’ll be serious consequences if you try to cheat us again.",
        "I think you’re making a mistake.",
        "I don’t think that was very wise.",
        "Let me warn you: Don’t interfere in my affairs in future.",
        "Be more careful in future.",
        "Next time, I won’t forgive this kind of behaviour.",
        "You had better watch out!",
        "You had better not make another mistake.",
        "Don’t all talk together.",
        "I wouldn’t do such a thing again, if I were you.",
        "Just be more considerate in future.",
        "If you do this again, I’ll come down hard on you. 8. Advising sb",
        "You’d better explain everything to her.",
        "You’d better not do it.",
        "If I were you, I’d leave now.",
        "You ought to call the police.",
        "Wait till the proper time.",
        "If you want to pass the exam, you must work harder.",
        "You should meet him today.",
        "The best thing to do would be to send him a letter.",
        "If I were you, I’d sack him right now.",
        "If you play your radio here, you’ll have everyone complaining.",
        "I think you shouldn’t put it off any longer.",
        "It’s quicker to travel by train.",
        "Take it from me, it’s no use waiting for them.",
        "Why don’t you let him have his way?",
        "You really should go and see the Eiffel Tower while you’re in Paris.",
        "If you take my advice, you’ll turn a deaf ear to his complaints.",
        "Don’t you think you ought to send them some money?",
        "You should see a doctor about that cough.",
        "Try something else.",
        "You really must read that book. It’s wonderful.",
        "In your place, I’d wait for some time.",
        "If you feel ill, don’t take any exercise.",
        "I think it’d be best if you returned it to them.",
        "You really ought to work harder.",
        "I wouldn’t quarrel with him, if I were you.",
        "I wouldn’t do it.",
        "You ought to consult a doctor before it gets worse.",
        "You’d better be quick or you’ll miss the flight.",
        "You should stop smoking. 9. Asking for advice",
        "What do you think I should do?",
        "I’m sorry to worry you with my problems, but I really do need some advice.",
        "What should I do?",
        "What do you advice me to do?",
        "When should they start from here?",
        "I’m thinking of resigning...",
        "I’d like to ask your advice.",
        "Would you remain silent, if you were me?",
        "I can’t make up my mind whether to go or not...",
        "Can you tell me what I should do?",
        "Could you give me a bit of advice?",
        "Do you think I must give up without a fight?",
        "I have no idea how to go about doing it...",
        "How should I dress?",
        "How do you think can I persuade him to do it?",
        "Should I travel by bus or by taxi?"
    ],
    "10. Expressing agreement ": [
        "(See Fn.no.106 Agreeing with an opinion, Fn.no.149 Agreeing to/Accepting a request, Fn.no.156 Agreeing with a suggestion, and Fn.no.12 Agreeing reluctantly. See also Fn.no.4 Accepting sth)."
    ],
    "11. Expressing disagreement ": [
        "(See Fn.no.108 Disagreeing with an opinion, Fn.no.150 Refusing a request, Fn.no.157 Disagreeing with a suggestion, and Fn.no.13 Disagreeing tactfully, See also Fn. no.142 Rejecting sth)."
    ],
    "12. Agreeing reluctantly ": [
        "Perhaps you may have a point there.",
        "Well, I suppose so.",
        "Yes, I suppose so.",
        "Well, maybe.",
        "Yes, as far as I know.",
        "No, I suppose not.",
        "Yes, you could be right.",
        "Yes, you may be right about that.",
        "Well, you know, it’s a bit difficult, but I’ll try.",
        "Oh well, I’ll give it a try.",
        "Well, I suppose you’re right.",
        "I don’t know much myself, but I could try.",
        "Well yes, I’ll do it, if you like.",
        "Perhaps you’re right about it.",
        "Well, I’ll try, but I can’t promise anything.",
        "Well, maybe you’re right about that."
    ],
    "13. Disagreeing tactfully ": [
        "Yes, OK, but I should’ve thought that he was a hard worker.",
        "Yes, but don’t you agree that he’s the best player we have?",
        "I’m not sure I agree with you.",
        "I’m afraid I disagree with you. I think he’s a very good typist.",
        "Well, yes, but don’t forget that it’s only a rough estimate.",
        "I don’t think I’d go as far as that.",
        "Oh, I wouldn’t say that exactly. After all, he’s only a beginner, isn’t he?",
        "Well, you have a point, but he didn’t do it deliberately.",
        "I think you may be partly right, but nobody could have expected such a thing to happen.",
        "True, but how about all the good things he has done?",
        "Yes, but wouldn’t you say that he was absolutely sincere?",
        "Yes, but take the case of Manish. Didn’t he also do the same thing?",
        "Yes, but what about yesterday?",
        "I know, but did the figures tally?",
        "I’m not really sure you’re quite right, you know.",
        "You’re probably right, but is he telling the truth?",
        "Perhaps, but don’t you think it was a bit odd?",
        "Yes, you’re quite right, of course, but how can we convince him of it?",
        "Don’t you think that’s a bit extreme, actually?",
        "Yes, but the point is, it’s not a valuable item.",
        "Do you think so? Actually, I found the book a bit difficult to understand.",
        "Yes, that’s OK as far as it goes, but couldn’t he have sent her a telegram at least?",
        "I don’t think I’d say that about him.",
        "That’s quite true, but they couldn’t help it, could they?",
        "Yes, many of them were not co-operative, but some of them were really helpful, don’t you think?",
        "I see what you mean, but wasn’t it very kind of him to help us yesterday?"
    ],
    "14. Asking whether sb agrees or not ": [
        "Do you agree?",
        "Don’t you agree?",
        "Don’t you think?",
        "How about it?",
        "Don’t you think so?",
        "OK?",
        "All right?",
        "I don’t think we’re going to agree on this, are we?",
        "Wouldn’t you agree? Note: All question-tags (“is it”, “isn’t it”, “does it?”, “doesn’t it?”, “has it”, “hasn’t it?”, etc) help you ask someone whether they agree with what you’re saying or not.",
        "(We’ll take up question-tags for detailed study in a later Book)."
    ],
    "15. Expressing anger ": [
        "(See also Fn.no. 138 Rebuking sb).",
        "How dare you speak to me like that?",
        "What’s all this nonsense about?",
        "Who do you think you are?",
        "What the hell do you mean?",
        "Look, this is getting us nowhere.",
        "Oh, stop complaining — you make me sick.",
        "Where on earth have you been?",
        "What a nuisance!",
        "I think there’s very little point in my telling you all this!",
        "Who the hell is that at the front door?",
        "What on earth is happening there?",
        "That’s a ridiculous suggestion.",
        "Stop shouting your head off.",
        "What’s all the fuss about?",
        "I hate the whole rotten system.",
        "Are you suggesting that I should have apologized?",
        "Wherever did you put it?",
        "I put trust in you, but you failed me.",
        "I don’t give a damn what you think of me.",
        "Has it occurred to you that he could be telling the truth?",
        "How dare you!",
        "You mind your own business.",
        "That damn cat! I’d like to wring its neck.",
        "Well, really!",
        "What the hell do you want?",
        "Damn that stupid salesman!",
        "Get on with your work, can’t you?",
        "Don’t waste my time.",
        "I’ll be damned if I agree!",
        "I’ve got a bone to pick with you!",
        "You thought I wouldn’t find it out?",
        "There’s no way we’re going to agree, is there?",
        "What a rotten nasty trick!",
        "What incompetence!",
        "Are you trying to make a fool of me?",
        "Oh, no!",
        "I haven’t got time for this nonsense.",
        "I don’t care what it is.",
        "It’s none of your business.",
        "Did it never occur to you that they were waiting for you?",
        "I’m tired of hearing about this stupid car.",
        "I’ve come to the end of my patience.",
        "Don’t try any nonsense with me.",
        "Oh... leave it out.",
        "Leave me alone, will you?",
        "Don’t fuss.",
        "But this is ridiculous!",
        "Go to hell.",
        "How could you have been so silly?",
        "I knew it!",
        "What impertinence!",
        "What nonsense!",
        "Whenever are you going to be sensible?",
        "He spent all weekend working on his rotten car.",
        "These figures make a nonsense of your estimates.",
        "That isn’t my fault, is it?",
        "A fat lot you’ll ever save!",
        "Good God! Do you expect me to bring it you?",
        "The things I do are my business, not yours.",
        "I’m talking to you.",
        "Damn you!",
        "Damn! I’ve left my key behind.",
        "Are you accusing me?",
        "Is that all you’ve got to say?",
        "Look, let’s just leave it, shall we ?",
        "Varma, whatever happened?",
        "But this is ridiculous!",
        "Oh, hell! I’ve forgotten my money!",
        "She’s always boasting about her family.",
        "He’s always complaining about something.",
        "She’s always telling lies.",
        "Never heard of such a nonsense!",
        "Your mind is filled with nonsense!",
        "I’ve put up with a lot, but I won’t put up with this."
    ],
    "16. Expressing annoyance ": [
        "(See Fn.no.15 Expressing anger, and Fn.no.138 Rebuking sb)."
    ],
    "17. Apologizing ": [
        "Sorry, I’m not ready yet.",
        "Look, I really must apologize for what I’ve done.",
        "I’m sorry you’ve had to wait so long.",
        "I’m sorry — I really am.",
        "I’m very sorry that this has happened.",
        "I didn’t mean it.",
        "I am sorry if I worried you.",
        "Sorry, I haven’t finished it yet.",
        "Sorry about that. I hope you don’t mind.",
        "I’m afraid I’ve botched it up. I’m awfully sorry.",
        "I hope I’m not disturbing you.",
        "I’m terribly sorry. This is all entirely my own fault.",
        "How stupid of me! I wasn’t thinking.",
        "Sorry, Anil! Will you forgive me?",
        "I’m sorry. It was only meant as a joke.",
        "I’m sorry I’m late.",
        "Sorry, I got held up.",
        "Sorry, I can’t find it anywhere.",
        "Please forgive me for all this confusion.",
        "I do beg your pardon.",
        "I’m sorry I’m a little late for my appointment.",
        "I’d like to apologize for all that.",
        "I can’t begin to say how sorry I’m about it.",
        "Julie, I seem to have done something I have to apologize for.",
        "I really am sorry about it.",
        "Please excuse me for it.",
        "I’m so very sorry for saying all that.",
        "I’m sorry, we’ve really let you down, and there’s no excuse.",
        "Oh, you must forgive me. I had no idea.",
        "I have to leave early. I hope you’ll excuse me.",
        "Look, I didn’t mean to upset you."
    ],
    "18. Accepting an apology ": [
        "(See also Fn.no.59 Forgiving sb).",
        "Not at all.",
        "Please don’t worry.",
        "Forget it. I don’t want you to feel bad about it.",
        "That’s all right.",
        "That’s perfectly all right.",
        "It’s OK.",
        "It doesn’t matter, but don’t let it happen again, will you?",
        "Don’t worry about it. Anyone can make a mistake.",
        "Oh well, I suppose it’s all right.",
        "It doesn’t matter this time, but don’t repeat it."
    ],
    "19. Rejecting an apology ": [
        "It’s no use apologizing now. You should have done it earlier.",
        "It’s too late to apologize now.",
        "What’s the use of saying ‘sorry’? Look at the damage done to my car.",
        "It’s easy to say ‘sorry’, but how are you going to compensate me for my lost opportunity?",
        "You walk in an hour late, and all you can say is “I’m sorry”.",
        "I’m afraid saying ‘sorry’ just isn’t enough. You’ll have to do something about it.",
        "It’s all very well to say you’re sorry, but what are you to do about it?"
    ],
    "20. Making appointments ": [
        "(See also Fn.no.26 Arranging to meet sb).",
        "I’d like to make an appointment to see the Managing Director, please.",
        "I’d like to make an appointment with Mr. Bhaskar, please.",
        "How soon could I have an appointment?",
        "Would Sunday evening be all right?",
        "Five o’clock? Is there any chance of making it slightly earlier?",
        "Is there any other time I could come tomorrow?",
        "Can you give me an appointment on Thursday?",
        "Next week would suit me best.",
        "Is there any other time I could come tomorrow?",
        "Could we arrange day after tomorrow, then?",
        "Could I possibly come on Friday?",
        "I’m sorry, I can’t come then.",
        "Can I come earlier in the evening?",
        "Can I come later in the morning?",
        "Will Thursday or Friday suit you best?",
        "I’d like to come in the morning, please.",
        "Could I come on Saturday afternoon?",
        "Could you manage Friday?",
        "Can you make it 12 o’clock then, or would 3 o’clock be more convenient?",
        "Tuesday will suit me best.",
        "I’d like to make an appointment to see Dr. Narayan, please.",
        "Yes, afternoon would do very well.",
        "What about Thursday at 8.30?",
        "Can you fit me in nearer the end of the day today?",
        "Which day of this week will be more convenient for you?"
    ],
    "21. Expressing appreciation ": [
        "(See Fn.no.5 Expressing admiration, Fn.no.22 Expressing approval and Fn.no.41 Complimenting sb).",
        "It’s very good.",
        "I like that.",
        "Splendid!",
        "Great!",
        "Wonderful!",
        "Marvellous!",
        "It’s very nice.",
        "First rate.",
        "She has a pleasant voice.",
        "It’s the best film I’ve seen for a long time.",
        "It was most impressive.",
        "That’s an excellent idea.",
        "These stripes make your shirt look smart.",
        "I think it was first rate.",
        "I haven’t tasted fish like that for a long time.",
        "However did you do that?",
        "Oh, you mustn’t miss this film.",
        "It looks quite nice, doesn’t it?",
        "I like the way you do your hair, Laila.",
        "I think it was superb.",
        "You certainly know how to draw.",
        "The style of the dress is very good for you.",
        "It’s not bad at all.",
        "It’s a good thing you reminded me."
    ],
    "22. Expressing approval ": [
        "(See Fn.no.5 Expressing admiration, Fn.no.21 Expressing appreciation and Fn.no.41 Complimenting sb. See also Fn.no.152 Expressing satisfaction).",
        "I’m very happy about that.",
        "Fine!",
        "Great!",
        "Very good!",
        "Well done!",
        "Excellent!",
        "Right!",
        "I’m happy with his work.",
        "It’s very good indeed!",
        "I’m happy about the whole idea.",
        "I think he is quite right in saying that.",
        "Good thing for you.",
        "I’m glad of the chance.",
        "This soup tastes very nice.",
        "Quite right!",
        "I rather like your friend.",
        "This shirt looks well on you.",
        "That’s fine!",
        "I quite like your shirt.",
        "What you did was right.",
        "I think it’s a good idea.",
        "I don’t think I’ve ever seen anything quite so good.",
        "I’m very glad you said that.",
        "I very much approve of the idea.",
        "I’m in favour of that.",
        "I do like your dress.",
        "That was magnificent.",
        "What you said was right.",
        "I think they were quite right to reject it.",
        "I have no objections.",
        "He played brilliantly, didn’t he?",
        "I think it is a good thing that he has decided to do it.",
        "I love the way you dress.",
        "That’s a lovely dress you have on.",
        "He’s quite an interesting person.",
        "It’s really nice.",
        "Oh, it’s delicious. You cook very well.",
        "What a marvellous movie!",
        "These are rather pretty.",
        "You handled the situation very well.",
        "It’s very pretty.",
        "He’s a warm and friendly person.",
        "She’s a very well-behaved girl."
    ],
    "23. Expressing approval in a reserved or qualified way ": [
        "Not bad, really.",
        "It’s all right, I suppose. Only, it’s a bit bright.",
        "Most of it was good, but some parts were rather dull.",
        "It isn’t too good.",
        "It’ll do for a start.",
        "It was quite good on the whole.",
        "It’s not bad at all, really.",
        "It wasn’t a bad film, was it?",
        "I think it would’ve been better if it hadn’t been so sweet.",
        "I’ve seen worse.",
        "It’s quite good, really, but it’s a bit loose for you, I think.",
        "He may be very clever, but he can’t do anything practical.",
        "Parts of it are OK, but on the whole, there’s much that you can do to improve it.",
        "They look fairly good."
    ],
    "24. Expressing disapproval ": [
        "I didn’t think much of that movie.",
        "It’s absolutely dreadful.",
        "I think you behaved very badly towards them.",
        "It isn’t up to much.",
        "You shouldn’t say that.",
        "I’m afraid I didn’t like that.",
        "You shouldn’t have done it.",
        "It’s entirely your fault.",
        "I don’t like it, I’m afraid.",
        "It’s all very well for you to criticize, but it doesn’t help the situation.",
        "I didn’t enjoy it at all.",
        "It’s a pity you didn’t bring it.",
        "I didn’t find it interesting.",
        "I can’t say I like it.",
        "These people are really the limit!",
        "That’s a bit old, isn’t it?",
        "I can’t bear it.",
        "I didn’t think the play was much good.",
        "I can’t stand the sight of that fellow.",
        "What an awful day!",
        "I’m not in favour of that.",
        "Good God! You look a mess!",
        "I’d hoped you would’ve done better than this.",
        "I don’t think that’s wise.",
        "No one seems to give a damn about anything.",
        "It’s not very nice.",
        "Why on earth did you do that?",
        "It was a bit boring.",
        "Your hair looks a wreck, Mallika.",
        "I thought the party was dreadful.",
        "It’s much smaller than I thought.",
        "Oh, the food was terrible.",
        "It doesn’t taste very nice.",
        "I didn’t think much of it, actually.",
        "I don’t think you should’ve gone there.",
        "It’s quite terrible.",
        "I don’t think that’s advisable.",
        "He complains too much.",
        "This colour doesn’t suit you.",
        "What dreadful weather!",
        "I wish you hadn’t said that.",
        "He has made a poor job of it.",
        "I don’t think it’s a good idea, actually.",
        "It’s absolutely disgusting.",
        "You shouldn’t have gone there.",
        "It wasn’t very good, really.",
        "Her sari looks shabby.",
        "I don’t like the way he speaks to me.",
        "I was very disappointed by it, actually.",
        "You look a fright!",
        "Damned politicians. They’re all the same.",
        "Surely you’re not going out looking like that?",
        "That’s very faded, isn’t it?",
        "It’s no good.",
        "I’ve never seen such a mess.",
        "What’s so awful is the way he speaks to me.",
        "It doesn’t sound like a very good idea to me.",
        "Terrible film, wasn’t it?",
        "It isn’t good enough.",
        "I’m not sure I like that colour.",
        "It has a disgusting smell.",
        "It doesn’t really suit you, you know."
    ],
    "25. Expressing disapproval in a tactful way ": [
        "I think you should’ve explained it to them personally.",
        "It would’ve been better if you had refused it.",
        "Don’t you think it would’ve been better if you’d brought him along?",
        "Does it look a bit too small for you?",
        "Did you have to be so tough with them?",
        "Does it look a little faded?",
        "Was it really necessary to look into all these things?",
        "Do you think the other one would have been better?",
        "Why did you do a thing like that?"
    ],
    "26. Arranging to meet sb ": [
        "(See also Fn.no.20 Making appointments).",
        "Meet me in front of the Library at about 4:00.",
        "I’ll meet you at 6 o’clock by the office.",
        "Shall we meet at the station?",
        "I’ll pick you up at the station.",
        "I’ll collect you from there in half an hour.",
        "OK, 6 o’clock in the book shop, then.",
        "OK, we’ll meet for lunch, then.",
        "I’ll pick you up at about 6:"
    ],
    "00. ": [
        "I’ll come and meet you at the station.",
        "Shall we make it 6:00 outside the church?",
        "If it’s okay with you, I’ll come at about 8.",
        "I’ll meet you at the bus stop next to the Town Hall."
    ],
    "27. Attracting attention ": [
        "(See also Fn.no.120 Pointing things out). Note: Pay special attention to the words before the first bracket.",
        "Hang on a second (, I think I know his name).",
        "Half a minute (, let me finish this).",
        "Excuse me (, is there a hotel near here?)",
        "Just a second (, where did you say he’s from?)",
        "Half a second(, I’ll soon be ready).",
        "Now listen to what I’m going to say.",
        "Look (, if there’s something you want to tell me, why don’t you come back later?)",
        "Listen",
        "(, Hasina’s been promoted).",
        "Just a minute (, how much did you pay for this?)",
        "Bear in mind that all this happened at night.",
        "Wait a minute (, I think you’ve got it all wrong).",
        "Now remember this.",
        "I beg your pardon (, I didn’t hear you).",
        "Now this is how it all began.",
        "Shyam (, there’s a call for you).",
        "Have a look at this photo.",
        "Sorry to bother you (, but there’s something I want to show you).",
        "Hey, Seema! (What are you doing here?).",
        "Hey you (, come here!)"
    ],
    "28. Making bookings ": [
        "I’d like to reserve two seats on the coach to Baroda tomorrow.",
        "I’d like to book my car in for a service, please.",
        "Do you think I need to book a seat?",
        "How many days in advance do I have to book?",
        "Is the first-show fully booked?",
        "Are there any second class seats available?",
        "I’d like to book three seats for Tuesday the 6th, please.",
        "What price are tickets, please?",
        "Do you have any seats for the evening?",
        "Have you got any seats for Saturday evening?",
        "Are any seats available for the matinee?",
        "I’d like to book two seats for the first-show today, please.",
        "Is Sunday completely booked up?",
        "Oh, that’s a pity. Well, thank you, anyway.",
        "I’ll be there on the 14th. Can you book a hotel room for me?",
        "Book five seats on the Bangalore Express.",
        "We have booked a seat for you on the Chennai flight.",
        "Then book two seats for us on that bus."
    ],
    "29. Breaking the ice ": [
        "(See Fn.no.103 Opening a conversation with a stranger)."
    ],
    "30. Buying things ": [
        "How much is that?",
        "How much does that sell for?",
        "How much are these oranges?",
        "Give me a kilo of apples. Pick out big ones, please.",
        "Excuse me. I’d like a shirt for myself.",
        "A packet of cigarettes, please.",
        "I’d like a kilo apples. They must have no spoiled spots in them.",
        "I’d like to see some belts, please.",
        "Let me see what you have in handkerchiefs.",
        "Give me a tube of toothpaste.",
        "I don’t suppose you have anything cheaper?",
        "Can I have a 10- rupee postal order please?",
        "Which of these do you think are better?",
        "I’m looking for a radio.",
        "I think I will take this one.",
        "Have you got a bigger size?",
        "What’s the price of this washing machine?",
        "Well, I’ll take half a dozen of those, please.",
        "Oh, it’s more expensive, is it?",
        "Have you got a different style?",
        "These are small. Have you any that are slightly larger?",
        "Let me see some pens, please.",
        "Twenty 50-paise stamps, please.",
        "I want some one-rupee stamps. Give me 29, please.",
        "Are they my size?",
        "Have you got a lighter colour?",
        "What kind of material is this?",
        "Have you got a looser style?",
        "Have you got this one in any other colours?",
        "You sell them by the kilo or by the dozen?",
        "Do you have something like this in some other material except cotton?",
        "That’s 10 rupees, isn’t it?",
        "How do you sell these apples?",
        "How much are they?",
        "How are the potatoes today? I’d like a kilo. Be sure they’re small and solid.",
        "Can I have ten envelopes please?",
        "This is too big. Do you have a smaller size?",
        "I think I can give you the right money.",
        "Three hundred rupees?",
        "That’s more than I care to spend.",
        "Will you wrap it up, please?",
        "This one is cheaper, isn’t it?",
        "Have you got any checked shirts?",
        "A bottle of shampoo, please.",
        "No. I don’t need anything else.",
        "Have you got a different style?",
        "Nothing else, thank you.",
        "Four hundred rupees is a little expensive.",
        "I believe that’s about all.",
        "Do you take credit cards?",
        "I’ll leave it, thank you.",
        "I’ll take it, thank you.",
        "How much do I owe you for everything?",
        "I want some lemons. How do you sell them?",
        "Pick me out a few small ones, please.",
        "I guess that’s about all."
    ],
    "31. Expressing capability ": [
        "(See Fn.no.1 Expressing ability)."
    ],
    "32. Expressing incapability ": [
        "(See Fn.no.2 Expressing inability)."
    ],
    "33. Expressing certainty ": [
        "I’m sure he’s right.",
        "Without doubt, he’s one of the best players we have.",
        "They’ll come, I’m sure of it.",
        "It’s quite certain he was trying to fool you.",
        "I’m convinced that we can’t trust him.",
        "They’ll be here in time, I’m sure.",
        "I’m sure he’s done the right thing.",
        "I know what he’s going to do.",
        "I’m absolutely sure that she comes from Australia.",
        "There’s no doubt that he comes from a rich family.",
        "They must have left by now.",
        "I’m certain that he’s the one who did it.",
        "It’s clear that she knows him.",
        "There’s no doubt about it in my mind.",
        "Obviously, he is against the proposal.",
        "There was no mistaking him.",
        "Arun will only start tomorrow, I’m certain about that.",
        "We were at fault. I have no doubt about it.",
        "I’m quite positive that they had met earlier.",
        "He’s innocent. I’m convinced of it.",
        "I certainly believe that he was in the wrong.",
        "I feel quite sure that it was Susan.",
        "He doesn’t stand a chance of winning.",
        "I don’t doubt that he wanted to help her.",
        "It’s impossible that he could have seen her there."
    ],
    "34. Expressing uncertainty ": [
        "(See also Fn.no.56 Expressing doubt and Fn.no.75 Expressing indecision).",
        "I’m just not sure.",
        "I don’t think so.",
        "I’m not sure about it.",
        "I can’t make up my mind.",
        "I can’t decide if I should invite them.",
        "I don’t think you’re right.",
        "I haven’t a clue.",
        "I’m not sure whether he knows it.",
        "Do you think I should call him?",
        "I’m in two minds whether to accept it or not.",
        "I don’t believe him.",
        "Perhaps the answer is to leave it to chance.",
        "I don’t know whether to do it or not.",
        "Oh, I feel in such a muddle.",
        "Oh, I must say I find that very odd.",
        "He can’t have known about it.",
        "I can’t decide what to do.",
        "I don’t believe that he can do it.",
        "He can’t do it, I think.",
        "If only I knew what to do.",
        "I can’t decide whether to take it back to the shop or not.",
        "I can’t believe it, I really can’t.",
        "I don’t believe this is true.",
        "Tell me a way out.",
        "I’m in two minds about doing it."
    ],
    "35. Asking about certainty and uncertainty ": [
        "Do you think he’ll come?",
        "How do you know?",
        "Are you quite sure?",
        "Are you absolutely certain it was Amjad?",
        "Do you believe that he did it?",
        "So you’re quite sure, are you?",
        "Are you sure that he’s her brother?",
        "You couldn’t have been mistaken, could you?",
        "Are you absolutely sure?",
        "Was it, really?",
        "Do you think so?",
        "How sure are you?",
        "Do you suppose that he’s right?"
    ],
    "36. Changing the topic ": [
        "(See also Fn.no.83 Introducing a conversational topic). Note: Pay special attention to the words in italics.",
        "Oh, that reminds me. Has he given you the key of the house?",
        "Now then, where has Ravi gone?",
        "Have you closed the door? Right, pull that chair and sit down.",
        "Talking of money, has Tom paid back the bank loan?",
        "Now listen! I have a plan.",
        "Right, what time is it now?",
        "Okay then, are we all ready to go?",
        "Oh by the way, tomorrow is a holiday, isn’t it?",
        "All right then, I’ll see you tomorrow.",
        "Right then, do we still have time to go for a film?",
        "Now, let me think.",
        "Speaking of marriage, did you know Rahul is going to marry Madhu?",
        "Now, who’d like some more porridge?",
        "Now then, are we all ready to go?",
        "He’ll easily find another job. Incidentally, where’s his brother now?",
        "Right then, what was I saying?",
        "All right then, let’s remove this from here.",
        "Well now, are there any questions?"
    ],
    "37. Checking up (facts, agreement, understanding, etc.) ": [
        "Are you quite certain?",
        "Is it true what he said?",
        "They mustn’t go there, must they?",
        "So that made her cry, did it?",
        "... That must be why he said ‘no’. Do you get my drift?",
        "There is no door there. Is that right?",
        "Do you understand what I mean?",
        "So that’s Meena?",
        "I assume you’re not a vegetarian, Ravi?",
        "He mustn’t come to know you’re here, do you see what I mean?",
        "He’s satisfied with that, isn’t he?",
        "So that’s the switch I must press, is it?",
        "The train leaves at ten, doesn’t it?",
        "So you’re quite sure, are you?",
        "I’d like to make sure the train is not late.",
        "You mean he’s a reasonable man at heart?",
        "Their rate is a bit too high, what do you think?",
        "They’ll bring it with them, won’t they?",
        "This date is right?",
        "Isn’t that your friend over there?",
        "You don’t want it, do you?",
        "Do you get me?",
        "Do you get it?",
        "Are you saying that Tuesday would suit you better?",
        "We shouldn’t have done it, don’t you agree?",
        "Let me just check I’ve got it right. First, I must... then, I must...",
        "We can’t pay cash, can we?",
        "It sounds like you’re saying you don’t like it, right?",
        "Did you say ‘crux’?",
        "That’s a Honda, isn’t it?",
        "Can I check that with you, please? You want me to buy ‘x’, ‘y’, and ‘z’ — right?",
        "This isn’t the best place to talk about it, do you know what I mean?",
        "You haven’t begun doing it, have you?",
        "Let me understand this. First you make an entry in the Day Book. Then you make an entry in this Ledger. Right?",
        "Are you sure?",
        "So you’re saying you won’t be able to do anything about it?",
        "I take it that you agree. All right?",
        "Let me just check I’ve understood it right. First, we must...",
        "We’ll share the expenses, do you agree?",
        "She hasn’t seen you, has she?",
        "You went there to take a look? Note: All question-tags help you check up facts, agreements etc. (We’ll take up question-tags for detailed study in another Book)."
    ],
    "38. Asking for clarifications ": [
        "(See Fn.no.37 Checking up, Fn.no.56 Expressing doubt, Fn.no.77 Asking for information)."
    ],
    "39. Making a complaint ": [
        "I bought this radio from you only last week. It doesn’t work. It doesn’t even make a sound. I’d like a replacement, please.",
        "The potatoes you sold me are full of spoiled spots. I don’t want them. Pick me out a few unspoiled ones, please.",
        "I have a complaint to make. It’s about the TV I bought from you yesterday. It’s not working. I can’t get a picture at all.",
        "I bought this shirt from you yesterday. When I got home, I saw it had a hole in the collar. I’d like to exchange it for another one.",
        "I’m sorry to trouble you, but this clock doesn’t work. I bought it from you last week.",
        "These oranges are green — I want ripe ones — firm and ripe.",
        "I’m not interested in getting it repaired. I want a refund on it.",
        "These trousers are too tight across the seat. Can you change them, please?",
        "These trousers have a big tear in one leg.",
        "There seems to be something wrong with this camera. I’ve been using the flash, but all the pictures it takes are completely dark.",
        "I bought these shoes from you two days back. They’re defective.",
        "This shirt is too tight for me. Can you let it out a little?",
        "I bought this switch from you yesterday. I’m afraid it’s faulty. Can I have another, please?",
        "These trousers don’t fit. They’re much too loose round the waist.",
        "I bought this briefcase from you last week. When I lifted it today, the handle came off in my hand. I’d like a refund, please.",
        "I’m not satisfied with this mixer. It shakes whenever it works. And it makes a lot of noise.",
        "These lemons are soft and no good. I want firm, unspoiled ones.",
        "I bought this dress from you. It’s too small for me. Could I have a larger size?",
        "You delivered a new washing machine yesterday. It doesn’t work.",
        "These apples look green. I want ripe ones, please.",
        "These apples are bruised. Can you change them please?",
        "I bought these scissors here. They aren’t sharp enough. I want you to replace them.",
        "I bought these shoes here yesterday. I’ve only worn them once. One heel is already loose.",
        "I got this dress stitched here. The waist is too tight. Can you let it out a bit?",
        "Do you remember me buying this tin of milk powder from you yesterday? When I opened it at home, I saw it was mouldy.",
        "This fan doesn’t work. I’d like you to do something about it.",
        "I bought this shirt from you yesterday. The seams down its side split the first time I put it on.",
        "I’ve got a bit of a problem with my radio.",
        "There are some spots on this sleeve.",
        "I bought these pants from you last night. In the daylight, the colour looks awful. Could I have a lighter colour, please?",
        "My TV set has broken down again. Can you send a mechanic quickly?"
    ],
    "40. Complaining about people’s behaviour ": [
        "Will you please stop making so much noise?",
        "You shouldn’t have said that. That’s what hurts me most.",
        "Will you stop teasing me?",
        "This is really going too far. I’m sorry, but this has got to stop.",
        "I’ve just about had enough! Now stop it!",
        "How come you’re in such a bad mood today?",
        "That’s really going a bit too far.",
        "I’m sorry to have to say this, but you’re making fun of me, and I want you to stop doing that.",
        "You have absolutely no right to behave like that.",
        "That’s your radio, isn’t it? Will you please turn the volume down a bit, please?",
        "You don’t have to be rude. I only asked you a simple question.",
        "What do you think you’re doing?",
        "I feel bad about what you said now.",
        "If you don’t stop smoking, I’ll have to complain to the conductor.",
        "Have you gone off your head?",
        "Must you always shout at her like this?",
        "This is really too much!",
        "Would you mind making less noise?",
        "Stop shouting! I’ve had enough of this.",
        "Why don’t you stop using such foul language?",
        "How can you ignore me like this — after everything I have done for you?",
        "What are you so angry about?",
        "What gives you the right to behave like that?"
    ],
    "41. Complimenting sb ": [
        "(See also Fn.no.5 Expressing admiration, Fn.no.21 Expressing appreciation, and Fn.no.22 Expressing approval).",
        "How nice you look!",
        "You have a beautiful voice.",
        "You look lovely.",
        "You look very nice today.",
        "I like your sari. The colours are terrific.",
        "You finished it in record time. That’s great!",
        "You always dress very nicely.",
        "That dress really suits you.",
        "Your shoes look nice.",
        "How could you do it so quickly?",
        "What a nice shirt!",
        "That’s a splendid idea, Imran.",
        "You’ve got a brilliant mind.",
        "This sari really suits you.",
        "You can’t have been married 25 years. You look so young.",
        "You put a lot of extra effort into your work this weekend, Rupa. Otherwise, we wouldn’t have been able to meet the deadline.",
        "You have a really nice way of putting things.",
        "You look lovely with your hair short.",
        "That colour does suit you.",
        "You’re always so beautifully dressed, Mira.",
        "That shirt really looks nice on you.",
        "How could you figure out a solution so easily?",
        "I love you in this sari."
    ],
    "42. Answering a compliment ": [
        "Thanks, I’m glad you like it.",
        "Thank you.",
        "Really? I’m not sure about it, actually.",
        "Thank you. I think it looks nice on me, too.",
        "Nice of you to say so.",
        "It’s nice, isn’t it?"
    ],
    "43. Inviting compliments and comments ": [
        "See this dress?",
        "How does it look?",
        "What do you think of my hair style?",
        "Do you think so? What’s it about my hairstyle that’s bad?",
        "Look at this antique vase. Don’t you think it’s beautiful?",
        "How about its shape?",
        "Do you like my new sari?",
        "What’s it about my sari that makes me look good?",
        "I think this shirt suits me. Don’t you?",
        "I don’t understand. What’s it about my shirt that makes me look bad?"
    ],
    "44. Expressing condolences ": [
        "(See Fn.no.161 Expressing sympathy).",
        "I heard what happened. My deepest sympathy, Atul.",
        "I’m very sorry to hear your father has died.",
        "George, my deepest sympathy on your sad loss.",
        "I heard about your tragic loss. I’m extremely sorry.",
        "I hear your grandmother has died. I’m sorry.",
        "Please accept my condolences.",
        "I’m very sorry to hear about your uncle. He was such a good man."
    ],
    "45. Congratulating sb ": [
        "Congratulations, Paul!",
        "Many, many congratulations!",
        "Congratulations! Your essay has won first prize.",
        "I’m so glad!",
        "My heartiest congratulations!",
        "I’m so happy for you!",
        "I hear you’ve had a baby. Congratulations!",
        "I do think you’re a lucky man.",
        "Hey, you’ve got that job? Congratulations.",
        "Well done!",
        "Let me offer you my congratulations.",
        "I think you deserve it!",
        "I was delighted to hear about it.",
        "Splendid! You must be very pleased.",
        "I couldn’t have been more pleased!",
        "I congratulate you. You’ve done a fine job, Deepak!",
        "That was excellent. Congratulations!",
        "I’m so pleased for you!",
        "I was thrilled to hear about your new job.",
        "You deserve all the luck in the world!"
    ],
    "46. Contradicting sb ": [
        "(See Fn.no.50 Denying sth)."
    ],
    "47. Trying to convince sb of sth ": [
        "(See also Fn.no.113 Trying to persuade sb).",
        "Yes, really. It’s quite true.",
        "I tell you, it’s a fact.",
        "Don’t you feel that he could have been mistaken?",
        "I am absolutely certain.",
        "I saw him just now, really.",
        "You see, the service there is excellent.",
        "I tell you, it’s true.",
        "But surely you must agree that this is not a normal case.",
        "He’s innocent, I can assure you.",
        "It must be true.",
        "It’s here in black and white.",
        "Honestly, it’s quite true.",
        "I can guarantee that you’ll have a good time.",
        "But don’t you agree that he was away at that time?",
        "This is the best price we can get — there’s no doubt about it.",
        "Isn’t it possible that he doesn’t know anything about it?",
        "Look, I saw it myself.",
        "I tell you, it’s certain.",
        "But can’t you see that he’s interested in the idea?",
        "That’s all I know, honestly.",
        "But you must admit that he did all he could.",
        "I have made doubly sure that there are no mistakes.",
        "I saw it with my own eyes."
    ],
    "48. Correcting sb or sth ": [
        "I went there on Tuesday — I mean, Wednesday.",
        "No, there’s nothing to worry about.",
        "That’s not right, do it like this.",
        "No, it’s a black one — not a blue one.",
        "Next week, I won’t be here — that is, from Tuesday.",
        "No, that isn’t true.",
        "No. He gave no reason.",
        "That’s not the proper way to eat noodles.",
        "No, nobody knows it, really.",
        "A square board? Are you sure? I should’ve thought it was a rectangular one.",
        "No, to the right — not to the left.",
        "I’ll be with you in about 15 minutes — no, you’d better make that 30 minutes.",
        "No, that’s not the one.",
        "I heard no such thing.",
        "No, not exactly.",
        "That’s the wrong way to hold the bat.",
        "He said nothing of the sort.",
        "No, not like that, actually.",
        "I never said any such thing.",
        "In front of the Town Hall, you mean.",
        "I don’t think so.",
        "No, that isn’t correct.",
        "Mind you, he’s no fool.",
        "No, it’s the third one.",
        "That isn’t the right one.",
        "Don’t get me wrong — I am not against the plan.",
        "No, before the cross-roads, in fact.",
        "His uncle? His father, you mean?",
        "I saw them — at least, I think I saw them.",
        "No, in fact, I’ve never seen him.",
        "Wasn’t it bigger than that?",
        "That’s wrong, really."
    ],
    "49. Criticizing sb or sth ": [
        "(See Fn.no.24 Expressing disapproval, Fn.no.151 Expressing sarcasm)."
    ],
    "50. Denying sth ": [
        "That’s not what I said, There’s nothing in these rumours.",
        "I’m quite sure I’d never have told you to do it.",
        "I hate to contradict you, but I think you’re wrong.",
        "She definitely hasn’t met me.",
        "No.",
        "I’m afraid that’s not what really happened.",
        "Surely not.",
        "But I did not do that.",
        "No, I didn’t.",
        "No, you haven’t told me.",
        "That’s not what I intended, actually.",
        "I hate to contradict you, but I didn’t say that.",
        "I think you’re mistaken.",
        "He wasn’t there, really.",
        "Never.",
        "No, there isn’t any milk left.",
        "No. I’m afraid you haven’t.",
        "Don’t be so ridiculous!",
        "I hardly know her.",
        "What you’re saying is absolutely wrong.",
        "I certainly did not.",
        "No, they couldn’t.",
        "Actually, I don’t think they are.",
        "I didn’t tell you to do it.",
        "Nobody answered the phone.",
        "That’s not true.",
        "I do mind, but not too much.",
        "He didn’t do it, actually.",
        "Don’t be so silly!",
        "There’s no sugar left.",
        "I never saw her at all.",
        "No, she hasn’t.",
        "No, I really don’t mind driving.",
        "I’m quite sure I never asked you to do it.",
        "Surely you don’t believe that I said such a thing?",
        "That’s a lie.",
        "Well, actually I didn’t meet them.",
        "I don’t think they have.",
        "I said nothing of the sort.",
        "Are you sure? I had the impression the staff all speak good English.",
        "That’s absolutely ridiculous.",
        "Excuse me, but that isn’t so.",
        "No that’s not what I meant.",
        "He isn’t resigning.",
        "That isn’t true."
    ],
    "51. Describing sb ": [
        "He’s a man of powerful build, with a severe face.",
        "He’s a muscular and broad-shouldered man.",
        "She’s slender and has long, dark hair.",
        "She’s not very tall.",
        "He’s of average build.",
        "He’s dressed in jeans and a shirt with sleeves rolled up.",
        "He’s a tall, powerfully-built man, barrel-chested, and muscular.",
        "She has a pleasant, frank look.",
        "He’s rather fat.",
        "He was dressed in uniform.",
        "He’s a nice-looking young boy in blue jeans, active and alert.",
        "He was wearing trousers and a white shirt.",
        "She’s a tall business-like woman of about"
    ],
    "35. ": [
        "She has a good-natured face and has a friendly, charming manner.",
        "His hair is close-cropped.",
        "He has deep-set eyes.",
        "She’s altogether a little showy.",
        "She’s very pleasing and graceful in appearance.",
        "He’s dressed in a black shirt and must be just over thirty.",
        "He’s quite tall.",
        "Her eyes were alert and greedy.",
        "She has a charming smile and engaging manner.",
        "He’s not particularly good-looking.",
        "He’s ten or twenty kilos overweight.",
        "He’s a short man in the early fifties, with a bald head.",
        "She’s dressed very quietly.",
        "Her eyes were wide and dark.",
        "He looked very young, about"
    ],
    "17. ": [
        "He’s fairly tall with short, black hair and bushy eyebrows.",
        "He’s of medium height, neither fat nor thin, and clean shaven.",
        "He’s about 35 years old, with dashing good looks.",
        "She’s very simply and neatly dressed.",
        "She’s seventeen, tall and slender, with searching eyes.",
        "She has long, black hair.",
        "His stomach is flat.",
        "She has big, dark eyes.",
        "He has a cheerful manner.",
        "He’s a man of about 40, tall and good-looking.",
        "He’s a tall, elderly man with grey hair and of healthy appearance.",
        "She’s very slim and is in the late thirties.",
        "He’s a large, dark man of more than 50, with a high forehead.",
        "His nose is long and thin.",
        "She has a slender waist.",
        "He’s an elderly man with a pleasant face.",
        "His mouth turns down slightly at the corners.",
        "She’s very attractive.",
        "He’s a shrewd-faced man in his early fifties.",
        "She has a supple, well-curved figure.",
        "She’s a pretty girl of about 20, with fair hair.",
        "She’s dressed in a light blue sari.",
        "His hair is combed straight back from his forehead.",
        "He’s well-built and has a stern face.",
        "She’s trim and efficientlooking.",
        "He has a blue shirt on.",
        "She’s a trim girl in the early twenties.",
        "She’s tall and quite thin.",
        "He’s a slim, tall, grey-haired man, with a gentle manner.",
        "He’s quite tall, about 6 feet, and slightly stoop-shouldered.",
        "He’s a stout man, bold and self-assured.",
        "He always dresses well.",
        "He seems a little overweight.",
        "He’s rather thin.",
        "She’s not particularly good-looking.",
        "He’s a stout, middle-aged, individual with a face that’s determined.",
        "She’s a chunky woman with pale complexion."
    ],
    "52. Describing a house ": [
        "There are six rooms in that house, not including the kitchen and three bathrooms.",
        "His house has an entrance hall, two bedrooms, a kitchen and a bath.",
        "From the hall, a door opens into another room.",
        "That house has a sloping roof.",
        "His house has a flat roof.",
        "On the right, there are two windows looking out on the garden.",
        "The room has a large window on the left.",
        "At right, front, there is a swinging door leading to the sitting room.",
        "A door on the left leads to the stairs.",
        "This room to the left is a bedroom.",
        "In the rear, there’s a door to the dining room.",
        "A door on the left leads into a long corridor.",
        "The house faces the main road.",
        "That house has three big bedrooms and one small one.",
        "The floor is of white tiles.",
        "The room opens at the back upon a wide porch.",
        "This room is a little small, but there is room for a bed and a table.",
        "From the corridor, doors open to three bedrooms.",
        "In the middle of the left wall, there’s a window.",
        "The living room is fairly large.",
        "The back door opens into a verandah.",
        "There is a window on the right, looking out on the street.",
        "Her flat is on the third floor.",
        "The downstairs bedroom is fairly large.",
        "There’s a bathroom at the end of the corridor.",
        "He lives in a two-storey-house.",
        "That’s a big house with a glass porch.",
        "You have good cross-ventilation.",
        "There’s a door on the right leading into the backyard.",
        "There are two windows to the left of the main door.",
        "On the left, there’s a doorway leading into a large bedroom.",
        "This is the kitchen.",
        "The living room walls are papered with wallpaper having a beautiful design.",
        "It’s a big house. It has seven rooms.",
        "There’s a door leading out on to a balcony.",
        "His bedroom is on the first floor.",
        "In the rear wall, right, is the stairway to the upstairs rooms.",
        "This is the bathroom to the right.",
        "The doors are painted white.",
        "On the right, at the end of the room, there’s a small door leading to the bathroom.",
        "His house is a single-storey-building.",
        "His house has two double bedrooms.",
        "Next to the kitchen, there’s a pantry.",
        "The walls of all the bedrooms are tiled.",
        "There’s a lift, so you won’t get tired of climbing stairs.",
        "Beyond the living room, you have the dining room.",
        "A medium-priced carpet covers the floor.",
        "You can see the sea from the balcony.",
        "This is another bedroom. It’s a fairly good size, and you have windows on two sides.",
        "In the rear wall, there is a doorway leading into the dining hall.",
        "You have three bedrooms, don’t you?",
        "That’s a five-storeyed block of flats.",
        "On the wall, left, there’s a photograph.",
        "The rooms are spacious and well-proportioned.",
        "The kitchen is a fullsized one.",
        "A staircase goes up from the dining room.",
        "He lives in a flat of a better sort.",
        "That’s an old brick house with a tiled roof.",
        "Part of the house is used as his office.",
        "She lives in a ground-floor flat.",
        "The walls are papered in a red and green design.",
        "From there, you have a good view of the river.",
        "There are two bedrooms on the ground floor.",
        "There’s plenty of room for a small family here."
    ],
    "53. Asking about sb’s description ": [
        "What sort of build is he?",
        "Could you describe him for me?",
        "What’s your brother like?",
        "How does she dress?",
        "Is he good-looking?",
        "Does she have a good complexion?",
        "What does Tina look like?",
        "Does he walk with a stoop?",
        "Does he walk with a bad limp?",
        "What colour is her sari?",
        "How was she dressed?",
        "Does she have long hair?",
        "How tall is she?",
        "Tell me what she looks like.",
        "How old is he?"
    ],
    "54. Directing sb to a place ": [
        "This road goes straight to Andheri. It’s about 5 miles.",
        "His shop is over there on the left, next to the book shop.",
        "It’s on the other side of the road.",
        "Stay on this road for a kilometre, then turn right.",
        "That’s Augustus Road.",
        "This office is quite easy to find.",
        "It’s just opposite the post office over there.",
        "Walk down this road as far as the Post Office, and turn left into Convent Road.",
        "Our house is the third on the left.",
        "Go down here, and it’s the second on the right.",
        "It’s near the Jewellery Junction.",
        "Take the Rajaji Road, and turn right at the first roundabout.",
        "Follow the road round to the left, and you’ll see the book shop on the right.",
        "When you reach the supermarket, turn sharp left.",
        "The first turning on the right is Park Lane.",
        "Take the first turning to the left after passing the police station.",
        "The road you want is called College Road.",
        "You should take the first right after the cross-roads.",
        "It’s an old building somewhere along the road. Turn right there on to the main road.",
        "Turn right off the main road.",
        "Don’t turn off there — stay on this road for two kilometres.",
        "Get off the bus when you see a great big building.",
        "Then turn left, got it?",
        "Go east along that road as far as the Police Station. Then turn left.",
        "When you’ve got to the Baker’s Junction, turn right.",
        "It’s about a mile past the church.",
        "Carry straight on as far as the cross-roads with the traffic lights.",
        "Follow this road until you come to the traffic lights.",
        "When you come to the police station, turn left. Then you’ll be in Brigade Road.",
        "The road turns off for Ooty there.",
        "When you’ve passed the traffic lights, come to the next junction.",
        "This place is a bit further down at the end of the road.",
        "It’s the tallest building in the road, so it’s easy to find.",
        "His office is straight down the hall, the fourth room to the right.",
        "At the second cross-roads, you turn left and go as far as the Town Hall.",
        "It’s not very far, actually.",
        "Turn left at the end of the street. Then you’ll be in Bakshi Road.",
        "Turn right at the cross-roads, understand?",
        "It’s a good two miles to the station.",
        "It’s on the way to the church.",
        "Indira Nagar is north of Balaji Nagar.",
        "Turn right outside this building, and walk to the end of the road, and it’s on the right, next to the garage.",
        "It’s a few yards up on the left.",
        "Go down that turning there, and you’ll see his office on the left.",
        "Keep straight on until you come to the third cross-roads.",
        "Take the No.10 bus.",
        "Go down the road till you come to the post office.",
        "When you get to the Penta Complex, turn left.",
        "You’re quite welcome to come with me. I can show you exactly where it is.",
        "Cross the bridge and take the second turning on the right.",
        "Take bus no.10 to Jhansi Street. It’s only three stops from here.",
        "Take the second left after the Post Office, do you understand?",
        "It’s over there in the corner.",
        "You can’t miss it, there’s a drugstore on the corner.",
        "It should take you about 10 minutes to get there.",
        "It’s a bit further on the left.",
        "It’s just over a mile from here.",
        "Get off the bus at the roundabout.",
        "It’s at the junction of Bank Road and Town Hall Road.",
        "It’s quite a way. I’d take a bus if I were you.",
        "Cross that road, then go on down the footpath till you come to the traffic lights.",
        "It must be along here somewhere.",
        "This road joins the main road at the Hospital Junction. Turn left there.",
        "Go straight ahead for a kilometre — don’t turn off the footpath till you come to the traffic lights."
    ],
    "55. Expressing disappointment ": [
        "Oh no, what a shame!",
        "That’s a pity.",
        "How disappointing!",
        "I had hoped that I’d be able to meet him.",
        "Oh, dear! What fools we were!",
        "It was an absolute waste of money.",
        "It’s a great shame.",
        "I was so looking forward to meeting them.",
        "I’d so hoped that I’d get selected this time.",
        "Things always go wrong.",
        "It’s a little bit disappointing, isn’t it?",
        "Oh, no!",
        "Oh, that’s a nuisance!",
        "It’s very upsetting that this has happened.",
        "Oh, damn!",
        "Oh dear! I’ve spilt the milk.",
        "Oh well, never mind.",
        "That’s a great pity.",
        "Oh no, what a letdown!",
        "Oh, it was all unnecessary.",
        "If only I had known!",
        "It’s just my hard luck that he changed his mind at the last minute.",
        "Oh, I was so looking forward to meeting him.",
        "It wasn’t as good as I thought it was going to be.",
        "I’m sorry to hear that.",
        "Oh no, that’s the second time!",
        "It’s most unfortunate.",
        "What’s the point of giving a party now?",
        "I wish that someone had let me know.",
        "I’ve never been so disappointed in my life.",
        "Oh well, it can’t be helped, I suppose.",
        "But what good will it do?",
        "I’m very sorry to hear that.",
        "It meant so much to me.",
        "I’m disappointed in him. I thought he could do better",
        "Unfortunately, I couldn’t reach there in time.",
        "When I think of it!",
        "Well, there’s nothing we can do about it, I suppose.",
        "Oh, no! Not again!"
    ],
    "56. Expressing doubt ": [
        "(See also Fn.no.34 Expressing uncertainty and Fn.no.75 Expressing indecision).",
        "I’m not sure.",
        "I’m not certain.",
        "Oh, I don’t know.",
        "I think he’s the man, but I can’t be certain.",
        "I find this hard to believe.",
        "That means he didn’t actually meet her?",
        "He may call on us on his way there.",
        "Why was that, then?",
        "That can’t be true.",
        "That seems unlikely, you know.",
        "Surely, you could have explained it to him?",
        "I’m not sure whether he’s telling the truth.",
        "You did hear him say that, didn’t you?",
        "Perhaps.",
        "It’s not clear to me why he did such a thing.",
        "Are you absolutely sure he has left?",
        "I doubt if he’ll reach there in time.",
        "That’s odd. I thought they were supposed to be good at it.",
        "It’s a bit odd that he hasn’t written to us so far.",
        "Why did he close the door?",
        "I wonder.",
        "Come off it!",
        "This can’t be the shop.",
        "You did see him there, didn’t you?",
        "That’s difficult to believe.",
        "You couldn’t have given it to anyone?",
        "Perhaps he’ll come — I’m not sure.",
        "Maybe, she was waiting for us.",
        "I can’t believe that.",
        "You’re joking.",
        "I don’t understand why he didn’t speak to her.",
        "Go on with you!",
        "You must be dreaming.",
        "I wonder if that’s right.",
        "I suppose it’s all right to wear this dress.",
        "I doubt whether she knew.",
        "Could you not have given it to her?",
        "Are you sure of that?",
        "I don’t see that it makes much difference, do you?",
        "It sounded like her.",
        "Are you telling me he isn’t going to come?",
        "I doubt if we shall get there by"
    ],
    "10. ": [
        "That seems a bit strange.",
        "What was the reason?",
        "Is it really size 38?",
        "Amith? You must have got the wrong name.",
        "I can’t believe there’s any truth in that.",
        "Are you sure that’s true?",
        "That’s strange. I never received it.",
        "How do you mean?",
        "I doubt him. I don’t think he’s telling the truth."
    ],
    "57. Making friendly enquiries ": [
        "Where have you been lately?",
        "What are you doing these days?",
        "How are you getting on at work?",
        "How’s the family?",
        "Has your headache gone yet?",
        "I haven’t seen you for quite a while.",
        "How are you settling down in the new place?",
        "What have you been doing since we last met? I see you’ve got a new scooter...",
        "How are you enjoying your new job?",
        "I hear you’ve got a new car.",
        "Is Julia all right?",
        "Do you cook your meals yourself?",
        "Did you have a good flight?",
        "Do you have any idea what happened to Jack?",
        "How was Goa?",
        "How are you getting along these days?",
        "Have you got any children?",
        "How’s your business going, Ajai?",
        "What is your new job like?",
        "I’m a ‘Gemini’. What sign are you? ‘Virgo’?",
        "Tell me about your work.",
        "How is he getting on at school?",
        "You live in the city or on the outskirts?",
        "Where has Tina been this past week?",
        "What are you studying there?",
        "I heard Veena’s father is laid up in bed.",
        "Did you have a good outing?",
        "I heard your mother had been ill quite recently. How’s she now?",
        "How long have you been living there?",
        "What’s your brother doing nowadays?",
        "How are you finding life as a nurse?",
        "How are you enjoying your stay in Bangalore?",
        "Did you have a nice journey?",
        "I hear Susan has had a baby...",
        "What’s in that bag?",
        "I thought you were in Baroda.",
        "Tell me what you’ve done.",
        "Do you play any sports?",
        "Where did you buy this sari?",
        "Did you have a good time in Kochi?",
        "How are your parents?",
        "Did everything go off all right?",
        "Neetha speaks about you often.",
        "How are you settling down at your new job?",
        "Did you enjoy the film?",
        "I understand Praveen has gone abroad again?",
        "Do you like your new place?",
        "It’s a town, isn’t it?",
        "What’s new?",
        "Are you going to make a career in teaching?",
        "Whereabouts do you live?",
        "What’s Pune like as a place?",
        "I haven’t seen your father for a long time. How is he?",
        "Have you gained some weight, Harry?",
        "What exactly does your new job involve?",
        "What do you do, Mr. Barua? Are you in the textile business?",
        "I hope all is well with you.",
        "Where was it you went to school?",
        "What’s Suman doing now?",
        "What does his work consist of exactly?",
        "What sort of holiday did you have?"
    ],
    "58. Expressing fear ": [
        "(See Fn.no.173 Expressing worry or fear)."
    ],
    "59. Forgiving sb ": [
        "(See also Fn.no.18 Accepting an apology).",
        "It doesn’t matter.",
        "It’s OK, but don’t do it again, will you?",
        "All is forgiven.",
        "It’s quite all right.",
        "I do wish you’ll be more careful. Don’t worry about it.",
        "It’s all right.",
        "Well, all right. Everybody makes mistakes sometimes.",
        "It doesn’t matter at all.",
        "Never mind."
    ],
    "60. Saying good-bye ": [
        "(See Fn.no.88 Taking leave of sb)."
    ],
    "61. Expressing gratitude ": [
        "(See also Fn.no.163 Responding to thanks).",
        "Many thanks.",
        "It was terribly kind of you.",
        "That’s very kind of you.",
        "Thank you.",
        "Thank you for inviting us.",
        "It was very kind of you to help us.",
        "Thank you for everything.",
        "Thanks for a great lunch.",
        "You’ve been a great help, thank you very much.",
        "It’s good of you to say so.",
        "Thanks a lot.",
        "You’ve been so kind.",
        "It was nice of you to arrange everything on such short notice.",
        "I’m very grateful to you.",
        "Thanks for a really lovely meal!",
        "A present! Oh, you shouldn’t have bothered.",
        "You’ve been most helpful.",
        "Thank you for a wonderful party.",
        "It was very nice of you to come.",
        "Thank you for coming so quickly.",
        "I can’t tell you how grateful I am.",
        "Thank you. It’s just what I wanted.",
        "Thanks for a marvellous time.",
        "I don’t know how to thank you.",
        "I can’t thank you enough.",
        "Thank you very much.",
        "We’re most grateful to you.",
        "Thank you for an entertaining evening.",
        "Thanks very much.",
        "I don’t know how I can thank you enough!",
        "You’ve been most kind.",
        "Thanks for giving such a good time.",
        "Thank you very much indeed.",
        "How can I thank you enough?",
        "It was very thoughtful of you. Thank you.",
        "That’s really great of you."
    ],
    "62. Greeting people you already know ": [
        "(See also Fn.no.82 Introducing people and responding to introductions).",
        "Hello there!",
        "Hello, Sandra!",
        "Hi!",
        "Hello, Tom. How are you?",
        "How’s everything?",
        "Jacob! How nice to see you!",
        "Look who’s here.",
        "Hi, how’s things?",
        "What a nice surprise!",
        "Dolly! How nice to see you again!",
        "Hi, Geetha! I haven’t seen you for quite a while.",
        "Sharma! It’s months since I saw you!",
        "How’s it going?",
        "Kiran! I haven’t seen you for ages.",
        "Hi, Manu! What are you doing here?",
        "Hello, Anil! Where have you been lately?",
        "Fancy meeting you here!",
        "Ravi! Nice to see you again!"
    ]
}