{
    "key": [
        "Add up these figures, will you? (= find the sum of ).",
        "He’s looking for another job. That’s what it all adds up to (= means or indicates).",
        "My expenses add up to Rs. 950 (= amount to a total of).",
        "Why did he shout at them like that? His behaviour just doesn’t add up (= doesn’t make sense).",
        "He asked her out, and she went with him to the cinema (= invited her out).",
        "I’m going to oppose the decision. You’ll back me up, won’t you? (= support).",
        "Ask the driver to back the car up a bit.",
        "He backed up the car to the gate.",
        "Yes, I heard what he said. But the facts don’t bear him out (= don’t support or confirm).",
        "I wonder how he’s able to bear up against difficulties so well (= remain strong against).",
        "We bargained with them and managed to beat them/the price down to Rs. 5,000. His asking price was Rs. 6500, you know.",
        "The door was found locked from inside, and so they beat it down and got into the room. (= broke it down, by hitting it hard).",
        "I don’t know how, but the old lady managed to beat off the thugs who attacked her. (= fight and drive away).",
        "Some hooligans beat him up last night and left him for dead (= hurt him severely).",
        "He has a bad cold and his nose is all blocked up.",
        "The pipe/drain/gutter/was blocked up by mud/dead leaves/ twigs/hair.",
        "One of the tyres blew out on the way and had to be changed (= burst).",
        "He blew out the candle/lamp/match, and the room became dark again.",
        "It took some time for him to blow up the tyres. (= inflate).",
        "The terrorists were planning to blow up the factory (= to destroy it using explosives).",
        "(infml) He blew up the difficulties to get her sympathy (= exaggerated).",
        "I heard the bomb blow up (= explode).",
        "This time, their quarrel blew up over some silly things (= arose).",
        "(infml) If he’s kept waiting, he’ll blow up (= lose his temper).",
        "(infml) His boss will blow him up if he’s late (= be very angry with him and scold him severely).",
        "Sorry I’m late. My car broke down on the way (= stopped working because of a fault).",
        "We lost our trust in them and soon our relations broke down (= became difficult and collapsed).",
        "They told her about his death, and she broke down (= lost her self-control and collapsed, crying).",
        "He was down under a severe strain, and his health has broken down (= collapsed).",
        "Can you break down the cost under various heads (= analyze it under).",
        "You won’t be able to rescue those people if you don’t break down these doors/windows/walls/building (= strike them hard and knock them down).",
        "If you don’t open the door, I’ll break it down (= force it open).",
        "Nothing can break down her determination.",
        "The handle has broken off. What to do now?",
        "They broke off for some time and went out for a breath of fresh air (= stopped doing what they were doing).",
        "She broke off in the middle of a sentence and looked at her watch (= stopped talking).",
        "He has broken off all his business relations with them (= ended).",
        "He broke a branch off the tree.",
        "I think a fire has broken out there (= start suddenly).",
        "The rioting/fighting broke out when everybody least expected it (= start suddenly and violently).",
        "You want to get ahead in your career, don’t you? Then you’ll have to break out of these prejudices (= free yourself from).",
        "Somehow or other I want to break out of this routine/the 9 to 5 rut (= change it; escape from it).",
        "The meeting went on for two hours, and it broke up only after 5 o’clock. (= came to an end).",
        "They started fighting again, and the meeting/party/gathering broke up. (= dispersed).",
        "Can’t you stay away from them? Why do you want to break up their family life/marriage/friendship?",
        "They broke up the car into scrap.",
        "He hasn’t got married to anyone else after he broke up with his wife. (= ended his relationship with).",
        "There was a quarrel about something and he has now broken with Sunil. (= ended his friendship with).",
        "How can you ever break with tradition in matters like these? (= end your connection with).",
        "The new government may bring about a lot of changes in the administration.",
        "That song brought back memories of my childhood. (= reminded me of my childhood).",
        "That story brought back my childhood horrors.",
        "(infml) I know this is not an easy task. But you’ll bring it off, I’m sure (= succeed in doing it).",
        "You take too much sugar. It may bring on diabetes.",
        "He’s too shy with women. You’ll have to bring him out (= help him lose his shyness).",
        "Jobs like these are really tough. I know. But, you see, they bring out the best in you — or the worst (= Produce and cause others to know).",
        "Their TVs are really good. They’re bringing out a new model in a few months, I hear. (= producing).",
        "He didn’t agree at first. But they managed to bring him round.",
        "She fainted from the pain and nobody knew how to bring her round (= to help her get back consciousness).",
        "He didn’t agree at first, but she managed to bring him round somehow (= persuade him to agree).",
        "Do you think it’s an easy thing to bring up children nowadays? (= raise, rear).",
        "She brought up everything she had eaten (= vomit).",
        "(infml) I’ll have to brush up (on) my grammar a bit. There’s going to be a test next week (= revise or practice for a test).",
        "She kept on telling me about him. I had an idea that she was building him up too much (= praising him too much, perhaps in a way that he doesn’t deserve to be praised).",
        "They’re planning to build up the entire area. (= put up buildings in).",
        "I have an idea he’s trying to build up newspaper publicity.",
        "He built up this business/wealth all by himself (= develop gradually and steadily).",
        "He doesn’t need medicines any more. Give him good food. That’ll soon build him up (= help him regain his health and normal weight).",
        "A lot of tension builds up at work, and when you get back home, you’re not in the best of moods. (= develops; increases in intensity/amount).",
        "(infml) Don’t butt in while I’m talking. (= interrupt/ interfere).",
        "Buy up all the vegetables they have (= buy all of the vegetables).",
        "The police had to be called in to stop the fight. (= asked to come and help).",
        "The bank has called in the loan. (= asked us to pay it back).",
        "Call off the dogs, will you? (= stop, recall).",
        "Her birthday party has been called off (= cancelled).",
        "This is not the time or place to carry on a conversation/ talk/discussion.",
        "(infml) They kept carrying on about some silly things. (= arguing and quarrelling loudly).",
        "He saw me coming, but he just sat there and carried on playing chess. (= continue).",
        "He carries on some kind of a business there. (= is going on with/busy with).",
        "They’ve been carrying on a survey of the region. (= conducting).",
        "(infml) He’s carrying on with his neighbour’s wife. (= having an affair with).",
        "Carry on working.",
        "Do you believe that he’ll carry out these promises/threats? (= fulfil).",
        "The doctor wants to carry out some more tests. He’ll only give his opinion after that. (= perform).",
        "(infml) That was a new idea/fashion and it caught on. (= become popular).",
        "He made some gestures, but I didn’t catch on. (= understand).",
        "(infml) They broke in and cleaned me out of all the cash I had (= take away all my cash).",
        "Come on! Let’s clean out the kitchen (= clean by removing all the dirt away).",
        "Clean out this tin, will you? (= clean by removing the dirt from the inside of).",
        "(infml) Clear off! This is private property (= go away, leave this place).",
        "I want to clear off the debts first (= complete the payment of).",
        "The infection/rash took about a month to clear up.",
        "The weather will clear up now. (= become fine).",
        "I went through the report once again, and things began to clear up. (= become more understandable).",
        "I want to clear up a misunderstanding (= remove or settle it).",
        "Has the mystery been cleared up? (= solved).",
        "I was clearing up the rubbish (= removing the rubbish and making things tidy or orderly).",
        "If things go on like this, the factory will have to close down (= stop production, permanently or for a time).",
        "When the news came, all the schools closed down for a day (= stopped working).",
        "The police closed in around the robbers. (= advanced on them, especially from all sides).",
        "Fog closed in on the city/ airport. (= surrounded).",
        "The bank closed (up) at 2. (= was open to the public till).",
        "Within a week, the wound began to close (up).",
        "Lots of unconnected thoughts cluttered up his mind/head. (= to cover or fill a space or room with too many things, so that it looks very untidy).",
        "If you want to buy it, buy it now. Prices aren’t going to come down (= fall).",
        "We were about to leave, and the rain started coming down. (= falling).",
        "The ceiling came down all of a sudden (= collapsed).",
        "These traditions/ customs have come down to us from ancient times/from our forefathers/through the centuries/over several generations. (= passed on).",
        "The door handle came right off in my hand.",
        "(infml) A chess tournament is going to come off in Madras next month. (= take place).",
        "When do you think will the marriage/party come off? (= take place)",
        "(infml) I think his scheme has come off. (= become successful).",
        "How was the game? How did your team come off? (= fare)",
        "Our party came off best in the recent general election. (= was in the best position).",
        "Don’t argue with those people — you’ll come off worst. (= be in the worst position).",
        "(infml) Oh, come off it! You must be joking (= don’t try to fool me; that’s nonsense).",
        "A button has come off your shirt.",
        "He came off well/badly during the interview.",
        "In a few weeks, winter will be coming on. (= arriving).",
        "The rain came on all of a sudden.",
        "“I don’t want to go” ~ “Come on, don’t be silly. You’ll have to go.”",
        "Come on/ along, now, try again. I’m sure you’ll be able to do it.",
        "I think I’ve got a fever coming on (= I feel the beginning of).",
        "I think winter is coming on (= beginning to be noticeable).",
        "When is that programme coming on? [= going to be shown (on the TV)].",
        "This film — where’s it coming on? At the Odeon? (= going to be shown).",
        "You leave now. I’ll come on later (= follow).",
        "The red light came on, and it meant that the voltage had dropped.",
        "Come along, or you’ll miss your bus (= hurry up).",
        "When’s your new book/novel going to come out. (= be published).",
        "A new brand of toothpaste has come out. (= appeared in the shops).",
        "She has come out top (= been placed at the top in the exam/test).",
        "You’ve come out very well in both the photos. (= been reproduced well).",
        "Have the results come out? (= been announced).",
        "The sky cleared and the sun came out.",
        "One day the truth/what really happened/the real reason will come out. (= become known).",
        "Whatever you do, this stain won’t come out (of the shirt) (= disappear, be removed).",
        "The Christmas holidays will soon come round. (= occur again).",
        "She fainted and didn’t come round for some time. (= recover consciousness).",
        "I hate such hot weather. If only it cooled down a bit.",
        "They/their tempers haven’t cooled down yet. (= become calm).",
        "He blew on his tea to cool it down.",
        "I’ll drink it later — let it cool down a little.",
        "She put the child to bed and covered him (up) with a blanket.",
        "Cover the food (up) with a plate or something.",
        "(infml) She was trying to cover up her emotion (= hide).",
        "He knew his friends were guilty. But still he decided to cover up for them. (= to keep what they had done secret).",
        "(infml) We don’t know when problems are going to crop up (= happen, occur).",
        "Let me know if anything crops up (= occur unexpectedly).",
        "I’m not satisfied with the report I’ve prepared. You see, I didn’t have much time, and I had to dash it off.",
        "The fire/storm has died down (= became less strong — but some of it was still there).",
        "The police were looking for him, and he decided to go into hiding until the search had died down.",
        "Where did you dig up that dreadful story?",
        "Dig up some worms — we’ll go fishing.",
        "(slang) The gangsters decided to do him in. (= kill him).",
        "I dozed off in the car and the driver didn’t wake me up till we reached there. (= fell into a light sleep)",
        "She drew him aside and told him something in his ear.",
        "He drew (out) some more money from his account/bank today.",
        "The train was drawing out (of the station) and she came running in.",
        "He drew out Rs.5000 from the bank/ his bank account yesterday.",
        "(infml) She was very shy and I wondered how I’d be able to draw her out. [= make her feel less shy and reserved (so that she’d talk freely)].",
        "He drew his handkerchief out of his pocket.",
        "Draw up the chair and sit down, will you? (= bring it near).",
        "A car drew up and the driver got out. (= came and stopped).",
        "When he took up this project, he had no past experience to draw upon. (= make use of).",
        "We discussed several ideas and suggestions, and the boss asked me to draw up a paper assessing them. (= prepare).",
        "Aren’t you dressing up? Didn’t I tell you about the dinner party? (= putting on formal or smart clothes).",
        "(infml) He has this bad habit of dressing up his reports with high sounding words. (= trying to make them impressive by using).",
        "(infml) When you visit Bombay next, you should drop in and visit us.",
        "(infml) Their business seems to be dropping off (= slackening).",
        "The demand for their new product has dropped off (= become less).",
        "(infml) I dropped her (off) in front of her house (= took her there in my vehicle and allowed her to get out).",
        "I dropped off for some time and I woke up with a start (= fell into A light sleep).",
        "He dropped out of school/college/university and started doing odd jobs (= stop going to school, etc. permanently).",
        "Why did he drop out of the club? (= withdraw from).",
        "The pressure has eased off a bit. (= become less severe or intense).",
        "I think you should ease up on him. Don’t make him work so hard — he’s just a beginner, mind you. (= treat him less severely).",
        "She egged me on to buy it from the black-market (= urged me to).",
        "They ended up offering him more money.",
        "He started talking in a tough way and ended up apologizing (= ended talking by).",
        "We ended up by having a cup of black coffee each (= end an activity by).",
        "He ended up in prison (= was finally in).",
        "He ended up as their General Manager (= finally became).",
        "They ended up the lunch with fruit salad (= finished it by having).",
        "Their meetings usually end up with prayer (= come to an end).",
        "The service at that restaurant has fallen off. (= become worse).",
        "His income has fallen off. (= become less).",
        "He couldn’t get on the horse — he kept falling off.",
        "It’s not in the bag — it must have fallen out.",
        "Her child’s teeth are starting to fall out.",
        "(infml) Things fell out the way we had expected. (= happened).",
        "(infml) Let’s not fall out with them over a silly thing like this. (= quarrel with).",
        "Look, his wallet fell out of his pocket.",
        "(infml) All our plans have fallen through. (= failed; came to nothing).",
        "He was ill in bed, and so his wife filled in for him at the shop. (= took his place).",
        "Have you filled in your name and address on the form/slip?",
        "(infml) Can you fill me in on the rumours/the gossip/the details/the scandal? (= give me more/all the information on).",
        "I only have a general idea. Fill me in on the details.",
        "I only know what happened today. Fill me in with a little background.",
        "The receptionist gave me a slip to fill out.",
        "Those cutlets filled me up.",
        "Take the car to the petrol station, and fill it up with petrol.",
        "Let’s fill up the tank full.",
        "The police found him out before he could blow up the bridge. (= came to know about his dishonest/criminal activities).",
        "Why do you want to find out about things that do not concern you? (= learn about/of...).",
        "You haven’t finished it yet. Don’t let the boss find out (= discover it).",
        "Have your parents found out?",
        "Finish (off) the pudding/stew/porridge — it won’t keep. (= eat it completely).",
        "Let’s paint one more door and finish (off/up) the paint. (= use it completely).",
        "(infml) Digging the garden — it has really finished me off. (= tired me out).",
        "(infml) The terrorists have threatened to finish him off. (= kill him).",
        "I want to finish (off) this job/report/ homework today itself. (= complete).",
        "Can you fit one more person in that car? (= find a place for).",
        "Don’t try and fit any more chairs/furniture into that room/hall.",
        "Can you fit this box in (/into the boot of the car)? (= find space or room for).",
        "His story doesn’t fit in with the facts. (= match, suit).",
        "They’ve fixed the meeting (up) for Monday/the 10th/ tomorrow.",
        "Have they fixed (up) where to go for the picnic?",
        "(infml) Can you fix this watch (up)? It has stopped. (= repair it).",
        "Before we move into that house, we want to fix it up. (= repair/redecorate it).",
        "She’s in the other room fixing her hair. (= making it look attractive).",
        "He can’t get about much. His leg has been in plaster for about a month, you know (= move, walk or go from place to place).",
        "News got about that the Chairman was thinking of resigning (= spread, circulated).",
        "Women find it difficult to get ahead in politics. (= advance; progress).",
        "She got the wet clothes off. (= took them off).",
        "It’s/Time’s getting on. Let’s start. (= It’s getting late).",
        "I’m getting on (in years). I’m turning 65 this September, you know. (= growing old).",
        "The bus/train stopped, and she got on. (= got into/onto it).",
        "He got on his bike and rode off down the road.",
        "Get your shirt/dress/coat/gloves on. (= put it on).",
        "I got on to him in the evening and gave him the information he wanted.",
        "If you keep coming to work late like this, the boss is sure to get on to you. (= find it out).",
        "Let’s now get on to another topic. (= begin discussing it).",
        "We got talking, and somehow got on to children. (= began talking about the topic of... ).",
        "Get on with it — we haven’t got all day. (= hurry up).",
        "He’s getting along well at school, I believe. (= making progress).",
        "How did she get on at the interview? (= perform).",
        "Stop talking, and get on with the work. (= continue doing).",
        "He’s thinking of leaving the job, because he can’t get on with the new boss. (= is not able to have a good relationship with).",
        "I can’t get on/along without a washing machine. There’s so much washing to do every day. (= cope/manage).",
        "I wonder how he gets through so much work in a day. (= manages to do).",
        "I got through the novel last night. (= managed to read).",
        "She couldn’t get through the exam/test. (= pass it).",
        "I think our message hasn’t got through yet. (= reached the destination).",
        "Can you get this packet through to him by tomorrow morning? (= see that it reaches him).",
        "(infml) By the look on his face, I knew I hadn’t got through to him. (= made him understand/believe what I meant).",
        "I can’t seem to get (it) through to him that this plan is impracticable and is not going to work. (= make him understand/believe...).",
        "I can’t get through. His line is engaged. (= make contact by telephone).",
        "Mom, I want to get up early tomorrow. Will you wake me? (= leave my bed).",
        "When the boss came in, all the staff got up. (= stood up).",
        "She’s got herself up beautifully. (= made herself beautiful, especially by dressing well).",
        "He got himself up as a beggar/a king for the fancy dress competition. (= dressed himself as... ).",
        "I have to get up two more lessons. (= study... ).",
        "(infml) They’re getting up a protest against the bus-fare hike. (= organizing).",
        "I don’t know what she’s going to get up to now. (= do... ; be busy with).",
        "You see that counter? That’s where you must give your building plan in. (= hand it over to somebody having the authority to receive it).",
        "I gave in to him. After all, he is my elder brother. (= yielded).",
        "What’s that black thing? It’s giving off a foul smell (= producing).",
        "These rotten oranges are giving off a bad smell.",
        "My patience gave out and I asked him to stop lecturing me. (= became used up).",
        "They’re giving out a notice or something. (= distributing).",
        "They didn’t give out the news until this afternoon. (= announce).",
        "I can’t solve this puzzle/problem — I give up. (= stop trying to solve it).",
        "Don’t expect them to give up without a fight. (= stop trying to win/achieve their aim).",
        "So far, I’ve been trying to please him, but now I’ve given it up (= stopped doing it).",
        "They gave up their car, and it has changed their life-style.",
        "He’s decided to give up his job. (= stop having it; resign).",
        "(infml) I don’t think his work will ever improve — I given up on him. (= stopped believing that he’ll be successful).",
        "I’ve given up smoking/ drinking altogether, you know. (= stopped).",
        "The hijacker gave himself up (to the police). (= stopped resisting and surrendered himself to).",
        "She’s given up that boyfriend of hers. (= stopped being friendly with).",
        "The terrorist gave up his accomplices when the police used force. (= stopped protecting their secrets and told the police where they were hiding).",
        "I waited for you for about an hour and then gave you up/gave up on you. (= took it that you wouldn’t come).",
        "The doctors had given up on me/ given me up, but I survived. (= took it that I wouldn’t get well).",
        "When did you give up politics/communism? (= stop believing in).",
        "I don’t think he’s completely given up hope yet. (= stopped having it).",
        "(infml) He’s given up the Communist Party. (= left).",
        "Don’t give up that right/claim. (= abandoned...).",
        "They’ve decided to go ahead with the plan.",
        "We’ve decided to go ahead with the project. (= continue carrying out...).",
        "The exhibition went ahead as planned. (= took place).",
        "The gun accidentally went off when he cleaned it, and killed his dog.",
        "The meeting went off without a hitch. (= proceeded ).",
        "The alarm-clock went off, and he woke up with a start. (= made a ringing noise).",
        "Slowly, the pain started going off. (= becoming less strong).",
        "When did the electricity go off? (= become unavailable).",
        "This milk has gone off — it smells funny. (= gone bad, become unfit to drink).",
        "When did you buy this meat? It has gone off. (= gone bad, become unfit to eat).",
        "The milk has gone off — don’t use it.",
        "He has gone off his girl friend. (= lost his liking for).",
        "We’re going right off the subject.",
        "As time goes on, things are bound to improve.",
        "The fire went on for about an hour before it was brought under control. (= continued to happen/take place).",
        "Do you want this system/ practice/these customs/rules to go on? (= continue to exist).",
        "Go on, ask him about it.",
        "The police would have arrested him by now if they had anything to go on. (= any grounds, information, etc. to base their action on).",
        "As the day went on, it became clear that they had no intention of calling off the strike immediately. (= passed).",
        "“When he saw that, he started shouting at us. And then, do you know what happened?” ~ “What happened? Go on”. (= continue talking).",
        "You go on to Maria’s place. I’ll go back to my hotel and check out of there and come and join you.",
        "(infml) Don’t go on at me like this. This is too much. [= criticize me repeatedly or complain about me (to others) repeatedly].",
        "All his salary goes on that girl. (= is spent on).",
        "Half of his pension goes on drinks.",
        "Let’s now go on to the next topic. (= go from here to).",
        "He showed us the pictures and went on to explain the techniques used in painting them.",
        "Don’t mind me. Go on with what you’re doing. (= continue).",
        "He grew up in Lucknow. (= became an adult).",
        "Our city/town grew up originally as a business centre. (= started to exist and develop).",
        "(infml) Oh, grow up and stop quarrelling/ fighting, you two! (= stop behaving in a silly/childish way).",
        "The judge handed down a stiff sentence on the main accused (= passed a sentence on a person found guilty of a crime).",
        "These jewels are valuable family heirlooms, and my grandfather handed them down to my father. [= gave it to my father before he (grandfather) died].",
        "These are traditions handed down to us over several generations. (= passed or transmitted from one generation to a later generation).",
        "Has he handed in his report yet? (= submitted).",
        "Ask him to hand in the tools before he leaves. (= surrender, after use).",
        "He was the chairman of the company, and he handed over to his daughter when he was past 70. (= gave control of the company or responsibility for running it).",
        "They handed over the thief to the police. (= deliver him).",
        "I handed over the office keys to my assistant. (= gave).",
        "Hand these sandwiches/biscuits/ cups round, will you?",
        "I saw him hanging about at the gate. (= waiting there doing nothing in particular).",
        "He helped me into/out of my coat. (= helped me put it on/ take it off).",
        "(infml) Oh, what a party it was! Now let’s help (mom) out with the washing up. (= help her do it, because it would be difficult for her to do it herself).",
        "I wanted some money urgently, and he was the only person who was willing to help (me) out. (= help me by giving me money).",
        "They gave us some money and helped us out of a difficult situation.",
        "She held back and didn’t tell him about it then. (= she hesitated to tell this to him because of fear, unwillingness or caution).",
        "Why did you hold back this information from the police? (= not give; refuse to give; delay giving).",
        "She could no longer hold back her tears.",
        "The meeting has been held over until the next weekend. (= postponed).",
        "The tent is held up by/with poles and ropes.",
        "She held up her hand to attract the speaker’s attention. (= raised it).",
        "I was held up by the traffic. (= delayed).",
        "The traffic was held up by the accident.",
        "Their workers have been on strike for a week now, and this has held up our production (= halted, delayed).",
        "I’m sorry I held you up. You see, my car broke down on the way. (= made you wait).",
        "His car was held up on his way to the airport, and he was attacked.",
        "Some masked men held them up on their way and took all their money. (= stopped and robbed them).",
        "I think this was the gang that held up a bank last month. (= robbed it by the threat of violence).",
        "When I saw the bus, I held up my hand, but it didn’t stop.",
        "I know they’ve suffered a heavy loss this time. But they’re trying to hush it up (= prevent it from becoming public knowledge).",
        "These are not serious difficulties. We can sit together and iron them out. (= remove them by discussion and compromise). Kk",
        "Don’t keep the news back from them. (= decide not to tell).",
        "Keep on until you reach the traffic lights; then turn left. (= continue going).",
        "(infml) Don’t keep on at them about the job — they’ll finish it on time. (= Don’t tell them/ask them about it again and again and annoy them).",
        "(infml) He kept (on) at me to help him get the job. (= continued pestering me).",
        "He kept (on) asking me questions.",
        "The rain kept up for the whole day. (= continued without changing).",
        "Their courage kept up throughout the crisis. (= remained at a high level; did not become smaller, lower or weaker).",
        "We couldn’t afford to keep up such a big house, and so we decided to sell it and move to a smaller one. [= keep it (neat, clean and in good repair) by spending money and energy; maintain it].",
        "(infml) The pain kept me up past midnight. (= prevented me from going to bed).",
        "I wanted to keep his spirits up. (= maintain; prevent the spirits from becoming weaker).",
        "You’re doing well. Keep up your efforts. (= maintain).",
        "If you don’t keep up the rent, they’ll throw you out. (= continue paying it in time).",
        "Dad was walking so fast that I really had to run to keep up with him. I was only a kid then, you know. (= to move at the same speed as).",
        "It’s five years since I retired. But I still keep up with some of my friends in the office. (= keep in touch with them through visits, phone calls, letters, etc.).",
        "If you want to be successful in this field, you must keep up with the latest developments. (= keep yourself informed about).",
        "The cost of living is going up day by day, but our salaries aren’t keeping up with it. (= rising at the same rate).",
        "The chicken curry they served him at the restaurant was too spicy, and he kicked up a fuss/row about it. (= he complained strongly to show that he was annoyed or dissatisfied).",
        "We can’t last out without food/water for very long. (= go on living; remain active).",
        "He laid his book/pen down and got up to answer the door.",
        "The Government has laid down new guidelines on health and safety in the workplace. (= officially announced them as a principle, rule, etc.).",
        "They laid on a bodyguard for him (= supplied).",
        "Tomorrow’s our wedding anniversary, and we’re planning to lay on a dinner party. (= organize).",
        "(infml) He laid out all his savings on the holiday (= spent)",
        "(infml) He laid out the street-plan/the map on the table. (= spread).",
        "I feel rather let down by their indifference.",
        "(infml) She hoped that he would support her, but he let her down. (= disappointed her, failed her).",
        "This dress looks too short for you. Why don’t you let it down a bit. (= lengthen it…).",
        "We let off a lot of fireworks for Diwali. (= explode).",
        "Was that policeman crazy or something? Otherwise, why did he let off the gun at the crowd? (= fire…).",
        "He has a bad cold, and so she let him off cleaning the windows. (= allow him not to do it).",
        "(infml) The magistrate took a lenient view, and let him off. (= released him and did not punish him).",
        "(infml) Don’t let on about our plans. (= reveal/disclose).",
        "Come on, let me out. Why have you locked me in? (= allow me to go from this place).",
        "(infml) My sister said she would go to the railway station and pick up my mother-in-law; that let me out. (= released me from an unpleasant obligation).",
        "This dress has become too tight — it’ll have to be let out round the waist. (= make it wider/looser).",
        "We’ve let out the first floor of our house as a flat. (= made it available for people to rent).",
        "We’ve let out the top floor of our house to them.",
        "(infml) He kept on working, and didn’t let up for an instant.(= relax making an effort).",
        "The rain hasn’t let up yet.(= slackened).",
        "Don’t be so strict/severe with your children — you should let up on them. (= be less strict/severe with them).",
        "Don’t forget to lock up after you. (= lock very securely when you leave).",
        "Look ahead 10 or 15 years. How do you think will this place look like then?",
        "(infml) The doctor looked him over. (= examined him carefully).",
        "They sent a surveyor to look over the house (= survey, inspect)",
        "Before hiring an advertising agency, you should look them up extensively.",
        "(infml) When I come to Dallas, I’ll look you up. (= find your house and visit you).",
        "Did you look him up thoroughly before you hired him?",
        "Go to the library and look up the June issue of the magazine.",
        "Can you look her phone number up in the telephone book?",
        "(infml) The weather is looking up (= getting better, improving).",
        "I didn’t know the word — so I looked it up in a dictionary (= searched for it, tried to find its meaning, pronunciation, etc.).",
        "He’s a man of absolute integrity, and we all look up to him.(= admire or respect him).",
        "I could see a figure in the distance, but I couldn’t make out who it was.",
        "(infml) How’s he making out in his new profession? (= progressing/prospering).",
        "I could just make out his face in the street light.",
        "He makes out that they were with him on that day. (= claim, maintain).",
        "There was somebody sitting on the floor, a little away from me. But I couldn’t make them out. It was quite dark in there, you know. (= manage to see).",
        "I couldn’t make out what you were saying. (= manage to hear).",
        "I can just make out those big letters on the top. (= manage to read).",
        "He makes himself out to be an expert. (= claims, maintains).",
        "She made out a cheque for Rs.50/- (= wrote and completed it).",
        "We can make a frock out of this cloth.",
        "They shook hands and made up. (= ended their quarrel).",
        "She’s not a good typist. But there’s something that makes up for that. She’s quite good-looking. (= compensates for; outweighs; she uses it as a suitable alternative for...).",
        "Is there any way I can make up for the damage I’ve caused? (= compensate for/ repay for).",
        "(infml) He’s trying to make up to the boss. (= make himself, pleasant to the boss in order to get something done or win favours).",
        "They’re bringing him here from the hospital. You’ll have to make up a bed for him at once. (= prepare a bed).",
        "She had made up a few sandwiches for us before we started. (= prepared them for our journey/outing).",
        "They make up medicines from the buds, leaves and other parts of herbs and plants. (= prepare medicines by mixing these ingredients together).",
        "How are you going to make up such a huge loss? (= replace, make good).",
        "They’re asking Rs.5000/- for it. I need Rs.1500/- to make up the money. (= to make the money complete).",
        "I’m sorry you’ll have to be on night duty today, but I’ll make it up to you. (= do something or give something to you to compensate you for what you suffer or miss).",
        "(infml) I missed out on the seminar. I was away on tour, you know. (= I couldn’t attend it, and so lost a chance to benefit from it).",
        "You missed out on all the fun. You should have come a bit early.",
        "Did you go through the list? I think we’ve missed out a few of the items from it (= failed or forgotten to include).",
        "Don’t mix up my papers/books. I’ve just put them in order.",
        "Don’t mix up the candidates (= put them in the wrong order or mix them together, so that it’s difficult to know who’s who).",
        "She’s always mixing me up with my sister (= confuses; is unable to tell me from my brother).",
        "(infml) I shouldn’t have done it. I own up (= confess or admit that I am to blame; confess fully).",
        "(infml) The engine packed up on the way, and we had to leave the car behind. (= stopped, failed).",
        "(infml) If you don’t like this job, you may as well pack up. (= leave it).",
        "The crisis/the storm/soon passed (away).",
        "He sat for the exam and passed out top with 580 marks out of 600.",
        "It’s not as easy as you think to patch up their quarrel. (= settle, end).",
        "(infml) If you don’t pay up, they’ll take you to court. [= pay them (in full) money that you’re under some obligation or pressure to pay].",
        "We had gone there after dark, but I could pick out his house easily.",
        "She could easily pick him out in the crowd. He’s quite tall, you know (= distinguish him from surrounding people).",
        "She had asked me to pick her up at the beauty parlour on my way back. (= collect, go and get).",
        "The police have picked up the main suspect, I hear. (= found and arrested, taken into custody).",
        "I picked him up outside the town hall and dropped him off in front of the Library. (= took him as a passenger, collect, gave a lift to).",
        "(infml) He liked a girl he saw at the Post Office. He picked her up. (= met her and made her acquaintance deliberately).",
        "He speaks French. He picked it up when he was with our Paris Office. (= learnt the language — casually and without any special study or systematic lessons).",
        "This shirt? I picked it up at a sale. I got it really cheap. (= bought it).",
        "At last, our sales are picking up! (= improving, recovering).",
        "Let’s pick up (from) where we left off. (= continue, start again).",
        "(infml) Doctor, is that patient picking up? (= improving, recovering).",
        "Where do you pick up these rumours? (= hear, get).",
        "In this job, I have to go around picking up bits of information, news, stories…",
        "(infml) He was just trying to play down his part in the decision. (= try to make it appear or treat it as less important than it really is).",
        "(infml) Keep those magazines away — the boss may pop in on his way out.",
        "It was those tablets that pulled him through. (= helped him recover from a serious illness or injury).",
        "She was afraid she’d fail the exam, but her tutor prepared her thoroughly and pulled her through. (= helped her avoid failing the exam).",
        "He has pulled through. They’re discharging him (from hospital) in a day or two. [= recovered (from a serious injury or illness) or survived a period of danger].",
        "He pulled himself up from the chair and walked to the door.",
        "He pulled the car up at a petrol station. (= stopped).",
        "Then a car pulled up at the corner and somebody got out. (= stopped).",
        "A car pulled up alongside (mine).",
        "I know the subject inside out. But I’m not good at putting myself across to others. (= communicate or explain things successfully).",
        "He puts off people when they come to see him at home. He wants them to meet him only at his office. (= discourages or prevents them from seeing).",
        "Don’t be put off by his behaviour. He’s really a good man at heart. (= be annoyed or offended by).",
        "He started behaving in a wild and uncontrolled way, and the pilot put him off the plane. (= compelled him to get off).",
        "Driver, can you put me off here? (= allow me to get off the bus or get out of the car).",
        "Can you turn the radio off? The sound is putting me off (my work). (= distracting or disturbing).",
        "(infml) The maths teacher seems to be a hopeless incompetent, and she’s too strict with students. She has put my son off maths. (= caused him to lose interest in, or liking for).",
        "The meeting has been put off until February. (= postponed).",
        "She saw him lying asleep on the floor and she put a blanket over him.",
        "We’ve put through a deal with an American company. (= completed).",
        "We didn’t have much money. Even so my father managed to put me through university. (= provided for me and made it possible for me to go to university and complete a course of study).",
        "They will put me up at their guest house. After all, I’ll be there only for a week. (= provide me with food and lodging).",
        "At the next election, let’s put a woman up for President. (= propose, nominate).",
        "When’s the election to the governing body? He’s putting (himself) up this time. (= offering himself as a candidate for the election).",
        "Can you put me up a snack or something? I’m feeling hungry. (= prepare and give me).",
        "We’ll have to put up some new kitchen shelves.",
        "They’re planning to put up a new bridge across the river. (= build).",
        "They’ve agreed to put up the capital for the new project. (= lend).",
        "They have put up the price again. At this price, we can’t afford to buy the car. (= increase, raised).",
        "My mother put up a picnic lunch for me, and I carried it in my shoulder bag. (= prepared and gave me).",
        "This is my first visit to Dallas. I’m planning to put up with a friend of mine. (= take food and lodging, stay).",
        "I’m sorry I played that dirty trick on you. You see, Sinha and Linda put me up to it. (= encouraged me to do it).",
        "How can you put up with living in such a dirty house?",
        "(infml) I can’t put up with him. He has too high an opinion of himself. (= tolerate, bear).",
        "I asked him if he had learnt the poem by heart, and he rattled it off flat out. (= said or repeated it quickly and without pausing to think).",
        "I want to read up a few more details before the discussion begins. Let’s go to the library. (= find out a few more details by reading).",
        "He’s more up-to-date than me. You see, he reads up on all the developments in our field. (= improves his knowledge of these developments by reading).",
        "(infml) I asked him who his close friends were, and he reeled off a dozen names. (= say or tell without pause or effort).",
        "(infml) I’m from a poor family and we have very little money. Everybody knows these things. But do you have to rub it in? (= remind me of it repeatedly).",
        "We can’t rule out a price revision, you know. (= dismiss, say that a price revision is impossible or cannot be considered).",
        "A lot of wax had run down from the candle.",
        "He looks run down. It must be the strain at work. (= exhausted and in poor condition, tired and weak).",
        "Run down to your uncle’s place in the car and fetch him, will you?",
        "The truck ran down a young girl, and she died on the spot. (= knock her to the ground).",
        "He’s always running down my job. (= criticizing and saying unkind things about, belittles).",
        "My boss runs me down for the slightest thing. (= criticizes me, and says unkind things about me; belittles me).",
        "The police ran him down in Bombay, and brought him back to Delhi. (= located him at last — after a long search).",
        "When did your driving licence run out? (= expire, become no longer valid).",
        "Our sugar has run out. Can you go out and buy some? (= finished, exhausted).",
        "We were running out of time on the programme, but the chief guest kept on speaking.",
        "The car has run out of oil.",
        "We’re running out of writing paper. You must go to the stationer’s today. (= our supply of it is coming to an end).",
        "(infml) He was run in last night, I don’t know what the charge is. (= arrested and taken to the police station).",
        "This is a new car, isn’t it? Don’t drive it too fast for some time. What you must do is, you must run it in. (= prepare its engine by driving it slowly and carefully, until it covers a certain distance).",
        "He’s the only person who’ll be able to see us through this bad patch. (= support us during; see us safely through).",
        "(infml) Don’t worry. We’ll see the thing through. (= continue what we’re doing and bring it to a successful or happy conclusion).",
        "They were standing in the way, and I couldn’t see through them.",
        "(infml) He couldn’t fool her. She saw through him. (= understood his true nature — which was different from the pleasant or deceptive appearance).",
        "That’s an opaque window. You can’t see through it.",
        "Then he set off for the office.",
        "The children set off for school.",
        "We set off early in the morning. (= began our journey).",
        "Don’t remind her about it. That’ll set her off crying again. ( = cause her to start).",
        "The slightest spark will set off the fireworks. So be careful. (= caused them to explode).",
        "There was some news that he was going to resign and this news set off a lot of rumours. (= caused a lot of rumours to begin).",
        "(infml) Nobody likes her, because she is always showing off. (= displaying or drawing attention to her own knowledge, ability, wealth, etc. — in order to impress people).",
        "She thinks her son is a child prodigy or something, and loves to show him off. [= display or draw people’s attention to him — because she feels (too) proud].",
        "How long can he keep on pretending? One of these days, he’ll show himself up for what he really is! (= reveal that he’s inferior, unpleasant, untrustworthy, unworthy, etc.).",
        "(infml) Look, Sandra, I never thought you’d behave like that and show me up in public. (= make me feel embarrassed by behaving badly in public).",
        "He hasn’t showed up at the office yet.",
        "(infml) We’re waiting for the chief guest. I don’t know when he’s going to show up. (= arrive, appear).",
        "You had better shut him up. Others are listening. (= make him stop talking).",
        "(infml) Oh, shut up, can’t you? (= stop talking; stop making a noise; be quiet).",
        "(infml) I’ve slipped up badly. I should have submitted our quotation today. Today was the last day, you know. (= made a careless mistake).",
        "If you have any objections, you must speak out.",
        "He hasn’t been speaking out publicly for fear of losing his job.",
        "Don’t be afraid to speak up. (= express your opinion, tell the truth, etc.).",
        "Speak up, will you? I can’t hear you.",
        "There’s a nail sticking out from the wall.",
        "Our workers are all right. But the union leaders are stirring them up, you see. (= exciting them to action).",
        "They’re not interested in football, you know. You’ll have to stir them up a bit. (= do something to get them interested in).",
        "(infml) He’s always stirring up trouble among the workers. (= provoking or causing trouble).",
        "She summed him up quickly as a coward. (= considered him, and formed a judgement or opinion of him).",
        "(infml) You know, accommodation is very difficult to find nowadays. Any way, I’ll ask my next-door neighbour if he would care to take you in. (= allow you to live in his house for payment).",
        "We take in photocopying, Our rates are quite reasonable, you know. (= accept this work for payment, and do it in our house).",
        "He took in the room and the things in it at a glance. (= saw and noticed).",
        "Look, I can’t take in a word of what you’re saying. Can you explain it in simpler language, please? (= take into the mind and understand).",
        "Don’t be taken in by these smooth salesmen. (= fooled; deceived).",
        "She takes sewing in, and makes money to live on. (= carried things to be sewn to her house and does the sewing there for payment).",
        "These trousers are too loose. Can you take them in a little at the waist? (= make them narrower in width).",
        "Cotton wool can take in moisture.",
        "He wanted to start his own business. But the idea never took off, and he decided instead to get into politics.",
        "Our business will take off in a year’s time.(= begin to improve).",
        "He jumped in the car, and the car took off down the street.",
        "I don’t know when the flight is going to take off. (= leave the ground).",
        "(infml) I couldn’t meet him. He took off for Bombay immediately after the meeting. (= left in a hurry).",
        "The plane took off when the fog lifted.",
        "The aeroplane crashed soon after taking off.",
        "He then took the handbrake off and drove off.",
        "He took the handle off the door. (= remove it or separate it from the door it’s attached to).",
        "Last night’s rain has taken most of the new whitewash off the compound walls. (= removed).",
        "Cut off 75% of the fat that you eat now. You’ll be able to take all the surplus weight off you in a few months. (= reduce your weight by the amount mentioned).",
        "I think this is the best time to buy fans. Most of the manufacturers have taken 3 to 5% off the prices. (= reduced the prices by that amount).",
        "You need rest. You have been ill, remember. You must take a few weeks off from work. (= have a break for this much time from work).",
        "He took his shirt off. (= removed it).",
        "(infml) He can take his boss off perfectly. (= imitate the boss — for amusement or to make him appear foolish).",
        "That plane is taking off for Delhi.",
        "I didn’t like the way he tried to take over the whole meeting.",
        "My secretary is taken ill. You’ll have to take over. (= take charge of her duties, responsibilities, etc.).",
        "I took over the company from my father. He retired last year. (= come into the management, control ownership, etc.).",
        "I want to talk the matter over with my wife before I make a decision. (= talk about it fully and seriously).",
        "(infml) I didn’t want to eat, but she talked me round. (= persuaded me to eat by talking to me — and by getting round my initial reluctance or opposition).",
        "I haven’t talked things over with him yet. Give me a ring later.",
        "The teacher told them off for talking in class.",
        "(infml) I was a bit late today, and the Office Manager told me off for it. (= scolded me; spoke angrily to me — saying that what I had done was wrong; criticized or blamed me).",
        "No, it’s not a bad offer, of course. But I need some time to think it over first. (= consider it carefully — before deciding or acting).",
        "He thought up a very convincing excuse on the spur of the moment. (= invented; created it in his mind).",
        "Somebody opened the window, and threw out a bucket of water.",
        "This electric heater throws out a lot of heat, doesn’t it? (= is the source of).",
        "He didn’t like my talking to his sister, and he threw out a warning to me. (= gave it in a casual or indirect way).",
        "Stop interrupting me when I’m trying to add up figures. You know, you may throw me out. (= cause me to make a mistake).",
        "They threw out my suggestion without even considering it. (= dismissed it; rejected it).",
        "(infml) He has been arrested. Somebody must have tipped off the police that he was hiding there. (= secretly informed or warned).",
        "(infml) Look at those marks and scratches. Touch them up with a bit of paint. (= improve the appearance of the surface by using paint).",
        "He said he could drive very well. So we thought of trying him out — before taking him on as our driver. (= testing his ability).",
        "Let’s try him out for a month. Let’s see if he’s well94 behaved and polite. (= test his character).",
        "Never buy a secondhand car without trying it out. (= testing it to see if it works well).",
        "The screening committee turned him down because he was under age. (= rejected him).",
        "The music is too loud — turn it down, will you?",
        "(infml) They found him to be corrupt and turned him out of his job. (= forced him to leave).",
        "The painting he bought turned out to be a fake.",
        "He turned out his briefcase, but he couldn’t find the bill. (= emptied it).",
        "It’s late — turn out the lights and go to bed. (= switch them off).",
        "Turn out that lamp. Oil is too costly nowadays, you know. (= cause it to stop burning).",
        "They turned down the suggestion.",
        "It was a great match. Hundreds of people turned out to watch it. (= came out or were present — in large numbers).",
        "I saw your son’s teacher today. She said he was turning out very well. (= progressing or developing — in the way mentioned).",
        "I’m not satisfied with the quality of the tables and chairs your carpenters turn out. (= produce; manufacture).",
        "This institute turns out about 25 fitters, 30 electricians and 20 plumbers every year. (= trains).",
        "Luckily, everything turned out right in the end.",
        "The information turned out to be false.",
        "His predictions turned out to be correct.",
        "His daughter turned to hate mathematics.",
        "Opportunities like this would only turn up once in a blue moon. (= happen; present themselves).",
        "I don’t know when the guests are going to turn up. I’ve been expecting them from this morning. (= arrive or appear).",
        "Our cashier has been missing for a few days now. He hasn’t turned up either at his house or anywhere else till now. (= been found).",
        "The clowns performed a few funny tricks and warmed up the audience before the circus began. (= made them lively and interested).",
        "This milk has gone cold. Can you warm it up, please? (= make it become warm).",
        "(infml) He started his speech with an anecdote — a very amusing one. And the audience warmed up. (= became lively).",
        "When the drug wore off, she suffered a reaction.",
        "(infml) The novelty for the new car soon wore off. (= disappeared).",
        "(infml) Long journeys really wear me out. (= make me very tired).",
        "I’ve worn my running shoes out. I’ve got to buy another pair. (= made it useless through long, constant or hard use or handling).",
        "Don’t buy cheap shoes. They wear out quickly. (= become useless from long, constant or hard use or handling).",
        "Look, my patience has begun to wear out. (= be used up completely).",
        "They haven’t been able to weigh up their new boss yet. It’s only a week since he’s taken charge of the office, you know. (= form an opinion about him).",
        "I was weighing up whether we must open our new office in Bombay or in Bangalore. (= considering alternatives, possibilities, etc. — before choosing one of them or making a decision).",
        "It was no easy matter to win them over to our side. (= to persuade them to agree with us — or to be on our side).",
        "Our branch in Bombay has been making big bosses for some time now. We’re thinking of winding it up. (= settle its affairs and close it).",
        "(infml) He summed up his main points and wound up his argument. (= brought it to an end; closed it).",
        "I can work this debt off in about 3 months time. (= repay it by working).",
        "(infml) Take some exercise regularly. That’ll help you work that extra fat off. (= get rid of it — by this form of activity).",
        "Sometimes he behaves in very strange ways. You know, I’ve never been able to work him out. (= understand him; make sense of him).",
        "I’ve been trying to work out how much the repairs will cost. (= calculate).",
        "I have five problems to do for homework. I can’t work out any of them. (= solve).",
        "They had been trying to work out a plan to rob a bank. (= think of and make; event; devise).",
        "We have to work out the plan in detail.",
        "Go and work out at the gym every day. That’ll help you keep fit. (= take physical exercise and train the body).",
        "The plan/ idea didn’t work out very well.",
        "I know he’s from Europe, but I can’t work out whether he’s from Germany or any other country there.",
        "(infml) They’re in America, you know. Life is working out well for them there. (= developing in the way mentioned).",
        "His pension works out at Rs. 3650 a month. (= amounts to the sum of money mentioned; is calculated as that sum).",
        "They’ve worked up a good market for their products. (= gradually built or developed it).",
        "They’re planning to work up their business further. (= gradually increase or extend it).",
        "We’ll have to work up some other way of dealing with this situation.",
        "If you want to work up an appetite, the best way is to go for a brisk walk. (= stimulate; develop).",
        "You spoke very well. I liked the way you worked up to the climax. (= moved towards; developed or progress towards).",
        "He started off with the easy questions and worked up to the difficult ones. (= got ready to do them).",
        "He started as an office boy and worked his way up to become general manager.",
        "(infml) You can’t write her off just because she’s lost one game. (= think of her as no good; decide that she won’t win).",
        "They had written him off as a failure — but he became a very successful businessman. (= decide that he won’t be successful).",
        "You won’t be able to recover those debts. You’ll have to write them off. (= treat them as money lost).",
        "There’s no point in trying to get the car repaired. The accident has done so much damage to it. I’ve written it off. (= decided to treat it as of no value or as not worth repairing).",
        "Their marriage has been a complete failure. You can write it off. (= treat it as unsuccessful; treat it as a failure and beyond recovery).",
        "The rioting cannot be written off as an isolated incident.",
        "I’ve collected all the data. Now I’ll have to analyze them and write them up. (= rewrite them in an organized way — by giving a fuller account of them)."
    ]
}