{
    "key": [
        "X: He charged me five rupees too much. ~ Y: Serves you right.",
        "X: He telephoned to say that he wasn’t well. ~ Y: I’m sorry to hear that.",
        "X: Is he coming today? ~ Y: He didn’t say.",
        "X: I got John to straighten my accounts. Y: He must have made a mess of them.",
        "X: Let’s ask him. ~ Y: It’s no good asking him.",
        "X: Get him on the phone. ~ Y: But would it be any use?",
        "X: Get me the diary, will you? ~ Y: Is this it?",
        "X: Can you come on Wednesday? ~ Y: Sorry. I can’t manage Wednesday.",
        "X: Look where you are going. ~ Y: Ah, well.",
        "X: This has happened, because he is too conceited. ~ Y: That’s just it.",
        "X: May I ask him to come over here? ~ Y: Oh, that’d be such a bother for him.",
        "X: How much longer will you take to finish it? ~ Y: Over a quarter of an hour.",
        "X: Let’s not go on with this argument. ~ Y: Oh, all right.",
        "X: This is our house. ~ Y: Oh, yes.",
        "X: I’m very disappointed in your work. ~ Y: I’m sorry you feel like that.",
        "X: She is not as rich as all that. ~ Y: Really? Well, if you say so.",
        "X: Would you mind to do me a favour? ~ Y: No trouble at all.",
        "X: May I bring your bags in? ~ Y: Don’t trouble.",
        "X: Suppose he doesn’t repay the loan. ~ Y: There’s no fear of that.",
        "X: Why not join us in a game? ~ Y: Oh, I don’t think so — I’ll look on.",
        "X: What’ll you do without help? ~ Y: Don’t bother about me. I don’t matter. But what’ll Gopal do?",
        "X: Oh, don’t bother about it. ~ Y: It’s no bother at all.",
        "X: What did she say to you? ~ Y: Oh, nothing particular.",
        "X: May I ask her about it? ~ Y: Just as you like.",
        "X: How do you feel about my plan? ~ Y: I’m for it.",
        "X: What was he like at school? ~ Y: Very bright.",
        "X: Did he bring a lot of things with him? ~ Y: No. Not a thing.",
        "X: It’s jolly here, isn’t it? ~ Y: Yes. Ripping.",
        "X: The doctor has asked me to take rest. ~ Y: Surely the doctor knows best.",
        "X: Do you want any help? ~ Y: Oh, no, don’t bother. I can manage quite well by myself.",
        "X: What do you think about this dress? ~ Y: Rather good.",
        "X: I’m determined to refuse the offer. ~ Y: Oh, come now. You must be reasonable.",
        "X: I think I had better push off. ~ Y: What’s the hurry?",
        "X: How much did it cost? ~ Y: Oh, don’t give it a thought.",
        "X: Why do you look at me like that? ~ Y: Oh, nothing.",
        "X: Do you think I should report this to the Police? ~ Y: I think it’s best.",
        "X: Does the noise bother you? ~ Y: Not at all.",
        "X: Ours is one of the finest gardens here. ~ Y: Oh, really?",
        "X: When do you play foot ball? ~ Y: At the weekends.",
        "X: Does he have any hope left? ~ Y: Not one bit.",
        "X: What was the question paper like? ~ Y: Very easy.",
        "X: Shall we have another game? ~ Y: Let us.",
        "X: Was he hurt badly? ~ Y: No. Not a scratch anywhere.",
        "X: There is no escaping the consequences. ~ Y: I know.",
        "X: I am against cash payments. ~ Y: Oh, I agree.",
        "X: Did I give you a fright? ~ Y: Oh, that’s all right.",
        "X: There is something I want to tell you. Y: Go ahead.",
        "X: He’s sure to scold you. ~ Y: Ah, well.",
        "X: Life here is too expensive. ~ Y: Yes. prices are going up.",
        "X: I think we should find somewhere to sit. ~ Y: I think so, too.",
        "X: I don’t think we should invite them. ~ Y: I don’t think so, either.",
        "X: Did you have trouble finding this place? ~ Y: No. But it wasn’t altogether easy, either.",
        "X: Why did he do it? ~ Y: I simply can’t think.",
        "X: It’s much too expensive. ~ Y: Then he won’t be able to afford it.",
        "X: Somebody has beaten him up. ~ Y: Oh, how terrible!",
        "X: What are they charging? ~ Y: Five rupees, I believe.",
        "X: What was the film like? ~ Y: Utter rubbish.",
        "X: Does he think much of you as an artist? ~ Y: Not likely.",
        "X: Go at once. ~ Y: But what good will that do?",
        "X: Can we smoke here? ~ Y: No, we can’t. It’s out of the question.",
        "X: Won’t he be at home now? ~ Y: Can’t say. He is away quite often.",
        "X: Why don’t we take the next turning on the right? ~ Y: That’s just it. We can’t. Cars don’t go that way.",
        "X: I’m terribly upset about it. ~ Y: Oh, cheer up.",
        "X: Can I take this? ~ Y: If you like.",
        "X: Is he the chap who has just left our office? ~ Y: Yes. He’s the one.",
        "X: The inspection has been put off. ~ Y: Just our luck.",
        "X: It’s 11 O’clock, and the manager hasn’t showed up so far. ~ Y: How odd!",
        "X: What’s his address? ~ Y: I’ll have to find out.",
        "X: What do you feel about the new arrangements? ~ Y: Oh, I’m very pleased.",
        "X: It’s sad about that boy. He has failed again. ~ Y: It’s a pity.",
        "X: Do you know Peter? ~ Y: No. Never heard of him.",
        "X: Do you always eat as much as that? ~ Y: Don’t be silly.",
        "X: It’s nine o’clock. ~ Y: Is that all? I thought it must be eleven or so.",
        "X: They’ve refused point-blank to back us up. ~ Y: So that’s that.",
        "X: I don’t think we’ll be able to help them. ~ Y: Hm. That’d be a pity.",
        "X: What do you do? ~ Y: I’m a carpenter.",
        "X: When do we meet? ~ Y: Whenever it’s convenient to you.",
        "X: He has asked us to tea. ~ Y: It’s very nice of him.",
        "X: What do you think about this? ~ Y: Oh, I really don’t know.",
        "X: He hasn’t given his word, but said he’d let us know later. ~ Y: I don’t much like the sound of that.",
        "X: There has been an accident on the road. ~ Y: Oh, how frightful!",
        "X: What’s his handwriting like? ~ Y: Reasonable.",
        "X: Why not ask him to lunch with us? ~ Y: Good idea.",
        "X: She has not been promoted. ~ Y: That’s a shame.",
        "X: Make some tea at once, will you? ~ Y: Oh, bother.",
        "X: There’s no telling what he’s going to do. ~ Y: I know.",
        "X: What was the food like? ~ Y: Grand.",
        "X: Does he like you very much? ~ Y: No, far from it. He hates me.",
        "X: Where is she living over here? ~ Y: Does it matter all that much?",
        "X: Can I have another go? ~ Y: Not now. It’s my turn next.",
        "X: This packet is too big for the box. ~ Y: Try squeezing it in.",
        "X: It says in the paper that he has been elected. ~ Y: I’m glad.",
        "X: Would that be a better choice, do you think? ~ Y: What on earth are you getting at?",
        "X: It is our fault. ~ Y: Then we must put it right.",
        "X: Let us get going. ~ Y: Hold on a minute.",
        "X: Would a little later suit you better? ~ Y: I can’t wait here all day.",
        "X: What’s his English like? ~ Y: Reasonable.",
        "X: Who do you want to speak to? ~ Y: Have you got a Peter working here?",
        "X: What’s wrong with the blessed thing? ~ Y: Don’t be so impatient.",
        "X: I punched him in the nose. ~ Y: Punching will get you nowhere.",
        "X: What’ll they say about it? ~ Y: How can I tell?",
        "X: What size are your shoes? ~ Y: Size 8.",
        "X: I have a bit of a crisis here. ~ Y: What’s up?",
        "X: He has bought the wrong kind. ~ Y: How terribly annoying!",
        "X: This would do us no good at all. ~ Y: I don’t think so.",
        "X: But have you got time? ~ Y: First of all, make up your own mind.",
        "X: When does it end? ~ Y: Around four.",
        "X: That film is quite fun. ~ Y: Which theatre is it showing at?",
        "X: He can’t afford a car. ~ Y: But this one is too cheap.",
        "X: Is it the one with a long handle? ~ Y: That’s the one.",
        "X: What has he done wrong? ~ Y: He is an unfeeling monster.",
        "X: Don’t most people like it? ~ Y: I don’t think so.",
        "X: Tomorrow is impossible. ~ Y: Would day after tomorrow be more convenient?",
        "X: This is urgent. Be as quick as you can. ~ Y: I had better not.",
        "X: How soon will he be back? ~ Y: He won’t be long.",
        "X: How many more times do you want telling? ~ Y: Are you angry?",
        "X: It’s difficult all right. But you’ll have to manage somehow. ~ Y: Let us see.",
        "X: Are these any good to you? ~ Y: No, thanks. Give them to John.",
        "X: He telephoned to say that he is ill. ~ Y: When?",
        "X: He has ruined the car. ~ Y: He’ll have to pay for it.",
        "X: It was John’s idea, by the sound of it. ~ Y: John’s?",
        "X: Would she agree to it? ~ Y: I shouldn’t be surprised.",
        "X: I can’t think what has happened to him. ~ Y: Ah, here he is!",
        "X: Do you mind him joining us? ~ Y: Not in the least.",
        "X: His patience is amazing. ~ Y: I thought he was a bit dull.",
        "X: I can’t keep up with all these latest developments. ~ Y: You must get into the habit of reading.",
        "X: Can I have a look at the other one? ~ Y: By all means.",
        "X: He is so much better at handling things like this than her. ~ Y: I wonder why.",
        "X: You’re being very obstinate. ~ Y: What can I do if it isn’t good enough?",
        "X: What has gone wrong? ~ Y: They won’t give him permission.",
        "X: Who are you there with? ~ Y: With my sister.",
        "X: What are they charging? ~ Y: Now what’s the matter?",
        "X: It isn’t quite what I have in mind. ~ Y: Will that one do?",
        "X: How’s life, Sita? ~ Y: Rotten.",
        "X: Is she travelling on her own? ~ Y: She insisted on it.",
        "X: You haven’t had your lunch. ~ Y: Never mind about that.",
        "X: It’s all very puzzling. ~ Y: I could hardly believe my eyes.",
        "X: Are you busy? ~ Y: Oh, I’m upto my eyes.",
        "X: Wouldn’t it be better to cut it? ~ Y: As you like.",
        "X: Will a hundred be enough? ~ Y: I forget how much they paid for it.",
        "X: Why don’t you discuss it with him? ~ Y: You know what his views are on that!",
        "X: Look out here. ~ Y: What a magnificent view!",
        "X: Hurry up. ~ Y: Oh, there’s plenty of time.",
        "X: Will Friday suit you better? ~ Y: Any day you like, other than Friday and Saturday.",
        "X: What it amounts to is that you are refusing the offer. ~ Y: Yes, in a way.",
        "X: Tell him why it is important. ~ Y: He won’t hear of it.",
        "X: He has had an accident. ~ Y: Just our luck!",
        "X: It’s no good asking her. ~ Y: What are we waiting for then?",
        "X: Do you mean that seriously? ~ Y: Yes. It’s an absolute disgrace.",
        "X: What good is that sort of behaviour? ~ Y: I was only trying to be a bit helpful.",
        "X: I can’t untie the string. ~ Y: Getting angry won’t help matters.",
        "X: The trouble is that I’m very short of time. ~ Y: Send it to John then.",
        "X: Here’s your book. ~ Y: Did you have a look through it?",
        "X: He can’t do any better. ~ Y: It isn’t his fault.",
        "X: Could you give me a light? ~ Y: Here you are.",
        "X: He has been ill for months. ~ Y: It’s no concern of ours.",
        "X: Did you check it up? ~ Y: It’s our fault all right.",
        "X: Was he as popular as all that? ~ Y: In some ways, yes.",
        "X: Who else have you told about it? ~ Y: Is that all that is worrying you?",
        "X: Will you back me up? ~ Y: Certainly!",
        "X: May I come too? ~ Y: John is coming as well.",
        "X: I can’t eat all of it. ~ Y: Eat at least some of it.",
        "X: I’ve been doing it all my life. ~ Y: Oh, yes.",
        "X: What has made him change his mind? ~ Y: Being rude won’t help matters.",
        "X: I can’t understand his behaving like that. ~ Y: What’s so odd about that?",
        "X: You are trying to make a name for yourself, aren’t you? ~ Y: Do you think so?",
        "X: Is it very valuable? ~ Y: Hardly at all.",
        "X: He didn’t say a word. ~ Y: But I’m determined to carry on.",
        "X: I think he won’t be coming today. ~ Y: It looks like it.",
        "X: When’s the best time to meet him? ~ Y: Try getting him on the phone.",
        "X: Is he happy about the financial side of it? ~ Y: What has it got to do with you?",
        "X: She is thirty. ~ Y: She doesn’t look a day over twenty.",
        "X: Can nothing be done now? ~ Y: Not very much, I’m afraid.",
        "X: Carry on as usual, if you can. ~ Y: What good’ll that do?",
        "X: What’s that shop opposite us? ~ Y: Which one do you mean?",
        "X: His shirt looks shoddy. ~ Y: Oh, no one will notice.",
        "X: I would like to have a look at it. ~ Y: Oh yes.",
        "X: Can you drive on your own? ~ Y: Does it matter?",
        "X: Oh, what ghastly weather for April! ~ Y: Now isn’t that peculiar!",
        "X: You’re crazy not to accept that offer. ~ Y: I don’t agree.",
        "X: You can say what you like. ~ Y: Moaning isn’t going to help matters.",
        "X: He looks quite ill. ~ Y: Ask him to go and lie down.",
        "X: Who are they for? ~ Y: I thought you knew.",
        "X: They want a lakh. ~ Y: That’s quite a large sum.",
        "X: Can I try it after you? ~ Y: Why not ask him?",
        "X: You have put me in a nice mess. ~ Y: Don’t take it that way.",
        "X: Is it so very surprising? ~ Y: You might have warned me.",
        "X: Can we do without them? ~ Y: But they are off to London tomorrow.",
        "X: I haven’t much time. ~ Y: Don’t worry. I won’t be long.",
        "X: I can’t unlock this door. ~ Y: Keep trying.",
        "X: Do you think I’ll take money from you? ~ Y: But what’s the harm of it?",
        "X: He has sprained his elbow. ~ Y: There’s nothing to get upset about.",
        "X: He’s away ill. ~ Y: Poor old chap!",
        "X: Whose turn is it to do the cooking? ~ Y: I wouldn’t mind having a try.",
        "X: It doesn’t sound like her fault. ~ Y: Then whose fault is it?",
        "X: Were any of her class-mates there? ~ Y: Only that tall boy.",
        "X: I’ve got great hopes for you. ~ Y: Well …",
        "X: What are you here for? ~ Y: Don’t you know?",
        "X: You should spend more time on that. ~ Y: It’s all very well to say that.",
        "X: I can’t undo this packet. ~ Y: Cut the string.",
        "X: Ask him to take a loan. ~ Y: Oh, he wouldn’t hear of it.",
        "X: Shall I have a try? ~ Y: That’s not a bad idea.",
        "X: Let us find somewhere to sit. ~ Y: Oh yes, let us.",
        "X: He will never get it right. ~ Y: I’ve got a feeling he will.",
        "X: Get on to him and find out. ~ Y: Our phone is out of order.",
        "X: Is it my fault the train is late? ~ Y: What does a bit of delay matter?",
        "X: Why can’t you leave things alone? ~ Y: Oh, it’s no good hoping.",
        "X: I don’t see what good it’ll do to you. ~ Y: It’s not like that at all.",
        "X: What’s the good of that? ~ Y: I don’t want to be unkind.",
        "X: I’ll take a chance on it. ~ Y: The very best of luck to you!",
        "X: What sort of weather do you have there now? ~ Y: I thought you knew.",
        "X: It sounds to me like jealousy. ~ Y: I’m not so sure about that.",
        "X: Was this all you called me for? ~ Y: I thought we ought to have a talk.",
        "X: Are you certain they’ll help? ~ Y: Now have they ever let me down?",
        "X: Why not go to him straightaway? ~ Y: It isn’t quite the right time.",
        "X: They made rather a mess of it. ~ Y: I’ll give them a good talking to.",
        "X: It’s a foot too long. ~ Y: What is it for?",
        "X: You’ll have to complete it by the next month. ~ Y: Next month would be time enough.",
        "X: You must give him a good talking to. ~ Y: But would that be wise?",
        "X: Loyal employees are getting harder to find. ~ Y: True.",
        "X: What makes you think that’ll do any good? ~ Y: Do stop pestering me.",
        "X: Whose side are you on? ~ Y: That is an interesting question.",
        "X: You’ll have to give up this idea.",
        "Y: I can’t. I do feel strongly about this.",
        "X: I can’t undo the clasp. ~ Y: Try again.",
        "X: Can I go and meet him? ~ Y: There’s no harm in that.",
        "X: Where is the money coming from for all this? ~ Y: Can you find out?",
        "X: I’ve got much worse troubles than that. ~ Y: Rot!",
        "X: He has got a bit of a cold. ~ Y: Let him stay indoors.",
        "X: How did you begin in this company? ~ Y: I came here as an apprentice.",
        "X: Will blaming them solve the problem? ~ Y: I’m tired of excuses."
    ]
}